.*       FW031G13   10FEB12 PRICING                    GFI ITA          FW000010
.*       FW031G12   03JUL03 ETKT                       GFI GLOBFAR      FW000010
.*       FW031G11   20DEC95 UCM8543                    GFI GLOBFAR      FW000010
.*       FW031G10   20SEP94 C098215                    GFI GLOBFAR      FW000020
.*       FW031G09   01SEP94 C000790                    GFI GLOBFAR      FW000030
.*       FW031G08   08AUG94 3020037                    GFI GLOBFAR      FW000040
.*       FW031G07   08AUG94 C098688                    GFI GLOBFAR      FW000050
.*       FW031G06   28JUL94 C000790                    GFI GLOBFAR      FW000060
.*       FW031G05   08JUN94 C097598                    GFI GLOBFAR      FW000070
.*       FW031G04   08JUN94 C097598                    GFI GLOBFAR      FW000080
.*       FW031G02   15DEC93 HAGANM                     GFI GLOBFAR  G02 FW000090
.*       FW031G01   20OCT93 DREWPT                     FAR FARES    G01 FW000100
.*       FW031G00                                                       FW000110
         MACRO                                 FW031G00                 FW000120
&LABEL   FW031G &REG=,&SUFFIX=,&ORG=,&ACPDB=                            FW000130
         GBLB &FW031G10                                                 FW000140
         AIF   (&FW031G10).NOFW031G10MNOTE                              FW000150
&FW031G10 SETB (1)                                                      FW000160
   MNOTE *,'FW031G10 19SEP94 C098215                    GFI GLOBFAR '   FW000170
.NOFW031G10MNOTE ANOP                                                   FW000180
.*                                                                      FW000190
         GBLB  &FW031G1      1ST TIME CALLED SWITCH                     FW000200
         COPY  DBGBL         COPY TPFDB GLOBAL DEFINITIONS              FW000210
         COPY  DBLCL         COPY TPFDB LOCAL DEFINITIONS               FW000220
.*                                                                      FW000230
.*--------------------------------------------------------------------* FW000240
.*             DEFINITIONS FOR TPFDB                                  * FW000250
.*--------------------------------------------------------------------* FW000260
.*                                                                      FW000270
&SW00WRS SETC  'L4'          BLOCK SIZE                                 FW000280
&SW02FIL SETC  'FW031G'      FILE DSECT NAME                            FW000290
&SW00OP1 SETC  '00000000'    OPT BYTE1 (SEE SRGA-06-SAMP DOCUMENT)      FW000300
&SW00OP2 SETC  '00000110'    OPT BYTE2 (SEE SRGA-06-SAMP DOCUMENT)      FW000310
&SW00OP3 SETC  '00000001'    OPT BYTE3 (SEE SRGA-06-SAMP DOCUMENT)      FW000320
&SW00TQK SETC  '15'          HIGHEST TLREC                              FW000330
.********************************************************************** FW000340
         COPY  DBCOD         COPY DSECT DEFINITION FUNCTIONS            FW000350
         AIF   ('&FW031G1' EQ '1').NOT1ST                               FW000360
.*                                                                      FW000370
.*                           W-TYPE                                     FW000380
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * FW000390
*   COPYRIGHT OF THIS MACRO IS THE PROPERTY OF:                       * FW000400
*   GALILEO COMPANY LTD.                         OCTOBER   1990       * FW000410
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * FW000420
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * FW000430
*                                                                     * FW000440
*  1. GENERAL INFORMATION                                             * FW000450
*                                                                     * FW000460
*       NAME   : FW031G                                               * FW000470
*                                                                     * FW000480
*       AUTHOR : MARK HAGAN                                           * FW000490
*                                                                     * FW000500
*  2. ROLE IN SYSTEM                                                  * FW000510
*                                                                     * FW000520
*       THIS FILE IS USED TO BUILD THE GLOBALFARES DATA LREC'S WHICH  * FW000530
*       WILL BE USED BY THE FAB PROGRAMS TO BUILD THE GFI DATA BLOCK. * FW000540
*                                                                     * FW000550
*  3. DATA LREC USAGE                                                 * FW000560
*                                                                     * FW000570
*       PKY= X'38'   DATA IDENTIFIER= DATA LRECS                      * FW000580
*                                                                     * FW000590
*  4. LREC ORGANISATION (UP/DOWN, WHAT FIELDS)                        * FW000600
*                                                                     * FW000610
*       NOORG                                                         * FW000620
*                                                                     * FW000630
*  5. SPECIAL PROGRAMMING CONSIDERATIONS                              * FW000640
*                                                                     * FW000650
*       PRIME AND CHAINS ARE BOTH 4K SHORT TERM POOL                  * FW000660
*                                                                     * FW000670
*  6. REFERENCES                                                      * FW000680
*       ..........................................................    * FW000690
*                                                                     * FW000700
*  7. COMMENTS                                                        * FW000710
*       ..........................................................    * FW000720
*                                                                     * FW000730
*-------------------------------------------------------------------G01 FW000740
*                                                                   G01 FW000750
*   AMENDMENT FLAG : G01                                            G01 FW000760
*                                                                   G01 FW000770
*   AUTHOR : PHILIP DREW                    DATE : 20 OCT 1993      G01 FW000780
*                                                                   G01 FW000790
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : PR5497           G01 FW000800
*                                                                   G01 FW000810
*   INDICTOR EQUATES FOR JT SECTION INCORRCT.                       G01 FW000820
*                                                                   G01 FW000830
*-------------------------------------------------------------------G01 FW000840
*-------------------------------------------------------------------G02 FW000850
*                                                                   G02 FW000860
*   AMENDMENT FLAG : G02                                            G02 FW000870
*                                                                   G02 FW000880
*   AUTHOR : MARK HAGAN                     DATE : 15 DEC 1993      G02 FW000890
*            DAVE STEWART                          27 DEC 1993      G02 FW000900
*                                                                   G02 FW000910
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : PR5497           G02 FW000920
*                                                                   G02 FW000930
* 1.ADD NEW C6.. LREC USED TO CALL THE FGU6 WARNING MESSAGE UTILITY G02 FW000940
* 2.ADD NEW EQUATE TO PD LREC FOR INFANT IN BOOKING FILE            G02 FW000950
*                                                                   G02 FW000960
*-------------------------------------------------------------------G02 FW000970
*-------------------------------------------------------------------G02 FW000980
*                                                                   G02 FW000990
*   AMENDMENT FLAG : G03                                            G03 FW001000
*                                                                   G03 FW001010
*   AUTHOR : BRENDA GROENWALD/ANDY SABO     DATE : 17 MAR 1994      G03 FW001020
*                                                                   G03 FW001030
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER :  005758          G03 FW001040
*                                                                   G03 FW001050
*   ADDED NEW AREAS FOR FLIGHT LED AVAILABILITY AND PSEUDO ITINS,   G03 FW001060
*   AND ADDED/MODIFIED FIELDS IN EXISTING AREAS TO REMAIN IN SYNC   G03 FW001070
*   WITH APOLLO. ALSO ADDED CLASS OF SERVICE TO IS LREC FOR FILED   G03 FW001080
*   FARE PROCESSING.                                                G03 FW001090
*                                                                   G03 FW001100
*---------------------------------------------------------------------* FW001110
*                                                                   G04 FW001120
*   AMENDMENT FLAG : G04                                            G04 FW001130
*                                                                   G04 FW001140
*   AUTHOR : J. PENNECK / B. GROENWALD      DATE : 20 MAY 1994      G04 FW001150
*                                                                   G04 FW001160
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER :  005579          G04 FW001170
*                                                                   G04 FW001180
*   ADDED NEW LRECS FOR FLYGTAXI AS FOLLOWS :-                      G04 FW001190
*   'C608' - FLYGTAXI 'IT' LREC FOR FLYGTAXI PRICING.               G04 FW001200
*   'C609' - FLYGTAXI 'SR' LREC FOR SEGMENT RELATED DATA.           G04 FW001210
*   'C60A' - FLYGTAXI 'GQ' LREC FOR GENERAL QUOTE INFO / PRICING    G04 FW001220
*   'C60B' - FLYGTAXI 'SM' LREC FOR SEGMENT MAPPING.                G04 FW001230
*                                                                   G04 FW001240
*   MODIFIED SX LREC FOR FQP FOLLOW ONS ?                           G04 FW001250
*                                                                   G04 FW001260
*---------------------------------------------------------------------* FW001270
*                                                                   G05 FW001280
*   AMENDMENT FLAG : G05                                            G05 FW001290
*                                                                   G05 FW001300
*   AUTHOR : JAMES PENNECK                  DATE : 8 JUNE 1994      G05 FW001310
*                                                                   G05 FW001320
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER :  005579          G05 FW001330
*                                                                   G05 FW001340
*   CHANGED 'C60B' LREC TO BE FLYGTAXI FARE CONSTRUCTION LREC       G05 FW001350
*   ADDED 'C60C' LREC WHICH CONTAINS A LIST OF ALL THE CITY PAIRS   G05 FW001360
*   IN THE ITINERARY.                                               G05 FW001370
*---------------------------------------------------------------------* FW001380
*                                                                   G06 FW001390
*   AMENDMENT FLAG : G06                                            G06 FW001400
*                                                                   G06 FW001410
*   AUTHOR : DAVE STEWART                   DATE : 26 JUL 1994      G06 FW001420
*                                                                   G06 FW001430
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER :                  G06 FW001440
*                                                                   G06 FW001450
*   EXPAND PD LREC TO ALLOW FOR 4 CHARACTER PASSENGER DESCRIPTIONS  G06 FW001460
*   FOR ALITALIA.                                                   G06 FW001470
*                                                                   G06 FW001480
*---------------------------------------------------------------------* FW001490
*                                                                   G07 FW001500
*   AMENDMENT FLAG : G07                                            G07 FW001510
*                                                                   G07 FW001520
*   AUTHOR : ANDY SABO                      DATE : 08 AUG 1994      G07 FW001530
*                                                                   G07 FW001540
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER :                  G07 FW001550
*                                                                   G07 FW001560
*   ADD C60E LREC FOR GMT DATE ADJUSTMENT ON FARE DISPLAY ENTRIES   G07 FW001570
*   THAT MUST USE DEFAULT DATE PROCESSING.  ADD C60D LREC TO SAVE   G07 FW001580
*   FARE DISPLAY DATA IN THE EXCHANGE FILE WHICH WILL BE FILED      G07 FW001590
*   IN THE FR0F1G POOL FILE FOR FOLLOW-ON PROCESSING.               G07 FW001600
*                                                                   G07 FW001610
*---------------------------------------------------------------------* FW001620
*                                                                   G08 FW001630
*   AMENDMENT FLAG : G08                                            G08 FW001640
*                                                                   G08 FW001650
*   AUTHOR : BARBARA MCINTOSH               DATE : 08 AUG 1994      G08 FW001660
*                                                                   G08 FW001670
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : 5579             G08 FW001680
*                                                                   G08 FW001690
*   ADD TAGS FOR FLYGTAXI F0B LREC FOR NUC TOTAL AMOUNT             G08 FW001700
*   ADD EQUATES FOR EFLA CONTROL LREC (TEMPORARILY ASSIGNED F0)     G08 FW001710
*                                                                   G08 FW001720
*---------------------------------------------------------------------* FW001730
*                                                                  AG09 FW001740
*   AMENDMENT FLAG : AG09                                          AG09 FW001750
*                                                                  AG09 FW001760
*   AUTHOR : JAMES PENNECK                  DATE : 19 AUG 1994     AG09 FW001770
*                                                                  AG09 FW001780
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : 03761D          AG09 FW001790
*                                                                  AG09 FW001800
*   ADD INDICATOR TO REQUEST HISTORICAL FARE QUOTE.                AG09 FW001810
*                                                                  AG09 FW001820
*---------------------------------------------------------------------* FW001830
*                                                                  BG09 FW001840
*   AMENDMENT FLAG : BG09                                          BG09 FW001850
*                                                                  BG09 FW001860
*   AUTHOR : DAVE STEWART                   DATE : 01 SEP 1994     BG09 FW001870
*                                                                  BG09 FW001880
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : 5828            BG09 FW001890
*                                                                  BG09 FW001900
*   ALIGN THE FW03 EFLA LRECS WITH THE GLOBALFARES GFI EFLA LRECS  BG09 FW001910
*                                                                  BG09 FW001920
*---------------------------------------------------------------------* FW001930
*                                                                   G10 FW001940
*   AMENDMENT FLAG : G10                                            G10 FW001950
*                                                                   G10 FW001960
*   AUTHOR : NANCY KIMBER                   DATE : OCTOBER 1994     G10 FW001970
*                                                                   G10 FW001980
*   PROBLEM/ENHANCEMENT MANAGEMENT SYSTEM NUMBER : 005740           G10 FW001990
*                                                                   G10 FW002000
*   BSR/BBR/ICH CURRENCY CONVERSION PROJECT:  IN THE FZ LREC,       G10 FW002010
*   ADD INDICATORS AND A 2ND DATE FOR THE AUDIT TRAIL.  IN THE      G10 FW002020
*   QH AND FZ LRECS REMOVE FZ FIELDS THAT ARE NOT SUPPORTED.        G10 FW002030
*   ADD NEW ZA LREC FOR FZI ADDITION AMOUNTS.                       G10 FW002040
*   ALSO ADD A COMPANION FARE EQUATE BACK IN FOR ANDY SABO.      G10G07 FW002050
*                                                                   G10 FW002060
*---------------------------------------------------------------------* FW002070
*                                                                     * FW002080
*   START OF BRITISH AIRWAYS AMENDMENTS.                              * FW002090
*                                                                     * FW002100
*   AMENDMENT 01       JEREMY SHORT         AUGUST 1994               * FW002110
*   ADD NEW INDICATOR IN SEGMENT MAPPING (SM) RECORD TO INDICATE      * FW002120
*   THAT THE QUOTE IS NOT FOR ALL SEGMENTS IN THE PNR.                * FW002130
*                                                                     * FW002140
*--------------------------------------------------------------------02 FW002150
*                                                                    02 FW002160
*   AMENDMENT FLAG :  02                                             02 FW002170
*                                                                    02 FW002180
*   AUTHOR : ANDREW HODKIN                  DATE : 31 JAN 1995       02 FW002190
*                                                                    02 FW002200
*   MUST/MUST NOT/MUST ONLY BREAK MODIFIERS FOR FQ.                  02 FW002210
*                                                                    02 FW002220
*--------------------------------------------------------------------02 FW002230
*                                                                    03 FW002240
*   AMENDMENT FLAG :  03                                             03 FW002250
*                                                                    03 FW002260
*   AUTHOR : LIAM DUNPHY                    DATE : 06 MAR 1995       03 FW002270
*                                                                    03 FW002280
*   BOOKING CLASS MATCH ENHANCEMENT FOR GIBA TABLE.                  03 FW002290
*   GIBA = GLOBAL INTERLINE BILATERAL AGREEMENT                      03 FW002300
*   ASSIGN 2 NEW FIELDS TO 'LB' LREC FOR A SECONDARY CARRIER CODE.   03 FW002310
*   ADD AN INDICATOR BYTE FOR GIBA DATA ACCESS CONTROL.              03 FW002320
*                                                                    03 FW002330
*--------------------------------------------------------------------03 FW002340
*                                                                    04 FW002350
*   AMENDMENT FLAG :  04                                             04 FW002360
*                                                                    04 FW002370
*   AUTHOR : ANDREW HODKIN                  DATE : 07 JUL 1995       04 FW002380
*                                                                    04 FW002390
*   MULTIPLE SELLING CURRENCIES.                                     04 FW002400
*                                                                    04 FW002410
*   ALLOW JNT, RTW AND CTF MODIFIERS TO COMBINE.                     04 FW002420
*                                                                    04 FW002430
*--------------------------------------------------------------------05 FW002440
*                                                                    05 FW002450
*   AMENDMENT FLAG :  05                                             05 FW002460
*                                                                    05 FW002470
*   KATE CARRUTHERS                                  MARCH 1996      05 FW002480
*                                                                    05 FW002490
*   PRAT 2/96 FARE RULES DELIMITERS                                  05 FW002500
*   NEW INDICATORS :                                                 05 FW002510
*   FW03QASUM BIT3 - FULL FARE RULES DISPLAY FOLLOWING FARE DISPLAY  05 FW002520
*   FW03QDSUM BIT3 - FULL FARE RULES DISPLAY FOLLOWING FARE QUOTE    05 FW002530
*                                                                    05 FW002540
*--------------------------------------------------------------------06 FW002550
*                                                                    06 FW002560
*   AMENDMENT FLAG :  06                                             06 FW002570
*                                                                    06 FW002580
*   KATE CARRUTHERS                                 AUGUST 1996      06 FW002590
*                                                                    06 FW002600
*   PRAT 9/96 HALF ROUND TRIP NUC MODIFIER                           06 FW002610
*   NEW INDICATOR :                                                  06 FW002620
*   FW03Q2DI2 BIT4 - HALF ROUND TRIP NUC MODIFIER (/2) PRESENT IN    06 FW002630
*   FARE DISPLAY REQUEST E.G. FD12AUGLHRJFK/2                        06 FW002640
*                                                                    06 FW002650
*--------------------------------------------------------------------07 FW002660
*                                                                    07 FW002670
*   AMENDMENT FLAG :  07                                             07 FW002680
*                                                                    07 FW002690
*   KATE CARRUTHERS                                 SEPTEMBER 1997   07 FW002700
*                                                                    07 FW002710
*   PRAT 9/97 REPLY GFI TO CONTAIN "M" STATUS CODE IF STOPOVER       07 FW002720
*   MODIFIERS WERE USED IN THE FARE QUOTE ENTRY.                     07 FW002730
*   NEW INDICATOR :                                                  07 FW002740
*   FW03QIIT2 BIT4 - STOPOVER MODIFIERS USED IN INPUT.               07 FW002750
*                                                                    07 FW002760
*--------------------------------------------------------------------07 FW002770
*SERPIL KURUUZUMCU   SEP 98
* MULTIPLE SELLING CURRENCIES &
* EMU GLOBAL FARES MODIFICATIONS.NEW INDICATORS HAS BEEN ADDED
* ACCORDING TO THE SPECIFICATIONS FROM GALILEO IN ORDER TO SUPPORT
* NEW CURRENCY 'EURO' IN FARE DISPLAY/QUOTE
*********************************************************************** FW002770
*        ADD ZP CODE FIELDS.       28 AUG 2002   FILIZ MATUR          * FT001630
*                                                    TK4476           * FT001640
*********************************************************************** FW002770
* DOMESTIC FQ MODIFICATIONS. ADD NEW LRECS.ST AND PS LREC.            * FT001630
* ST-  TICKETTING DATE                                                * FT001640
* PS-  PASSENGER DESCRIPTION FOR DOMESTIC                             * FT001640
* TK4487                 FILIZ MATUR            19 MAR 03             * FT001640
*********************************************************************** FW002770
* ADD DEPARTMENT CODE OPTION TO PRIVATE FARES.                        * FT001630
* PQ- ENHANCE PRIVATE FARE FIXED INFORMATION                          * FT001640
* PW- ENHANCE PRIVATE FARE VARIABLE INFORMATION                       * FT001640
* TK4574                 OKTAY ZAN                 MAR 03             * FT001640
*********************************************************************** FW002770
* ADD IC SECTION FOR CODE SHARE INFO AND ITIN ADDITIONAL INFO         * FT001630
*  IC SECTION- ITINERARY CODESHARE INFO                               * FT001640
* ADD CW SECTION FOR CATEGORY WAVE DURING ITA FQ                      * FT001630
*  CW SECTION- CATEGORY NUMBER INFO FORE WAVE THE RULE                * FT001640
* ADD CS SECTION FOR SEGMENT SCHEDULE INFO FOR ITA                    * FT001630
*  CS SECTION- SCHEDULE INFO FOR EVERY IT LREC                        * FT001640
* TK-PRICING             OKTAY ZAN                 FEB 12             * FT001640
*********************************************************************** FW002770
* ADD DU SECTIION                                                     * FT001630
* DU- INCLUDE DU TAX SECTION                                          * FT001640
* TK-KOLAYBILET          OKTAY ZAN                 MAY 12             * FT001640
*********************************************************************** FW002770
* ADD FK SECTION                                                      *
* FK- INCLUDE THE FARE CALCULATION FOR REPRICING (REISSUE FQ)         *
* TK-PRICING             OKTAY ZAN                 SEP 12             *
***********************************************************************
* ADD FK SECTION                                                      *
* MN- INCLUDE THE FARE DETAILS                   (REISSUE FQ)         *
* XT- INCLUDE THE TAX  DETAILS                   (REISSUE FQ)         *
* OG- INCLUDE THE ORIGINAL ISSUE DETAILS         (REISSUE FQ)         *
* II- INCLUDE THE ISSUED IN EXCHANGE FOR         (REISSUE FQ)         *
* TK-PRICING             OKTAY ZAN                 SEP 12             *
***********************************************************************
         EJECT                                                          FW002780
         AIF   ('&SW00WRS' EQ '').CHECKID                               FW002790
#FW031GS EQU   &SW00WRS      BLOCK SIZE                                 FW002800
.CHECKID AIF   ('&SW00WID' EQ '').NOT1ST                                FW002810
#FW031GI EQU   X'&SW00WID'   FILE ID                                    FW002820
.NOT1ST  ANOP                                                           FW002830
*                                                                       FW002840
*---------------------------------------------------------------------* FW002850
*        STANDARD TPFDB HEADER                                        * FW002860
*---------------------------------------------------------------------* FW002870
*                                                                       FW002880
FW03HDR&CG1 DS  CL16         STANDARD FILE HEADER                       FW002890
            DS  CL28         STANDARD TPFDB HEADER (INCL UKY)           FW002900
FW03VAR&CG1 EQU *            START OF VARIABLE USER-AREA                FW002910
#FW03HDL&CG1 EQU FW03VAR&CG1-FW03HDR&CG1  HEADER-LENGTH UP TO FW03VAR   FW002920
          ORG  FW03HDR&CG1                                              FW002930
*                                                                       FW002940
FW03REC&CG1 DS  0CL1         1ST RECORD START (1=VARIABLE,ELSE SIZE)    FW002950
FW03SIZ&CG1 DS  XL2          SIZE OF LOGICAL RECORD                     FW002960
FW03KEY&CG1 DS  X            LOGICAL RECORD IDENTIFIER                  FW002970
*                                                                       FW002980
FW03LID&CG1 DS 0XL2          LREC IDENTIFIER                            FW002990
FW03DID&CG1 DS  XL2          DATA IDENTIFIER                            FW003000
FW03UKY&CG1 DS  XL2          UNIQUE REFERENCE KEY                       FW003010
FW03USR&CG1 EQU *            START OF USER DATA                         FW003020
*                                                                       FW003030
         AIF   ('&FW031G1' EQ '1').KEYEQ  GO IF NOT FIRST ISSUE         FW003040
*---------------------------------------------------------------------* FW003050
*        EQUATE OF LOGICAL RECORD KEYS (PKY=)                         * FW003060
*---------------------------------------------------------------------* FW003070
*                                                                       FW003080
#FW03K38 EQU   X'38'         DATA LREC                                  FW003090
#FW03DAT EQU   X'38'         DATA LREC                                  FW003100
*                                                                       FW003110
*---------------------------------------------------------------------* FW003120
*        EQUATE ALL DATA IDENTIFIER VALUES HERE (LREC TYPES)          * FW003130
*---------------------------------------------------------------------* FW003140
*                                                                       FW003150
* : INTERNAL LREC'S:-                                                   FW003160
*                                                                       FW003170
#FW03DLL EQU C'LL'        DATA ID FOR LREC LIST FOR FGU0                FW003180
#FW03DPM EQU C'PM'        DATA ID FOR PARAMETER/MODIFIER DATA           FW003190
#FW03DSX EQU C'SX'        DATA ID FOR SEGMENT RELATED INFORMATION       FW003200
#FW03DFF EQU C'FF'        DATA ID FOR FARE FAMILY SEGMENT RLT INFTKFM   FW003200
#FW03DTV EQU C'TV'        DATA ID FOR DISPLAY LREC                      FW003210
#FW03DPD EQU C'PD'        DATA ID OF PASSENGER DESCRIPTION LREC         FW003220
#FW03DAS EQU C'AS'        DATA ID OF ARUNK SEGMENT INFORMATION          FW003230
#FW03DBB EQU C'BB'        DATA ID OF BEST BUY QUESTION LREC             FW003240
#FW03DFT EQU C'FT'        DATA ID OF TICKETING MODIFIERS                FW003250
#FW03DBU EQU C'BU'        DATA ID OF BF ACCESS UTILITY CONTROL LREC     FW003260
#FW03DF1 EQU X'C601'      DATA ID OF BEST BUY ANSWER LREC               FW003270
#FW03DF2 EQU X'C602'      DATA ID OF PASSENGER DESCRIPTION TABLE LREC   FW003280
#FW03DF3 EQU X'C603'      DATA ID OF LREC FOR FILED FARE                FW003290
#FW03DF4 EQU X'C604'      DATA ID OF LREC WITH NO OF FARES IN FQA       FW003300
#FW03DF5 EQU X'C605'      DATA ID OF LREC INDICATING REQUIRED WARNINGS  FW003310
#FW03DF6 EQU X'C606'      DATA ID OF LREC FOR FARES LED AVAILABILITY    FW003320
#FW03DF7 EQU X'C607'      DATA ID OF LREC FOR BEST BUY REBOOK INFO      FW003330
#FW03DF8 EQU X'C608'      DATA ID OF LREC FOR FLYGTAXI 'IT' LREC    G04 FW003340
#FW03DF9 EQU X'C609'      DATA ID OF LREC FOR FLYGTAXI 'SR' LREC    G04 FW003350
#FW03DFA EQU X'C60A'      DATA ID OF LREC FOR FLYGTAXI 'GQ' LREC    G04 FW003360
#FW03DFB EQU X'C60B'      DATA ID OF LREC FOR FLYGTAXI 'FC' LREC    G05 FW003370
#FW03DCC EQU X'C60C'      DATA ID OF LREC FOR FLYGTAXI CITY PAIRS   G05 FW003380
#FW03DDD EQU X'C60D'      DATA ID OF LREC FOR GMT DATE ADJUSTMENT   G07 FW003390
#FW03DEE EQU X'C60E'      DATA ID OF LREC FOR FARE DISPLAY DATA     G07 FW003400
*                                                                       FW003410
* : INTERFACE COMBINED QUERY/REPLY LREC'S:-                             FW003420
*                                                                       FW003430
#FW03DBC EQU C'BC'        DATA ID FOR BOOKING CLASS INFORMATION         FW003440
#FW03DBK EQU C'BK'        DATA ID FOR BEST BUY BOOKING CLASS            FW003450
#FW03DFL EQU C'FL'        DATA ID FOR FLT LED AVLBLTY JOURNEY ITEM  G03 FW003460
#FW03DPI EQU C'PI'        DATA ID FOR PASSENGER INFORMATION             FW003470
#FW03DPS EQU C'PS'        DATA ID FOR PASSENGER INFORMATION     TK4487  FW003470
#FW03DST EQU C'ST'        DATA ID FOR SALES DATE FOR HISTORICAL TK4487  FW003470
#FW03DUC EQU C'UC'        DATA ID FOR UPGRADE CLASS INFO     TK004477   FW003470
#FW03DTK EQU C'TK'        DATA ID FOR REISSUE FROM ETKT DBASE   FILIZ   FW003470
#FW03DCL EQU C'CL'        DATA ID FOR REISSUE FROM ETKT DBASE   FILIZ   FW003470
#FW03DPQ EQU C'PQ'        DATA ID FOR PRIVATE FARE FIXED INFO   TK4574  FW003470
#FW03DPW EQU C'PW'        DATA ID FOR PRIVATE FARE VARIOABLE INFTK4574  FW003470
#FW03DIC EQU C'IC'        DATA ID FOR PRICING CODESHARE INFO TK-PRICING FW003470
#FW03DCW EQU C'CW'        DATA ID FOR CAT.WAVE INFO          TK-PRICING FW003470
#FW03DCS EQU C'CS'        DATA ID FOR SHEDULE  INFO          TK-PRICING FW003470
#FW03DTD EQU C'TD'        DATA ID FOR INCLUDE DU TAX      TK-KOLAYBILET FW003470
#FW03DGR EQU C'GR'        DATA ID FOR INCLUDE GR TAX      TK-PRC.GRMS   FW003470
#FW03DRP EQU C'RP'        DATA ID FOR INCLUDE RP PERC.    TK-PRICING    FW003470
#FW03DFK EQU C'FK'        DATA ID FOR INCLUDE FARE CALC   TK-PRICING    FW003470
#FW03DOG EQU C'OG'        DATA ID FOR INCLUDE ORG.ISSUE   TK-PRICING    FW003470
#FW03DIE EQU C'IE'        DATA ID FOR INCLUDE ISSUED EXC.FTK-PRICING    FW003470
#FW03DEN EQU C'EN'        DATA ID FOR INCLUDE ENDORSMENT  TK-PRICING    FW003470
#FW03DMN EQU C'MN'        DATA ID FOR INCLUDE ENDORSMENT  TK-PRICING    FW003470
#FW03DIP EQU C'IP'        DATA ID FOR INCLUDE PRICING INFOTK-P016508    FW003470
#FW03DXT EQU C'XT'        DATA ID FOR INCLUDE TAX DETAILS TK-PRICING    FW003470
#FW03DFR EQU C'FR'        DATA ID FOR FLA FARE DISPLAY DETAIL       G03 FW003480
*                                                                       FW003490
* : QUERY LREC'S:-                                                      FW003500
*                                                                       FW003510
#FW03DQH EQU C'QH'        DATA ID FOR QUERY HEADER                      FW003520
#FW03DUA EQU C'UA'        DATA ID FOR USER AUTHENTICATION  TKFM         FW003520
#FW03DF0 EQU C'F1'        DATA ID FOR FLA CONTROL INFO              G08 FW003530
#FW03DFD EQU C'FD'        DATA ID FOR FARE DISPLAY                      FW003540
#FW03DIM EQU C'IM'        DATA ID FOR INPUT MESSAGE                     FW003550
#FW03DNB EQU C'NB'        DATA ID FOR AGENT INPUT NUMBER                FW003560
#FW03DMQ EQU C'MQ'        DATA ID FOR AUX/LEG MILEAGE                   FW003570
#FW03DRI EQU C'RI'        DATA ID FOR SPECIFIC RULES DISPLAY            FW003580
#FW03DRF EQU C'RF'        DATA ID FOR RULES DISPLAY FOLLOWING FQS FQ    FW003590
#FW03DRL EQU C'RL'        DATA ID FOR LONG RULES DISPLAY FOR FQS        FW003600
#FW03DRD EQU C'RD'        DATA ID FOR RULES DISPLAY FROM FARE DISPLAY   FW003610
#FW03DLB EQU C'LB'        DATA ID FOR BOOKING CODE INFORMATION DISPLAY  FW003620
#FW03DFE EQU C'FE'        DATA ID FOR FLIGHT TYPE TABLE                 FW003630
#FW03DFU EQU C'FU'        DATA ID FOR FOLLOW-UPS TO FARE QUOTE ENTRIES  FW003640
#FW03DCP EQU C'CP'        DATA ID FOR CITY PAIR TEXT DATABASE ENTRIES   FW003650
#FW03DFZ EQU C'FZ'        DATA ID FOR CURRENCY CONVERSION FZ ENTRY      FW003660
#FW03DZA EQU C'ZA'        DATA ID FOR FZI CURRENCY ADDITION AMOUNTS G10 FW003670
#FW03DGI EQU C'GI'        DATA ID FOR GENERAL QUOTE INFORMATION         FW003680
#FW03DIT EQU C'IT'        DATA ID FOR ITINERARY INFORMATION             FW003690
#FW03DIA EQU C'IA'        DATA ID FOR ANCILLARY ITIN INFO   TKT-61      FW003690
#FW03DRA EQU C'RA'        DATA ID FOR ANCILLARY RFC CODE    TKT-61      FW003690
#FW03DRB EQU C'RB'        DATA ID FOR ANCILLARY/TABLE       TKT-..AC2   FW003690
#FW03DRC EQU C'RC'        DATA ID FOR ANCILLARY SSR CODE    TKT-..AC2   FW003690
#FW03DPE EQU C'PE'        DATA ID FOR PENALTY MODIFIER SECTION          FW003700
#FW03DLF EQU C'LF'        DATA ID FOR LINE OF FLIGHT INFORMATION        FW003710
#FW03DPC EQU C'PC'        DATA ID FOR US PFC DISPLAY                    FW003720
#FW03DLR EQU C'LR'        DATA ID FOR ROUTING DISPLAY FOLLOW-UP TO FD   FW003730
*TK1000 #FW03DTE EQU C'TE'        DATA ID FOR TAX EXEMPT CODES ON 'FQ'  FW003740
#FW03DTE EQU C'TA'        DATA ID FOR TAX EXEMPT CODES ON 'FQ' TK1000   FW003740
#FW03DTX EQU C'TX'        DATA ID FOR TAX INFORMATION BY COUNTRY        FW003750
#FW03DPV EQU C'PV'        DATA ID FOR PRIVATE FARES INFORMATION         FW003760
*                                                                       FW003770
* : REPLY LREC'S:-                                                      FW003780
*                                                                       FW003790
#FW03DRH EQU C'RH'        DATA ID FOR REPLY HEADER                      FW003800
#FW03DOM EQU C'OM'        DATA ID FOR OUTPUT MESSAGE                    FW003810
#FW03DMP EQU C'MP'        DATA ID FOR AUX/LEG MILEAGE PRIMARY ITEM      FW003820
#FW03DMS EQU C'MS'        DATA ID FOR AUX/LEG MILEAGE SUB-ITIN ITEM     FW003830
#FW03DFC EQU C'FC'        DATA ID FOR FARE CONSTRUCTION                 FW003840
#FW03DGQ EQU C'GQ'        DATA ID FOR GENERAL QUOTE                     FW003850
#FW03DAD EQU C'AD'        DATA ID FOR ADDITIONAL QUOTE                  FW003850
#FW03DPN EQU C'PN'        DATA ID FOR PASSENGER NAME                    FW003850
#FW03DIS EQU C'IS'        DATA ID FOR ITINERARY SUMMARY                 FW003860
#FW03DMM EQU C'MM'        DATA ID FOR INFORMATIONAL MESSAGES            FW003870
#FW03DFO EQU C'FO'        DATA ID FOR FIC OVERRIDE                      FW003880
#FW03DTS EQU C'TS'        DATA ID FOR TAX BREAKDOWN                     FW003890
#FW03DPF EQU C'PF'        DATA ID FOR PASSENGER FACILITY CHARGES        FW003890
#FW03DSR EQU C'SR'        DATA ID FOR SEGMENT SUMMARY                   FW003900
#FW03DPU EQU C'PU'        DATA ID FOR PLUS UP INFORMATION               FW003910
#FW03DSM EQU C'SM'        DATA ID OF LREC FOR SEGMENT NUMBER MAPPING    FW003920
#FW03DJT EQU C'JT'        DATA ID FOR JOURNEY TYPE ITEMS            G03 FW003930
#FW03DSU EQU C'SU'        DATA ID FOR SURCHARGE ITEMS               G03 FW003940
#FW03DCI EQU C'CI'        DATA ID FOR CITY INDICATORS               G03 FW003950
#FW03DFP EQU C'FP'        DATA ID FOR SURCHARGE ITEMS               G03 FW003960
#FW03DVA EQU C'VA'        DATA ID FOR VENDOR ACTION CODE            G03 FW003970
#FW03DEQ EQU C'EQ'    ENHANCED GENERAL QUOTE INFORMATION FOR FQ..,$B..  FW003970
#FW03DTN EQU C'TN'    NET FARE TAX SECTION (CATEGORY 35 FARES)          FW003970
#FW03DTT EQU C'TT'    TICKETING FARE TAX SECTION (CATEGORY 35 FARES)    FW003970
#FW03DCZ EQU C'CZ'        DATA ID FOR CEZA FARE FOR REFUND TK-P011747   FW003480
*                                                                       FW003980
*---------------------------------------------------------------------* FW003990
*        EQUATE ALL LREC LENGTHS (MANDITORY AND OPTIONAL AREAS)       * FW004000
*---------------------------------------------------------------------* FW004010
*                                                                       FW004020
*        EQUATE FOR THE LENGTH OF THE FIXED PORTION OF EACH DATA LREC * FW004030
#FW03LTH EQU   FW03USR&CG1-FW03REC&CG1    LENGTH OF TPFDB HEADER <----  FW004040
#FW03LLL EQU   FW03ELL&CG1-FW03REC&CG1    LENGTH OF 'LL' LREC           FW004050
#FW03LPM EQU   FW03EPM&CG1-FW03REC&CG1    LENGTH OF 'PM' LREC           FW004060
#FW03LSX EQU   FW03ESX&CG1-FW03REC&CG1    LENGTH OF 'SX' LREC           FW004070
#FW03LFF EQU   FW03EFF&CG1-FW03REC&CG1    LENGTH OF 'FF' LREC           FW004070
#FW03LOR EQU   FW03EOR&CG1-FW03REC&CG1    LENGTH OF 'OR' LREC           FW004070
#FW03LTV EQU   FW03ETV&CG1-FW03REC&CG1    LENGTH OF 'TV' LREC           FW004080
#FW03LBC EQU   FW03EBC&CG1-FW03REC&CG1    LENGTH OF 'BC' LREC           FW004090
#FW03LBK EQU   FW03EBK&CG1-FW03REC&CG1    LENGTH OF 'BK' LREC           FW004100
#FW03LFL EQU   FW03EFL&CG1-FW03REC&CG1    LENGTH OF 'FL' LREC       G03 FW004110
#FW03LPI EQU   FW03EPI&CG1-FW03REC&CG1    LENGTH OF 'PI' LREC           FW004120
#FW03LPS EQU   FW03EPS&CG1-FW03REC&CG1    LENGTH OF 'PS' LREC    TK4487 FW004120
#FW03LST EQU   FW03EST&CG1-FW03REC&CG1    LENGTH OF 'ST' LREC    TK4487 FW004120
#FW03LUC EQU   FW03EUC&CG1-FW03REC&CG1    LENGTH OF 'UC' LREC  TK004477 FW004120
#FW03LTK EQU   FW03ETK&CG1-FW03REC&CG1    LENGTH OF 'TK' LREC    FILIZ  FW004120
#FW03LCL EQU   FW03ECL&CG1-FW03REC&CG1    LENGTH OF 'CL' LREC    FILIZ  FW004120
#FW03LPQ EQU   FW03EPQ&CG1-FW03REC&CG1    LENGTH OF 'PQ' LREC    TK4574 FW004120
#FW03LPW EQU   FW03EPW&CG1-FW03REC&CG1    LENGTH OF 'PW' LREC   CQ25432 FW004120
#FW03LIC EQU   FW03EIC&CG1-FW03REC&CG1    LENGTH OF 'IC' LRECTK-PRICING FW004120
#FW03LCW EQU   FW03ECW&CG1-FW03REC&CG1    LENGTH OF 'CW' LRECTK-PRICING FW004120
#FW03LCS EQU   FW03ECS&CG1-FW03REC&CG1    LENGTH OF 'CS' LRECTK-PRICING FW004120
#FW03LTD EQU   FW03ETD&CG1-FW03REC&CG1    LENGTH OF 'TD' LRECTK-KOLAYBI FW004120
#FW03LGR EQU   FW03EGR&CG1-FW03REC&CG1    LENGTH OF 'GR' LRECTK-PR.GRMS FW004120
#FW03LRP EQU   FW03ERP&CG1-FW03REC&CG1   LENGTH OF 'RP' LRECTK-PRICING  FW004120
#FW03LFK EQU   FW03EFK&CG1-FW03REC&CG1    LENGTH OF 'FK' LRECTK-PRICING FW004120
#FW03LOG EQU   FW03EOG&CG1-FW03REC&CG1    LENGTH OF 'OG' LRECTK-PRICING FW004120
#FW03LIE EQU   FW03EIE&CG1-FW03REC&CG1    LENGTH OF 'IE' LRECTK-PRICING FW004120
#FW03LEN EQU   FW03EEN&CG1-FW03REC&CG1    LENGTH OF 'EN' LRECTK-PRICING FW004120
#FW03LIP EQU   FW03EIP&CG1-FW03REC&CG1    LENGTH OF 'IP' LRECTK-P016508 FW004120
#FW03LMN EQU   FW03EMN&CG1-FW03REC&CG1    LENGTH OF 'MN' LRECTK-PRICING FW004120
#FW03LXT EQU   FW03EXT&CG1-FW03REC&CG1    LENGTH OF 'XT' LRECTK-PRICING FW004120
#FW03LFR EQU   FW03EFR&CG1-FW03REC&CG1    LENGTH OF 'FR' LREC       G03 FW004130
#FW03LBB EQU   FW03EBB&CG1-FW03REC&CG1    LENGTH OF 'BB' LREC           FW004140
#FW03LBU EQU   FW03EBU&CG1-FW03REC&CG1    LENGTH OF 'BU' LREC           FW004150
#FW03LF1 EQU   FW03EF1&CG1-FW03REC&CG1    LENGTH OF X'C601' LREC        FW004160
#FW03LF2 EQU   FW03EF2&CG1-FW03REC&CG1    LENGTH OF X'C602' LREC        FW004170
#FW03LF3 EQU   FW03EF3&CG1-FW03REC&CG1    LENGTH OF X'C603' LREC        FW004180
#FW03LF4 EQU   FW03EF4&CG1-FW03REC&CG1    LENGTH OF X'C604' LREC        FW004190
#FW03LF5 EQU   FW03ENDF5&CG1-FW03REC&CG1  LENGTH OF X'C605' LREC        FW004200
#FW03LF6 EQU   FW03EF6&CG1-FW03REC&CG1    LENGTH OF X'C606' LREC        FW004210
#FW03LF7 EQU   FW03EF7&CG1-FW03REC&CG1    LENGTH OF X'C607' LREC        FW004220
#FW03LF8 EQU   FW03EIT&CG1-FW03REC&CG1    LENGTH OF X'C608' LREC    G04 FW004230
#FW03LF9 EQU   FW03ESR&CG1-FW03REC&CG1    LENGTH OF X'C609' LREC    G04 FW004240
#FW03LFA EQU   FW03EGQ&CG1-FW03REC&CG1    LENGTH OF X'C60A' LREC    G04 FW004250
#FW03LFB EQU   FW03EFB&CG1-FW03REC&CG1    LENGTH OF X'C60B' LREC    G05 FW004260
#FW03LCC EQU   FW03ECC&CG1-FW03REC&CG1    LENGTH OF X'C60C' LREC    G05 FW004270
#FW03LDD EQU   FW03EDD&CG1-FW03REC&CG1    LENGTH OF X'C60D' LREC    G07 FW004280
#FW03LEE EQU   FW03EEE&CG1-FW03REC&CG1    LENGTH OF X'C60E' LREC    G07 FW004290
*                                                                       FW004300
#FW03LQH EQU   FW03EQH&CG1-FW03REC&CG1    LENGTH OF 'QH' LREC           FW004310
#FW03LUA EQU   FW03EUA&CG1-FW03REC&CG1    LENGTH OF 'UA' LREC     TKFM  FW004310
#FW03LF0 EQU   FW03EF0&CG1-FW03REC&CG1    LENGTH OF 'F1' LREC       G08 FW004320
#FW03LFD EQU   FW03EFD&CG1-FW03REC&CG1    LENGTH OF 'FD' LREC           FW004330
#FW03LIM EQU   FW03EIM&CG1-FW03REC&CG1    LENGTH OF 'IM' LREC           FW004340
#FW03LNB EQU   FW03ENB&CG1-FW03REC&CG1    LENGTH OF 'NB' LREC           FW004350
#FW03LMQ EQU   FW03EMQ&CG1-FW03REC&CG1    LENGTH OF 'MQ' LREC           FW004360
#FW03LRI EQU   FW03ERI&CG1-FW03REC&CG1    LENGTH OF 'RI' LREC           FW004370
#FW03LRF EQU   FW03ERF&CG1-FW03REC&CG1    LENGTH OF 'RF' LREC           FW004380
#FW03LRL EQU   FW03ERL&CG1-FW03REC&CG1    LENGTH OF 'RL' LREC           FW004390
#FW03LRD EQU   FW03ERD&CG1-FW03REC&CG1    LENGTH OF 'RD' LREC           FW004400
#FW03LLB EQU   FW03ELB&CG1-FW03REC&CG1    LENGTH OF 'LB' LREC           FW004410
#FW03LFE EQU   FW03EFE&CG1-FW03REC&CG1    LENGTH OF 'FE' LREC           FW004420
#FW03LFU EQU   FW03EFU&CG1-FW03REC&CG1    LENGTH OF 'FU' LREC           FW004430
#FW03LCP EQU   FW03ECP&CG1-FW03REC&CG1    LENGTH OF 'CP' LREC           FW004440
#FW03LFZ EQU   FW03EFZ&CG1-FW03REC&CG1    LENGTH OF 'FZ' LREC           FW004450
#FW03LFI EQU   FW03EFI&CG1-FW03REC&CG1    'FZ' LREC FOR ITA  TK-PRICING FW004450
#FW03LZA EQU   FW03EZA&CG1-FW03REC&CG1    LENGTH OF 'ZA' LREC       G10 FW004460
#FW03LGI EQU   FW03EGI&CG1-FW03REC&CG1    LENGTH OF 'GI' LREC           FW004470
#FW03LIT EQU   FW03EIT&CG1-FW03REC&CG1    LENGTH OF 'IT' LREC           FW004480
#FW03LIA EQU   FW03EIA&CG1-FW03REC&CG1    LENGTH OF 'IA' LREC TKT-61    FW004480
#FW03LRA EQU   FW03ERA&CG1-FW03REC&CG1    LENGTH OF 'RA' LREC TKT-61    FW004480
#FW03LRB EQU   FW03ERB&CG1-FW03REC&CG1    LENGTH OF 'RB' LREC TKT-..AC2 FW004480
#FW03LRC EQU   FW03ERC&CG1-FW03REC&CG1    LENGTH OF 'RC' LREC TKT-..AC2 FW004480
#FW03LPE EQU   FW03EPE&CG1-FW03REC&CG1    LENGTH OF 'PE' LREC           FW004490
#FW03LLF EQU   FW03ELF&CG1-FW03REC&CG1    LENGTH OF 'LF' LREC           FW004500
#FW03LPC EQU   FW03EPC&CG1-FW03REC&CG1    LENGTH OF 'PC' LREC           FW004510
#FW03LLR EQU   FW03ELR&CG1-FW03REC&CG1    LENGTH OF 'LR' LREC           FW004520
#FW03LTE EQU   FW03ETE&CG1-FW03REC&CG1    LENGTH OF 'TE' LREC           FW004530
#FW03LTX EQU   FW03ETX&CG1-FW03REC&CG1    LENGTH OF 'TX' LREC           FW004540
#FW03LPV EQU   FW03EPV&CG1-FW03REC&CG1    LENGTH OF 'PV' LREC           FW004550
*                                                                       FW004560
#FW03LRH EQU   FW03ERH&CG1-FW03REC&CG1    LENGTH OF 'RH' LREC           FW004570
#FW03LOM EQU   FW03EOM&CG1-FW03REC&CG1    LENGTH OF 'OM' LREC           FW004580
#FW03LMP EQU   FW03EMP&CG1-FW03REC&CG1    LENGTH OF 'MP' LREC           FW004590
#FW03LMS EQU   FW03EMS&CG1-FW03REC&CG1    LENGTH OF 'MS' LREC           FW004600
#FW03LFC EQU   FW03EFC&CG1-FW03REC&CG1    LENGTH OF 'FC' LREC           FW004610
#FW03LGQ EQU   FW03EGQ&CG1-FW03REC&CG1    LENGTH OF 'GQ' LREC           FW004620
#FW03LAD EQU   FW03EAD&CG1-FW03REC&CG1    LENGTH OF 'AD' LREC           FW004620
#FW03LPN EQU   FW03EPN&CG1-FW03REC&CG1    LENGTH OF 'PN' LREC  TK006455 FW004620
#FW03LIS EQU   FW03EIS&CG1-FW03REC&CG1    LENGTH OF 'IS' LREC           FW004630
#FW03LMM EQU   FW03EMM&CG1-FW03REC&CG1    LENGTH OF 'MM' LREC           FW004640
*TK4589 #FW03LFO EQU FW03EFO&CG1-FW03REC&CG1    LENGTH OF 'FO' LREC     FW004650
#FW03LFO EQU   FW03EFO1&CG1-FW03REC&CG1   LENGTH OF 'FO' LREC    TK4589 FW004650
#FW03LPF EQU   FW03EPF&CG1-FW03REC&CG1    LENGTH OF 'PF' LREC           FW004660
#FW03LTS EQU   FW03ETS&CG1-FW03REC&CG1    LENGTH OF 'TS' LREC           FW004660
#FW03LSR EQU   FW03ESR&CG1-FW03REC&CG1    LENGTH OF 'SR' LREC           FW004670
#FW03LPU EQU   FW03EPU&CG1-FW03REC&CG1    LENGTH OF 'PU' LREC           FW004680
#FW03LSM EQU   FW03ESM&CG1-FW03REC&CG1    LENGTH OF 'SM' LREC           FW004690
#FW03LPD EQU   FW03EPD&CG1-FW03REC&CG1    LENGTH OF 'PD' LREC           FW004700
#FW03LAS EQU   FW03EAS&CG1-FW03REC&CG1    LENGTH OF 'AS' LREC           FW004710
#FW03LJT EQU   FW03EJT&CG1-FW03REC&CG1    LENGTH OF 'JT' LREC       G03 FW004720
#FW03LSU EQU   FW03ESU&CG1-FW03REC&CG1    LENGTH OF 'SU' LREC       G03 FW004730
#FW03LCI EQU   FW03ECI&CG1-FW03REC&CG1    LENGTH OF 'CI' LREC       G03 FW004740
#FW03LFP EQU   FW03EFP&CG1-FW03REC&CG1    LENGTH OF 'FP' LREC       G03 FW004750
#FW03LVA EQU   FW03EVA&CG1-FW03REC&CG1    LENGTH OF 'VA' LREC       G03 FW004760
#FW03LEQ EQU   FW03EEQ&CG1-FW03REC&CG1    LENGTH OF 'EQ' LREC    TK4589 FW004760
#FW03LTN EQU   FW03ETN&CG1-FW03REC&CG1    LENGTH OF 'TN' LREC    TK4589 FW004760
#FW03LTT EQU   FW03ETT&CG1-FW03REC&CG1    LENGTH OF 'TT' LREC    TK4589 FW004760
#FW03LCZ EQU   FW03ECZ&CG1-FW03REC&CG1    LENGTH OF 'CZ' LRECTK-P011747 FW004760
*                                                                       FW004770
*---------------------------------------------------------------------* FW004780
&FW031G1 SETB  (1)           INDICATE 1ST TIME THROUGH                  FW004790
.KEYEQ   ANOP                                                           FW004800
*                                                                       FW004810
*********************************************************************** FW004820
*                                                                     * FW004830
*  GENERAL ASSUMPTIONS AND USAGE:                                     * FW004840
*                                                                     * FW004850
*  AS THESE LREC'S ARE USED TO BUILD THE GFI DATA BLOCK TO SEND TO    * FW004860
*  GLOBALFARES, THE FOLLOWING NOTES ARE INCLUDED HERE FOR REFERENCE.  * FW004870
*                                                                     * FW004880
*  FIELDS NOT USED ARE FILLED WITH HEX ZEROES.                        * FW004890
*                                                                     * FW004900
*  CHARACTER FIELDS USED SUCH AS FARE TYPE, FLIGHT NUMBER, PENALTY    * FW004910
*  AMOUNT, PASSENGER DESCRIPTION, BOOKING CLASS, FIC OVERRIDE, FARE   * FW004920
*  BASIS CODE AND PIC TYPE ARE LEFT JUSTIFIED AND BLANK FILLED TO     * FW004930
*  THE RIGHT (X'40').                                                 * FW004940
*                                                                     * FW004950
*  CHARACTER FIELDS USED SUCH AS AMOUNT TO CONVERT, BANK RATE AND     * FW004960
*  CURRENCY AMOUNT, ARE RIGHT JUSTIFIED AND ZERO FILLED TO THE LEFT   * FW004970
*  (X'F0').                                                           * FW004980
*                                                                     * FW004990
*********************************************************************** FW005000
*                                                                       FW005010
*---------------------------------------------------------------------* FW005020
*      LREC LIST                       PKY #FW03K38   DID #FW03DLL    * FW005030
*                                                                     * FW005040
*        THIS WILL CONTAIN A NUMBER OF 3 BYTE FIELDS WHICH COMPRISES  * FW005050
*        A LIST OF ALL LREC'S WHICH ARE TO HAVE THEIR USER DATA       * FW005060
*        SECTIONS COPIED TO THE GFI BLOCK AND SENT TO GLOBALFARES BY  * FW005070
*        FABT.                                                        * FW005080
*---------------------------------------------------------------------* FW005090
          ORG  FW03USR&CG1                                              FW005100
*                                                                       FW005110
FW03LITM&CG1  DS 0CL3              LREC LIST ITEM                   G02 FW005120
FW03LLID&CG1  DS CL2               LREC ID IN FW031G                    FW005130
FW03LIND&CG1  DS C                 INDICATORS                           FW005140
#FW03LMUL&CG1 EQU X'80'            THE CURRENT LREC APPEARS > ONCE IN   FW005150
*                                    THE EXCHANGE-FILE                  FW005160
FW03ELL&CG1   EQU *                END OF DATA ID 'LL'                  FW005170
*                                                                       FW005180
*---------------------------------------------------------------------* FW005190
*      PARAMETER/MODIFIER DATA         PKY #FW03K38   DID #FW03DPM    * FW005200
*                                                                     * FW005210
*        THIS WILL CONTAIN THE PARAMETER/MODIFIER PART OF THE IMG,    * FW005220
*        AND IS PASSED TO THE FAB SEGMENTS BY THE INPUT ROUTING       * FW005230
*        MODULE. THE INPUT ROUTING MODULE WILL REMOVE THE ACTION      * FW005240
*        CODE, AND, WHERE APPROPRIATE, BLANKS, CARRIAGE RETURNS AND   * FW005250
*        HEX ZEROES.                                                  * FW005260
*---------------------------------------------------------------------* FW005270
          ORG  FW03USR&CG1                                              FW005280
*                                                                       FW005290
FW03PMDA&CG1 DS 0CL1               VARIABLE LTH PARAMETER/MODIFER DATA  FW005300
*                                                                       FW005310
FW03EPM&CG1 EQU *                  END OF DATA ID 'PM'                  FW005320
*                                                                       FW005330
*---------------------------------------------------------------------* FW005340
*      SEGMENT RELATED INFORMATION     PKY #FW03K38   DID #FW03DSX    * FW005350
*                                                                     * FW005360
*        THERE WILL BE ONE OF THESE LRECS FOR EACH SEGMENT THAT HAD   * FW005370
*        SEGMENT RELATED INFORMATION ENTERED ON THE INPUT MESSAGE.    * FW005380
*---------------------------------------------------------------------* FW005390
          ORG  FW03USR&CG1                                              FW005400
*                                                                       FW005410
FW03SXSN&CG1 DS X                  SEGMENT NUMBER                       FW005420
FW03SXIN&CG1 DS X                  SEGMENT RELATED INDICATOR            FW005430
*            BIT0 - ON             FARE BASIS CODE PRESENT              FW005440
*            BIT1 - ON             BOOKING CLASS OVERIDE PRESENT        FW005450
*            BIT2 - ON             STOPOVER/CONNECTION INFO PRESENT     FW005460
*            BIT3 - ON             DATE PRESENT                         FW005470
*            BIT4 - ON             CARRIER PRESENT                      FW005480
*            BIT5 - ON             GLOBAL DIRECTION INDICATOR PRESENT   FW005490
*            BIT6 - ON             MUST BREAK INDICATOR PRESENT      02 FW005500
FW03SXFB&CG1 DS CL8                FARE BASIS CODE                      FW005510
FW03SXBC&CG1 DS CL2                BOOKING CLASS OVERIDE                FW005520
FW03SXSC&CG1 DS CL1                STOPOVER/CONNECTION INFORMATION      FW005530
FW03SXDT&CG1 DS XL2                DEPARTURE DATE (PARS)                FW005540
FW03SXCA&CG1 DS CL2                CARRIER CODE                         FW005550
             DS CL1                SPARE FOR CARRIER EXPANSION          FW005560
FW03SXGD&CG1 DS CL2                GLOBAL DIRECTION INDICATOR           FW005570
FW03SXBI&CG1 DS CL1                BREAK INDICATOR                   02 FW005580
#FW03SXMNB&CG1 EQU  X'02'          OFF CITY IS MUST NOT BREAK POINT  02 FW005590
#FW03SXMBP&CG1 EQU  X'01'          OFF CITY IS MUST BREAK POINT      02 FW005600
*                                                                       FW005610
FW03ESX&CG1 EQU *                  END OF DATA ID 'SX'                  FW005620
*                                                                       FW005630
*---------------------------------------------------------------------* FW005640
*      DISPLAY LREC                    PKY #FW03K38   DID #FW03DTV    * FW005650
*---------------------------------------------------------------------* FW005660
          ORG  FW03USR&CG1                                              FW005670
*                                                                       FW005680
FW03TTV&CG1 DS 0CL1                START OF DATA FOR TV LREC            FW005690
FW03TLI&CG1 DS CL64                STANDARD LENGTH OF DISPLAY LINE      FW005700
*                                                                       FW005710
FW03ETV&CG1 EQU *                  END OF DATA ID 'TV'                  FW005720
*                                                                       FW005730
*---------------------------------------------------------------------* FW005740
*       PASSENGER DESCRIPTION LREC PKY    #FW03K38      DID #FW03DPD  * FW005750
*                (FOR GALILEO INTERNAL USE ONLY)                      * FW005760
*---------------------------------------------------------------------* FW005770
          ORG  FW03USR&CG1                                              FW005780
*                                                                       FW005790
FW03PAN&CG1 DS CL2                 PASSENGER NUMBER                     FW005800
*G06 FW03PDL&CG1 DS 0CL7             PASSENGER DESCRIPTION              FW005810
*G06 FW03PDA&CG1 DS CL3              ALPHA SECTION OF PAX DESCRIPTION   FW005820
FW03PDL&CG1 DS 0CL9                PASSENGER DESCRIPTION            G06 FW005830
FW03PDA&CG1 DS CL5                 ALPHA SECTION OF PAX DESCRIPTION G06 FW005840
FW03PDN&CG1 DS CL4                 NUMERIC SECTION OF PAX DESCRIPTION   FW005850
FW03PDI&CG1 DS X                   PASSENGER DESCRIPTION INDICATORS     FW005860
#FW03PDITA&CG1 EQU  X'80'          IATA FORMAT PIC - 2 BYTE             FW005870
#FW03PDATP&CG1 EQU  X'40'          ATPCO FORMAT PIC - 3 BYTE            FW005880
#FW03PDPCT&CG1 EQU  X'20'          AMOUNT IS PERCENTAGE                 FW005890
#FW03PDAMT&CG1 EQU  X'10'          AMOUNT IS AMOUNT                     FW005900
#FW03PDAGE&CG1 EQU  X'08'          AMOUNT IS AGE                        FW005910
#FW03PDBFI&CG1 EQU  X'04'          PAX IS INFANT IN BOOKING FILE    G02 FW005920
FW03PDC&CG1 DS CL10                PAX DESCRIPTION AS INPUT BY AGENT    FW005930
FW03PES&CG1 DS CL2                 EXTRA SEAT AMOUNT         TK-P029436
FW03EPD&CG1 EQU *                  END OF DATA ID 'PD'                  FW005940
*                                                                       FW005950
*---------------------------------------------------------------------* FW005960
*        'BEST BUY  INTERFACE LREC     PKY #FW03K38   DID #FW03DBB    * FW005970
*         QUESTION'                                                   * FW005980
*---------------------------------------------------------------------* FW005990
         ORG FW03USR&CG1                                                FW006000
*                                                                       FW006010
FW03SGN&CG1 DS XL1        UNIQUE SEGMENT NUMBER                         FW006020
FW03CXC&CG1 DS CL3        CARRIER CODE (LEFT JUSTIFY BLANK FILL)        FW006030
FW03FNO&CG1 DS CL4        FLIGHT NUMBER (RIGHT JUSTIFY ZERO FILL)       FW006040
FW03PDT&CG1 DS XL2        DEPARTURE DATE (PARS FORMAT)                  FW006050
FW03BRP&CG1 DS CL3        BOARDPOINT                                    FW006060
FW03OFT&CG1 DS CL3        OFFPOINT                                      FW006070
FW03NPX&CG1 DS XL1        NUMBER OF PASSENGERS (EXCL INFANTS)           FW006080
FW03NOC&CG1 DS XL1        MAXIMUM NUMBER OF CLASSES TO RETURN           FW006090
FW03BCL&CG1 DS CL2        BOOKING CLASS (RIGHT JUSTIFIED)               FW006100
FW03EBB&CG1 EQU *         END OF DATA ID 'BB'                           FW006110
*                                                                       FW006120
*---------------------------------------------------------------------* FW006130
*        TICKETING MODIFIERS DATA      PKY #FW03K38   DID #FW03DFT      FW006140
*---------------------------------------------------------------------* FW006150
          ORG  FW03USR&CG1                                              FW006160
FW03RFF&CG1 DS  XL1       REQUESTED FILED FARE NUMBER                   FW006170
FW03NFF&CG1 DS  XL1       NEXT FILED FARE NUMBER                        FW006180
FW03TKM&CG1 DS 0CL1       VARIABLE LENGTH TICKETING MODIFIERS           FW006190
FW03EFT&CG1 EQU *         END OF DATA ID 'FT'                           FW006200
*                                                                       FW006210
*---------------------------------------------------------------------* FW006220
*        'BEST BUY  INTERFACE LREC     PKY #FW03K38   DID #FW03DF1    * FW006230
*         ANSWER'                                                     * FW006240
*---------------------------------------------------------------------* FW006250
         ORG FW03USR&CG1                                                FW006260
*                                                                       FW006270
FW03BFD&CG1 DS 0XL2       BEST BUY FIXED DATA                           FW006280
FW03SNO&CG1 DS XL1        UNIQUE SEGMENT NUMBER                         FW006290
FW03CCT&CG1 DS XL1        NUMBER OF CLASS AND STATUS ITEMS (MAX 26)     FW006300
FW03CSI&CG1 DS 0CL3       CLASS AND STATUS ITEM                         FW006310
FW03CLA&CG1 DS CL2        BOOKING CLASS CODE                            FW006320
FW03AVS&CG1 DS CL1        AVAILABILITY STATUS                           FW006330
FW03EF1&CG1 EQU *         END OF DATA ID 'F1'                           FW006340
*                                                                       FW006350
*---------------------------------------------------------------------* FW006360
*        'PASSENGER DESCRIPTION TABLE' PKY #FW03K38   DID #FW03DF2    * FW006370
*         LREC                                                        * FW006380
*---------------------------------------------------------------------* FW006390
         ORG FW03USR&CG1                                                FW006400
*                                                                       FW006410
FW03NPDI&CG1 DS CL1       NUMBER OF PAX DESC ITEMS IN TABLE             FW006420
FW03IPDI&CG1 DS 0CL24     INDIVIDUAL PAX DESC ITEM                      FW006430
FW03IPKY&CG1 DS CL2       PAX DESC NUMBER                               FW006440
FW03IPDE&CG1 DS CL10      PAX DESC AS ENTERED BY AGENT                  FW006450
FW03IPDR&CG1 DS CL10      PAX DESC AS RETURNED BY APOLLO                FW006460
FW03IPIN&CG1 DS XL1       PAX DESC INDICATOR BYTE                       FW006470
FW03IPNO&CG1 DS XL1       NO OF PAX WITH THIS PAX DESC                  FW006480
FW03EF2&CG1 EQU *         END OF DATA ID 'F2'                           FW006490
*                                                                       FW006500
*------------------------------------------------------------------     FW006510
*        FILED FARE DATA LREC          PKY #FW03K38   DID #FW03DF3      FW006520
*------------------------------------------------------------------     FW006530
         ORG FW03USR&CG1                                                FW006540
*                                                                       FW006550
FW03U9IN&CG1 DS XL1       PAX DESC INDICATOR BYTE                       FW006560
FW03U9F3&CG1 DS 0CL8      DATA FROM F3 LREC IN FW03CR                   FW006570
FW03U9FI&CG1 DS     XL1      INDICATOR BYTE 1                           FW006580
#FW03U9FBI&CG1 EQU  X'80'    FARE BASIS CODE INPUT                      FW006590
#FW03U9FNM&CG1 EQU  X'40'    NM MODIFIER INPUT                          FW006600
#FW03U9FAP&CG1 EQU  X'20'    AP MODIFIER INPUT                          FW006610
#FW03U9FNR&CG1 EQU  X'10'    NR MODIFIER INPUT                          FW006620
#FW03U9FMM&CG1 EQU  X'08'    MM MODIFIER INPUT                          FW006630
#FW03U9FNX&CG1 EQU  X'04'    NX MODIFIER INPUT                          FW006640
FW03UMDE&CG1 DS  0XL7     MODIFIERS ENTERED - WILL BE THE SAME AS       FW006650
*                         THE DEFINITIONS IN FT07MDE                    FW006660
FW03UEFQ1&CG1 DS  XL1     MODIFIERS FOUND ON THIS ENTRY -1              FW006670
FW03UEFQ2&CG1 DS  XL1     MODIFIERS FOUND ON THIS ENTRY -2              FW006680
FW03UEFQ3&CG1 DS  XL1     MODIFIERS FOUND ON THIS ENTRY -3              FW006690
FW03UMIN1&CG1 DS  XL1     MISCELLANEOUS INDICATORS                      FW006700
FW03UESR1&CG1 DS  XL1     SEGMENT RELATED MODIFIERS                     FW006710
FW03UERM1&CG1 DS  XL1     RESTRICTION MODIFIERS                         FW006720
FW03UEFQO&CG1 DS  XL1     OTHER MODIFIERS                               FW006730
FW03EF3&CG1 EQU *                                                       FW006740
*------------------------------------------------------------------     FW006750
*        COUNT OF FARES RETURNED IN FQA PKY #FW03K38   DID #FW03DF4     FW006760
*------------------------------------------------------------------     FW006770
         ORG FW03USR&CG1                                                FW006780
*                                                                       FW006790
FW03YCNT&CG1 DS XL1       COUNT OF FARES RETURNED BY FQA                FW006800
FW03EF4&CG1 EQU *                                                       FW006810
*------------------------------------------------------------------     FW006820
*        WARNING MESSAGE INDICATOR LREC PKY #FW03K38   DID #FW03DF5     FW006830
*------------------------------------------------------------------     FW006840
         ORG FW03USR&CG1                                                FW006850
*                                                                       FW006860
FW035UIND&CG1 DS 0XL2         INDICATOR FIELDS                          FW006870
FW035IND1&CG1 DS XL1         INDICATORS FOR REQUIRED WARNING MESSAGES   FW006880
#FW035PFRM&CG1 EQU X'80'     PROCESS PRIVATE FARES MESSAGES             FW006890
#FW035TXEM&CG1 EQU X'40'     PROCESS TAX EXEMPT MESSAGES                FW006900
#FW035WNGM&CG1 EQU X'20'     PROCESS WARNING MESSAGES                   FW006910
#FW035PFCM&CG1 EQU X'10'     PROCESS PFC MESSAGES                       FW006920
#FW035FICM&CG1 EQU X'08'     PROCESS FIC OVERRIDE MESSAGES              FW006930
#FW035VALM&CG1 EQU X'04'     PROCESS VALIDATION MESSAGES                FW006940
#FW035SPR1&CG1 EQU X'02'     SPARE 1                                    FW006950
#FW035SPR2&CG1 EQU X'01'     SPARE 2                                    FW006960
FW035IND2&CG1 DS XL1         MESSAGE GENERATION INDICATORS              FW006970
#FW035NOTX&CG1 EQU X'80'     THERE ARE NO TAXES IN ANY OF THE GQ'S      FW006980
#FW035NOTE&CG1 EQU X'40'     THERE ARE NO EXEMPT TAXES                  FW006990
#FW035NOPD&CG1 EQU X'20'     BUILD MESSAGES WITH NO PD CODES            FW007000
FW03ENDF5&CG1 EQU *                                                     FW007010
*------------------------------------------------------------------     FW007020
*        FARES LED AVAILABILITY LREC PKY #FW03K38   DID #FW03DF6        FW007030
*------------------------------------------------------------------     FW007040
         ORG FW03USR&CG1                                                FW007050
*                                                                       FW007060
FW036SEC&CG1 DS 0CL6     FLIGHT SECTOR                                  FW007070
FW036BPT&CG1 DS CL3      BOARDPOINT                                     FW007080
FW036OPT&CG1 DS CL3      OFFPOINT                                       FW007090
FW036DEP&CG1 DS CL7      DEPARTURE DATE (DMMM,DDMMM,DMMMYY OR DDMMMYY)  FW007100
*                        (LEFT JUSTIFY BLANK FILL)                      FW007110
FW036CCD&CG1 DS CL2      1ST CARRIER CODE (BLANK = ALL CARRIERS)        FW007120
FW036CC2&CG1 DS CL2      2ND CARRIER CODE (BLANK = ALL CARRIERS)        FW007130
FW036CC3&CG1 DS CL2      3RD CARRIER CODE (BLANK = ALL CARRIERS)        FW007140
FW036CX1&CG1 DS CL3      FIRST CONNECTION CITY                          FW007150
FW036CX2&CG1 DS CL3      SECOND CONNECTION CITY                         FW007160
***N.B.  NEXT FIELDS MUST BE AT END OF LREC AS THEY ARE REPEATED***     FW007170
FW036AVD&CG1 DS 0CL5     STORED LINES FROM FARE DISPLAY                 FW007180
FW036LNB&CG1 DS CL2      LINE NUMBER FROM  FARE DISPLAY                 FW007190
FW036CC4&CG1 DS CL3      ASSOCIATED CARRIER CODE FROM FARE DISPLAY      FW007200
FW03EF6&CG1 EQU *                                                       FW007210
*                                                                       FW007220
*------------------------------------------------------------------     FW007230
*        BEST BUY REBOOK LREC            #FW03K38   DID #FW03DF7        FW007240
*------------------------------------------------------------------     FW007250
         ORG FW03USR&CG1                                                FW007260
*                                                                       FW007270
FW037NI&CG1 DS XL1        NUMBER OF REBOOK ITEMS                        FW007280
FW037IT&CG1 DS 0CL3       FIRST SEGMENT/REBOOK CLASS                    FW007290
FW037SN&CG1 DS CL1        SEGMENT NUNBER                                FW007300
FW037RC&CG1 DS CL2        REBOOK CLASS                                  FW007310
FW03EF7&CG1 EQU *                                                       FW007320
*                                                                       FW007330
*------------------------------------------------------------------ G04 FW007340
*        FLYGTAXI 'IT' LREC              #FW03K38   DID #FW03DF8    G04 FW007350
*------------------------------------------------------------------ G04 FW007360
*        FLYGTAXI 'SR' LREC              #FW03K38   DID #FW03DF9    G04 FW007370
*------------------------------------------------------------------ G04 FW007380
*        FLYGTAXI 'GQ' LREC              #FW03K38   DID #FW03DFA    G04 FW007390
*------------------------------------------------------------------ G04 FW007400
*        FLYGTAXI 'FC' LREC              #FW03K38   DID #FW03DFB    G05 FW007410
*------------------------------------------------------------------ G05 FW007420
          ORG  FW03USR&CG1                                          G05 FW007430
*                                                                   G05 FW007440
FW03BQNB&CG1 DS    X              QUOTE NUMBER                      G05 FW007450
FW03BSNB&CG1 DS    X              SEGMENT NUMBER                    G05 FW007460
FW03BFAR&CG1 DS    0C             FARE CONSTRUCTION                 G05 FW007470
*                                                                   G08 FW007480
         ORG FW03BFAR&CG1         LAST FLYGTAXI LREC                G08 FW007490
FW03BNUC&CG1 DS    CL3            CONTAINS LITERAL 'NUC'            G08 FW007500
FW03BAMT&CG1 DS    0C             FLYGTAXI NUC AMOUNT               G08 FW007510
*                                                                   G08 FW007520
FW03EFB&CG1  EQU  *                                                 G05 FW007530
*                                                                   G05 FW007540
*                                                                   G05 FW007550
*------------------------------------------------------------------ G05 FW007560
*        FLYGTAXI CITY PAIR LREC         #FW03K38   DID #FW03DCC    G05 FW007570
*------------------------------------------------------------------ G05 FW007580
          ORG  FW03USR&CG1                                          G05 FW007590
*                                                                   G05 FW007600
FW03CNIT&CG1 DS  X               NUMBER OF CITY PAIRS               G05 FW007610
FW03CLCT&CG1 DS  0XL7            LENGTH OF CITY PAIR                G05 FW007620
FW03CBRD&CG1 DS  CL3             BOARD POINT                        G05 FW007630
FW03COFF&CG1 DS  CL3             OFF POINT                          G05 FW007640
FW03CTYP&CG1 DS  X               SEGMENT TYPE                       G05 FW007650
*                BIT0 = 1  AIR SEGMENT                              G05 FW007660
*                BIT1 = 1  FLYGTAXI SEGMENT                         G05 FW007670
*                BIT2 = 1  SURFACE SECTOR SEGMENT                   G08 FW007680
*                BIT3      SPARE                                    G08 FW007690
*                BITS4-7 = ITINERARY DISPLAY SEQUENCE NUMBER        G08 FW007700
FW03ECC&CG1  EQU  *                                                 G05 FW007710
*                                                                       FW007720
*------------------------------------------------------------------ G07 FW007730
*     FARE DISPLAY FOLLOW-ON DATA LREC   #FW03K38   DID #FW03DDD    G07 FW007740
*------------------------------------------------------------------ G07 FW007750
          ORG  FW03USR&CG1                                          G07 FW007760
*                                                                   G07 FW007770
FW03DXXX&CG1 DS  0CL1            FARE DISPLAY FOLLOW-ON DATA.       G07 FW007780
*                                SEE FT081G FOR DEFINITIONS         G07 FW007790
FW03EDD&CG1  EQU  *                                                 G07 FW007800
*                                                                       FW007810
*------------------------------------------------------------------ G07 FW007820
*        GMT DATE ADJUSTMENT LREC        #FW03K38   DID #FW03DEE    G07 FW007830
*------------------------------------------------------------------ G07 FW007840
          ORG  FW03USR&CG1                                          G07 FW007850
*                                                                   G07 FW007860
FW03EGMT&CG1 DS  X               GMT DATE ADJUSTMENT FACTOR         G07 FW007870
*                                IN 30 MINUTE INCREMTENTS FROM      G07 FW007880
*                                CRT LOCATION TO GMT                G07 FW007890
*                                - IF BIT0 ON THEN NEG ADJUSTMENT   G07 FW007900
FW03EEE&CG1  EQU  *                                                 G07 FW007910
*                                                                       FW007920
*********************************************************************** FW007930
*********************************************************************** FW007940
**                                                                   ** FW007950
** SECTION INFORMATION:                                              ** FW007960
**                                                                   ** FW007970
** TYPE:        QUERY/RESPONSE                                       ** FW007980
** NAME:        FARE DISPLAY DETAIL ON FARE LED AVAILABILITY (FLA)   ** FW007990
** IDENTIFIER:  2                                                    ** FW008000
**                                                                   ** FW008010
** PRIME KEY:   X'38'                                                ** FW008020
** ITEM ID:     FR                                                   ** FW008030
** UNIQUE KEY:  LINE NUMBER IN FARE DISPLAY STARTING FROM X'0001'    ** FW008040
**                                                                   ** FW008050
** PURPOSE:     THIS SECTION IS USED FOR BOTH QUERY/REPLY ON FLA     ** FW008060
**              ENTRIES.  IT IS RETURNED ON THE INITIAL FARE LED     ** FW008070
**              AVIALABILITY REQUEST, AND SHOULD BE SENT ON          ** FW008080
**              SUBSEQUENT FLA REQUESTS ON THE SAME FARE LINE.       ** FW008090
**              THIS WOULD OCCUR WHEN THE AGENT PERFORMS A FLA 'MORE'** FW008100
**              FOLLOWUP WHERE THE REQUESTING CRS WOULD A SUBSEQUENT ** FW008110
**              TIME TO GLOBALFARES WITH A FLA REQUEST USING THE     ** FW008120
**              SAME FARE INFORMATION.                               ** FW008130
**                                                                   ** FW008140
**              IF ANY INFORMATION IS X'00', THEN IT DOES NOT APPLY. ** FW008150
**                                                                G03** FW008160
*********************************************************************** FW008170
*********************************************************************** FW008180
          ORG  FW03USR&CG1                                              FW008190
FW03F2CXR&CG1  DS   CL2            CARRIER CODE                         FW008200
          DS   C                   RESERVED FOR CARRIER CODE EXPANSION  FW008210
FW03F2CUR&CG1  DS   CL3            CURRENCY CODE                        FW008220
FW03F2FAR&CG1  DS   XL4            FARE AMOUNT                          FW008230
FW03F2DEC&CG1  DS   X              NUMBER OF DECIMAL PLACES IN FARE     FW008240
FW03F2FBC&CG1  DS   CL10           FARE BASIS CODE - LEFT JUSTIFIED,    FW008250
*                                    BLANK FILLED                       FW008260
FW03F2BKC&CG1  DS   CL2            MAIN BOOKING CODE - LEFT JUSTIFIED,  FW008270
*                                    BLANK FILLED                       FW008280
FW03F2IN1&CG1  DS   X              INDICATOR 1                          FW008290
#FW03F2RTP&CG1 EQU  X'80'          FARE IS A ROUND TRIP AMOUNT          FW008300
#FW03F2RTE&CG1 EQU  X'40'          FARE IS MILEAGE BASED, NOT ROUTE     FW008310
#FW03F2MXM&CG1 EQU  X'20'          MAX STAY IS MONTH VALUE, NOT DAY     FW008320
#FW03F2MIM&CG1 EQU  X'10'          MIN STAY IS MONTH VALUE, NOT DAY     FW008330
#FW03F2SE1&CG1 EQU  X'08'          DT1 AND DT2 ARE SEASONALITY DATES.   FW008340
*                                    IF 0, DT1/DT2 ARE FIRST/LAST TVL   FW008350
*                                    DATES.                             FW008360
#FW03F2SE2&CG1 EQU  X'04'          DT3 AND DT4 ARE SEASONALITY DATES.   FW008370
*                                    IF 0, DT3/DT4 ARE FIRST/LAST TKT   FW008380
*                                    DATES.                             FW008390
*                                                                       FW008400
FW03F2IN2&CG1  DS   X              INDICATOR 2                          FW008410
#FW03F2APM&CG1 EQU  X'80'          MORE INFO EXISTS ON ADV PURCH        FW008420
#FW03F2CFM&CG1 EQU  X'40'          MORE INFO EXISTS ON CANCEL FEE       FW008430
*                                                                       FW008440
FW03F2AVP&CG1  DS   X              ADVANCED PURCHASE                    FW008450
FW03F2MIN&CG1  DS   X              MINIMUM STAY AMOUNT                  FW008460
FW03F2MAX&CG1  DS   X              MAXIMUM STAY AMOUNT                  FW008470
*                                                                       FW008480
*  SEE GF2IN1 FOR FOLLOWING 4 FIELD DEFINITIONS.                        FW008490
FW03F2DT1&CG1  DS   XL2            FIRST SEASONALITY/TRAVEL DATE        FW008500
FW03F2DT2&CG1  DS   XL2            LAST SEASONALITY/TRAVEL DATE         FW008510
FW03F2DT3&CG1  DS   XL2            FIRST SEASONALITY/TICKET DATE        FW008520
FW03F2DT4&CG1  DS   XL2            LAST SEASONALITY/TICKET DATE         FW008530
*                                                                       FW008540
FW03F2GLD&CG1  DS   CL2            GLOBAL DIRECTION                     FW008550
FW03F2CNF&CG1  DS   X              CANCELLATION FEE                     FW008560
*                                                                       FW008570
*  THE FOLLOWING FIELDS ARE FOR GLOBALFARES INTERNAL USE ONLY.          FW008580
FW03F2FUD&CG1  DS   XL2            FARE USAGE                           FW008590
FW03F2FGC&CG1  DS   X              FARE TYPE                            FW008600
FW03F2TAR&CG1  DS   XL2            TARIFF ORDINAL NUMBER                FW008610
FW03F2FRT&CG1  DS   XL2            ROUTING NUMBER                       FW008620
FW03F2RNO&CG1  DS   XL3            RULE NUMBER                          FW008630
*                                                                       FW008640
*********************************************************************** FW008650
** END OF FARE DISPLAY DETAIL INFORMATION                            ** FW008660
*********************************************************************** FW008670
FW03EFR&CG1 EQU  *                 END OF FARE DISPLAY DETAIL INFO      FW008680
*                                                                       FW008690
*********************************************************************** FW008700
*********************************************************************** FW008710
**                                                                   ** FW008720
** SECTION INFORMATION:                                              ** FW008730
**                                                                   ** FW008740
** TYPE:        QUERY                                                ** FW008750
** NAME:        STRUCTURED RULES QUERY/FARE COMPONENT RESPONSE       ** FW008760
** IDENTIFIER:  7                                                    ** FW008770
**                                                                   ** FW008780
** PRIME KEY:   X'38'                                                ** FW008790
** ITEM ID:     RI                                                   ** FW008800
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1.                    ** FW008810
**                                                                   ** FW008820
** PURPOSE:     ON RESPONSE:  MULTIPLE SECTIONS POSSIBLE FOR EACH    ** FW008830
**              QUOTE, AND POSSIBLY DIFFERENT FOR EACH PIC TYPE.     ** FW008840
**              IF THE UNIQUE IS ZERO, THEN THE SECTIONS APPLY TO    ** FW008850
**              ALL PASSENGERS.  ALL FIELDS ARE SPECIFIC TO THE      ** FW008860
**              FARE COMPONENT.  LRECS CI/GR8 AND FP/GR9 WILL ALSO   ** FW008870
**              BE RETURNED IF INFORMATION EXISTS AND ARE ASSOCIATED ** FW008880
**              VIA UKY, QUOTE NUMBER, AND FARE COMPONENT NUMBER.    ** FW008890
**                                                                   ** FW008900
**              ON QUERY:  1 SECTION ONLY FOR RULES REQUEST.         ** FW008910
**                                                                   ** FW008920
**              THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING  ** FW008930
**              ENTRIES:                                             ** FW008940
**                                                                   ** FW008950
**              FQ..., àB..., AND àQ...                              ** FW008960
**                                                                G03** FW008970
*********************************************************************** FW008980
*********************************************************************** FW008990
          ORG  FW03USR&CG1                                              FW009000
FW03F7QNB&CG1  DS   X              QUOTE NUMBER                         FW009010
FW03F7FNB&CG1  DS   X              FARE COMPONENT NUMBER                FW009020
FW03F7ISV&CG1  DS   X              INTERNAL INDICATOR               G03 FW009030
*              B'0 1 2 3 4 5 6 7'                                   G03 FW009040
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                    G03 FW009050
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                G03 FW009060
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                  G03 FW009070
*                ¦ ¦ ¦ ¦ ¦ SPARE                                    G03 FW009080
*                ¦ ¦ ¦ ¦ SPARE                                      G03 FW009090
*                ¦ ¦ ¦ SPARE                                        G03 FW009100
*                ¦ ¦ SPARE                                          G03 FW009110
*                ¦ SPARE                                            G03 FW009120
*                FARE/RULE INFORMATION TO BE RETRIEVED FROM IFQ     G03 FW009130
*                                                                   G03 FW009140
#FW03F7QTI&CG1 EQU  X'80'          FARE RULE INFO TO BE RETRIEVED   G03 FW009150
*                                    FROM IFQ                       G03 FW009160
*                                                                   G03 FW009170
FW03F7BRD&CG1  DS   CL3            BOARD CITY                           FW009180
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009190
FW03F7OFF&CG1  DS   CL3            OFF CITY                             FW009200
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009210
FW03F7DTE&CG1  DS   XL2            PARS FIRST TRAVEL DATE OF FARE       FW009220
*                                  COMPONENT                            FW009230
FW03F7CXR&CG1  DS   CL2            CARRIER CODE                         FW009240
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW009250
FW03F7FBC&CG1  DS   CL10           FARE BASIS CODE                      FW009260
FW03F7TOT&CG1  DS   XL4            TOTAL FARE COMPONENT AMOUNT IN       FW009270
FW03F7CUR&CG1  DS   CL3            CURRENCY CODE OF ORIGIN COUNTRY      FW009280
FW03F7DEC&CG1  DS   X              NUMBER OF DECIMAL PLACES             FW009290
FW03F7FAR&CG1  DS   XL4            FARE AMOUNT IN CURRENCY OF GF7C      FW009300
FW03F7SID&CG1  DS   X              SUPPLIER ID OF RULE                  FW009310
FW03F7RNB&CG1  DS   XL3            RULE NUMBER ORDINAL                  FW009320
FW03F7TNB&CG1  DS   XL2            FARE TARIFF NUMBER                   FW009330
FW03F7ONB&CG1  DS   XL2            RULE TEXT ORDINAL NUMBER             FW009340
FW03F7MSG&CG1  DS   X              MESSAGE INDICATOR                    FW009350
*              B'0 1 2 3 4 5 6 7'                                       FW009360
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW009370
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW009380
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW009390
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW009400
*                ¦ ¦ ¦ ¦ SPARE                                          FW009410
*                ¦ ¦ ¦ SPARE                                            FW009420
*                ¦ ¦ NO RULES EXIST                                     FW009430
*                ¦ ROUTES APPLY                                         FW009440
*                RULES APPLY                                            FW009450
*                                                                       FW009460
#FW03F7RUL&CG1 EQU  X'80'          RULES APPLY                          FW009470
#FW03F7ROT&CG1 EQU  X'40'          ROUTES APPLY                         FW009480
#FW03F7NOR&CG1 EQU  X'20'          NO RULES EXIST                       FW009490
*                                                                       FW009500
FW03F7IND&CG1  DS   X              FARE COMPONENT INDICATOR             FW009510
*              B'0 1 2 3 4 5 6 7'                                       FW009520
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW009530
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW009540
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW009550
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW009560
*                ¦ ¦ ¦ ¦ SPARE                                          FW009570
*                ¦ ¦ ¦ SPARE                                            FW009580
*                ¦ ¦ SPARE                                              FW009590
*                ¦ SPARE                                            G03 FW009600
*                DATABASE INDICATOR - GLOBALFARES USE ONLY              FW009610
*                                                                       FW009620
#FW03F7DBI&CG1 EQU  X'80'          DATABASE INDICATOR - GLOBALFARE      FW009630
*                                  USE ONLY                             FW009640
*                                                                       FW009650
FW03F7DBI&CG1  DS   X              DATABASE IDENTIFIER - GLOBALFAR      FW009660
*                                  USE ONLY                             FW009670
*                                                                       FW009680
FW03F7FQS&CG1  EQU  *              LREC ENDS HERE FOR NON-IFQ COMP      FW009690
#FW03F7LNF&CG1 EQU  *-FW03REC&CG1  LENGTH OF NON-IFQ COMPONENT S        FW009700
*                                                                       FW009710
FW03F7GDI&CG1  DS   CL2            GLOBAL DIRECTION ORDINAL             FW009720
FW03F7HF1&CG1  DS   CL3            HIF CITY 1                           FW009730
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009740
FW03F7HF2&CG1  DS   CL3            HIF CITY 2                           FW009750
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009760
*                                                                       FW009770
FW03F7MLS&CG1  DS   X              MILEAGE SURCHARGE/ROUTING INDIC      FW009780
#FW03F7M0&CG1  EQU  X'01'          M0                                   FW009790
#FW03F7M5&CG1  EQU  X'02'          M5                                   FW009800
#FW03F7M10&CG1 EQU  X'03'          M10                                  FW009810
#FW03F7M15&CG1 EQU  X'04'          M15                                  FW009820
#FW03F7M20&CG1 EQU  X'05'          M20                                  FW009830
#FW03F7M25&CG1 EQU  X'06'          M25                                  FW009840
#FW03F7RTE&CG1 EQU  X'07'          ROUTE BASED FARE                     FW009850
*                                  IF =, LENGTH OF LREC IS #GF7LNR      FW009860
#FW03F7HEL&CG1 EQU  X'08'          HELICOPTER BASED FARE                FW009870
*                                                                       FW009880
FW03F7RTE&CG1  EQU  *              LREC ENDS HERE FOR ROUTE BASED       FW009890
#FW03F7LNR&CG1 EQU  *-FW03REC&CG1  LENGTH OF ROUTE BASED FARE SE        FW009900
*                                                                       FW009910
FW03F7FLW&CG1  DS   XL2            FLOWN MILEAGE FOR COMPONENT          FW009920
FW03F7MPM&CG1  DS   XL2            MPM FOR COMPONENT                    FW009930
FW03F7MPD&CG1  DS   XL2            DIFFERENCE BETWEEN FLOWN MILEAG      FW009940
*                                  MILEAGE SURCHARGE BAND               FW009950
FW03F7EM1&CG1  DS   CL3            EXTRA MILEAGE CITY 1                 FW009960
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009970
FW03F7EM2&CG1  DS   CL3            EXTRA MILEAGE CITY 2                 FW009980
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW009990
FW03F7EM3&CG1  DS   CL3            EXTRA MILEAGE CITY 3                 FW010000
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW010010
FW03F7CXR2&CG1 DS   CL2            CARRIER CODE 2 (FOR JOINTS)          FW010020
               DS   CL1            RESERVED FOR EXPANSION               FW010030
FW03F7CXR3&CG1 DS   CL2            CARRIER CODE 3 (FOR JOINTS)          FW010040
               DS   CL1            RESERVED FOR EXPANSION               FW010050
*********************************************************************** FW010060
** END OF STRUCTURED RULES QUERY/FARE COMPONENT RESPONSE SECTION     ** FW010070
*********************************************************************** FW010080
FW03ERI&CG1  EQU  *                END OF FARE COMPONENT SECTION        FW010090
          EJECT                                                         FW010100
*********************************************************************** FW010110
*********************************************************************** FW010120
**                                                                   ** FW010130
** SECTION INFORMATION:                                              ** FW010140
**                                                                   ** FW010150
** TYPE:        QUERY/RESPONSE                                       ** FW010160
** NAME:        BOOKING CODES                                        ** FW010170
** IDENTIFIER:  B                                                    ** FW010180
**                                                                   ** FW010190
** PRIME KEY:   X'38'                                                ** FW010200
** ITEM ID:     BC                                                   ** FW010210
** UNIQUE KEY:  X'0000'                                              ** FW010220
**                                                                   ** FW010230
** PURPOSE:     THIS SECTION IS USED FOR BOTH INPUT & OUTPUT OF      ** FW010240
**              BOOKING CODES.  A VARIABLE NUMBER OF BOOKING CODES   ** FW010250
**              CAN EXIST AND CAN APPLY TO UP TO 16 SEGMENTS.        ** FW010260
**              IN THE CASE OF A BEST BUY ENTRY RESPONSE, THIS       ** FW010270
**              SECTION CONTAINS THE ORIGINAL BOOKING CODE OF THE    ** FW010280
**              ITINERARY.                                           ** FW010290
**                                                                   ** FW010300
*********************************************************************** FW010310
*********************************************************************** FW010320
          ORG  FW03USR&CG1                                              FW010330
*                                                                       FW010340
FW03FBNBR&CG1  DS   X              NUMBER OF BOOKING CODES FOLLOW       FW010350
FW03FBITM&CG1  DS   0XL4           BOOKING CODE ITEM                    FW010360
FW03FBBKC&CG1  DS   CL2            BOOKING CODE                         FW010370
FW03FBSEG&CG1  DS   XL2            SEGMENT APPLICABILITY BIT MAP        FW010380
#FW03FBS01&CG1 EQU  X'8000'        BOOKING CODE APPLIES TO SGMT 1       FW010390
#FW03FBS02&CG1 EQU  X'4000'        BOOKING CODE APPLIES TO SGMT 2       FW010400
#FW03FBS03&CG1 EQU  X'2000'        BOOKING CODE APPLIES TO SGMT 3       FW010410
#FW03FBS04&CG1 EQU  X'1000'        BOOKING CODE APPLIES TO SGMT 4       FW010420
#FW03FBS05&CG1 EQU  X'0800'        BOOKING CODE APPLIES TO SGMT 5       FW010430
#FW03FBS06&CG1 EQU  X'0400'        BOOKING CODE APPLIES TO SGMT 6       FW010440
#FW03FBS07&CG1 EQU  X'0200'        BOOKING CODE APPLIES TO SGMT 7       FW010450
#FW03FBS08&CG1 EQU  X'0100'        BOOKING CODE APPLIES TO SGMT 8       FW010460
#FW03FBS09&CG1 EQU  X'0080'        BOOKING CODE APPLIES TO SGMT 9       FW010470
#FW03FBS10&CG1 EQU  X'0040'        BOOKING CODE APPLIES TO SGMT 10      FW010480
#FW03FBS11&CG1 EQU  X'0020'        BOOKING CODE APPLIES TO SGMT 11      FW010490
#FW03FBS12&CG1 EQU  X'0010'        BOOKING CODE APPLIES TO SGMT 12      FW010500
#FW03FBS13&CG1 EQU  X'0008'        BOOKING CODE APPLIES TO SGMT 13      FW010510
#FW03FBS14&CG1 EQU  X'0004'        BOOKING CODE APPLIES TO SGMT 14      FW010520
#FW03FBS15&CG1 EQU  X'0002'        BOOKING CODE APPLIES TO SGMT 15      FW010530
#FW03FBS16&CG1 EQU  X'0001'        BOOKING CODE APPLIES TO SGMT 16      FW010540
*********************************************************************** FW010550
** END OF BOOKING CODE INFORMATION                                   ** FW010560
*********************************************************************** FW010570
FW03EBC&CG1  EQU  *                END OF BOOKING CODE INFORMATION      FW010580
         EJECT                                                          FW010590
*********************************************************************** FW010600
*********************************************************************** FW010610
**                                                                   ** FW010620
** SECTION INFORMATION:                                              ** FW010630
**                                                                   ** FW010640
** TYPE:        QUERY/RESPONSE                                       ** FW010650
** NAME:        BEST BUY BOOKING CLASSES                             ** FW010660
** IDENTIFIER:  C                                                    ** FW010670
**                                                                   ** FW010680
** PRIME KEY:   X'38'                                                ** FW010690
** ITEM ID:     BK                                                   ** FW010700
** UNIQUE KEY:  PASSENGER NUMBER - USED FOR MULTI-PIC WHEN ITEMS     ** FW010710
**              DIFFER.  IF 0, THEN APPLIES TO ALL PASSENGERS.       ** FW010720
**                                                                   ** FW010730
** PURPOSE:     THIS SECTION IS USED FOR BOTH INPUT & OUTPUT OF      ** FW010740
**              BOOKING CODES FOR FQBX ENTRIES.  ON INPUT, IT IS THE ** FW010750
**              BOOKING CODES AVAILABLE FOR EACH SEGMENT.  ON OUTPUT ** FW010760
**              IT IS THE BOOKING CODES APPLICABLE.  NOTE THAT       ** FW010770
**              THAT ON A MULTI-PIC àBB ENTRY, EACH PIC COULD        ** FW010780
**              POSSIBLY HAVE A DIFFERENT SET OF BOOKING CODES       ** FW010790
**              RETURNED.                                            ** FW010800
**                                                                   ** FW010810
*********************************************************************** FW010820
*********************************************************************** FW010830
          ORG  FW03USR&CG1                                              FW010840
FW03FCNBR&CG1  DS   X              NUMBER OF BOOKING CODES FOLLOW       FW010850
FW03FCITM&CG1  DS   0XL4           BOOKING CODE ITEM                    FW010860
FW03FCBKC&CG1  DS   CL2            BOOKING CODE                         FW010870
*                                                                       FW010880
*         THE FOLLOWING 4 EQUATES ARE APPLICABLE TO FQP ONLY.       G03 FW010890
*         ALL OTHER ENTRIES WILL HAVE CHARACTER BOOKING CODES.      G03 FW010900
*                                                                       FW010910
#FW03FCECO&CG1 EQU  X'0001'        ECONOMY CLASS                    G03 FW010920
#FW03FCBUS&CG1 EQU  X'0002'        BUSINESS CLASS                   G03 FW010930
#FW03FCFST&CG1 EQU  X'0003'        FIRST                            G03 FW010940
#FW03FCCON&CG1 EQU  X'0004'        CONCORD                          G03 FW010950
*                                                                       FW010960
FW03FCSEG&CG1  DS   XL2            SEGMENT APPLICABILITY BIT MAP        FW010970
#FW03FCS01&CG1 EQU  X'8000'        BOOKING CODE APPLIES TO SGMT 1       FW010980
#FW03FCS02&CG1 EQU  X'4000'        BOOKING CODE APPLIES TO SGMT 2       FW010990
#FW03FCS03&CG1 EQU  X'2000'        BOOKING CODE APPLIES TO SGMT 3       FW011000
#FW03FCS04&CG1 EQU  X'1000'        BOOKING CODE APPLIES TO SGMT 4       FW011010
#FW03FCS05&CG1 EQU  X'0800'        BOOKING CODE APPLIES TO SGMT 5       FW011020
#FW03FCS06&CG1 EQU  X'0400'        BOOKING CODE APPLIES TO SGMT 6       FW011030
#FW03FCS07&CG1 EQU  X'0200'        BOOKING CODE APPLIES TO SGMT 7       FW011040
#FW03FCS08&CG1 EQU  X'0100'        BOOKING CODE APPLIES TO SGMT 8       FW011050
#FW03FCS09&CG1 EQU  X'0080'        BOOKING CODE APPLIES TO SGMT 9       FW011060
#FW03FCS10&CG1 EQU  X'0040'        BOOKING CODE APPLIES TO SGMT 10      FW011070
#FW03FCS11&CG1 EQU  X'0020'        BOOKING CODE APPLIES TO SGMT 11      FW011080
#FW03FCS12&CG1 EQU  X'0010'        BOOKING CODE APPLIES TO SGMT 12      FW011090
#FW03FCS13&CG1 EQU  X'0008'        BOOKING CODE APPLIES TO SGMT 13      FW011100
#FW03FCS14&CG1 EQU  X'0004'        BOOKING CODE APPLIES TO SGMT 14      FW011110
#FW03FCS15&CG1 EQU  X'0002'        BOOKING CODE APPLIES TO SGMT 15      FW011120
#FW03FCS16&CG1 EQU  X'0001'        BOOKING CODE APPLIES TO SGMT 16      FW011130
*********************************************************************** FW011140
** END OF BEST BUY BOOKING CODE SECTION                              ** FW011150
*********************************************************************** FW011160
FW03EBK&CG1  EQU  *                END OF BEST BUY BOOKING CODE SECTION FW011170
          EJECT                                                         FW011180
*********************************************************************** FW011190
*********************************************************************** FW011200
**                                                                   ** FW011210
** SECTION INFORMATION:                                              ** FW011220
**                                                                   ** FW011230
** TYPE:        QUERY/RESPONSE                                       ** FW011240
** NAME:        FLIGHT LED AVAILABILITY JOURNEY ITEM PHASE 1         ** FW011250
** IDENTIFIER:  F                                                    ** FW011260
**                                                                   ** FW011270
** PRIME KEY:   X'38'                                                ** FW011280
** ITEM ID:     FL                                                   ** FW011290
** UNIQUE KEY:  JOURNEY NUMBER STARTING FROM 1                       ** FW011300
**                                                                   ** FW011310
** PURPOSE:     THIS SECTION IS USED FOR BOTH INPUT & OUTPUT OF      ** FW011320
**              FLIGHT LED AVAILABILITY DATA.  THE UKY FIELD IS USED ** FW011330
**              TO ASSOCIATE CONNECTING FLIGHTS, E.G., A JOURNEY     ** FW011340
**              FROM POINT A TO POINT B MAY CONSIST OF CONNECTING    ** FW011350
**              CITY C - THUS 2 OF THESE LRECS, A/C AND C/B WOULD    ** FW011360
**              EXIST AND HAVE THE SAME UKY VALUE.  MULTIPLE LRECS   ** FW011370
**              MAY EXIST WITH MULTIPLE JOURNIES.  UPON INPUT THE    ** FW011380
**              AVAILABLE CLASSES ARE INCLUDED FOR EACH FLIGHT       ** FW011390
**              SEGMENT.  UPON OUTPUT ONLY THOSE JOURNIES THAT       ** FW011400
**              'PASS' WILL BE RETURNED WITH THE APPLICABLE BOOKING  ** FW011410
**              CODE.                                                ** FW011420
**                                                                G03** FW011430
*********************************************************************** FW011440
*********************************************************************** FW011450
          ORG  FW03USR&CG1                                              FW011460
FW03FFCXR&CG1  DS   CL2            CARRIER CODE                         FW011470
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW011480
FW03FFFLT&CG1  DS   XL2            FLIGHT NUMBER                        FW011490
FW03FFBRD&CG1  DS   CL3            BOARD POINT                          FW011500
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW011510
FW03FFOFF&CG1  DS   CL3            OFF POINT                            FW011520
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW011530
FW03FFDTE&CG1  DS   XL2            DEPARTURE DATE - PARS                FW011540
FW03FFDEP&CG1  DS   XL2            DEPARTURE TIME - MIN. PAST MIDNITE   FW011550
FW03FFARR&CG1  DS   XL2            ARRIVAL TIME - MIN. PAST MIDNITE     FW011560
*                                                                       FW011570
FW03FFIND&CG1  DS   X              INDICATOR                            FW011580
#FW03FFPL1&CG1 EQU  X'80'          DAY PLUS 1                           FW011590
#FW03FFPL2&CG1 EQU  X'40'          DAY PLUS 2                           FW011600
#FW03FFMI1&CG1 EQU  X'C0'          DAY MINUS 1                          FW011610
*                                                                       FW011620
FW03FFCNT&CG1  DS   X              COUNT OF BOOKING CLASSES FOLLOW      FW011630
FW03FFCLS&CG1  DS   CL2            BOOKING CLASS (MULTIPLE MAY EXIST)   FW011640
*                                                                       FW011650
*********************************************************************** FW011660
** END OF FLIGHT LED AVAILABILITY JOURNEY ITEM INFORMATION           ** FW011670
*********************************************************************** FW011680
FW03EFL&CG1 EQU  *                 END OF FLA JOURNEY ITEM INFORMATION  FW011690
          EJECT                                                         FW011700
*********************************************************************** FW011710
*********************************************************************** FW011720
**                                                                   ** FW011730
** SECTION INFORMATION:                                              ** FW011740
**                                                                   ** FW011750
** TYPE:        QUERY/RESPONSE                                       ** FW011760
** NAME:        PIC CODES                                            ** FW011770
** IDENTIFIER:  Y                                                    ** FW011780
**                                                                   ** FW011790
** PRIME KEY:   X'38'                                                ** FW011800
** ITEM ID:     PI                                                   ** FW011810
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1                     ** FW011820
**                                                                   ** FW011830
** PURPOSE:     PASSENGER INFORMATION FOR BOTH QUERIES AND           ** FW011840
**              RESPONSES FOR ANY ENTRY THAT SUPPORTS PIC CODES.     ** FW011850
**                                                                   ** FW011860
*********************************************************************** FW011870
*********************************************************************** FW011880
          ORG  FW03USR&CG1                                              FW011890
*                                                                       FW011900
*TK-P011905FW03FYPIQ&CG1 DS 0XL8        QUERY PIC INFORMATION           FW011910
FW03FYPIQ&CG1  DS   0XL14           QUERY PIC INFORMATION   TK-P011905  FW011910
*TK-P011905FW03FYPIC&CG1 DS CL3         PIC CODE REQUESTED              FW011920
FW03FYPIC&CG1  DS   CL10           PIC CODE REQUESTED       TK-P011905  FW011920
*                                   OR ATPCO PASSENGER TYPE CODE  ETKT  FW011930
FW03FYAMT&CG1  DS   XL4            REQUEST AMOUNT                       FW011940
*                                   CAN BE 100 FOR DISCOUNT AMOUNTS     FW011950
FW03FYIN1&CG1  DS   X              INDICATOR                            FW011960
#FW03FYITA&CG1 EQU  X'80'          IATA FORMAT                          FW011970
#FW03FYATP&CG1 EQU  X'40'          APOLLO FORMAT                        FW011980
#FW03FYPCT&CG1 EQU  X'20'          AMOUNT IS PERCENTAGE                 FW011990
#FW03FYAMT&CG1 EQU  X'10'          AMOUNT IS AMOUNT                     FW012000
#FW03FYAGE&CG1 EQU  X'08'          AMOUNT IS AGE                        FW012010
#FW03FYEQU&CG1 EQU  X'04'          RETURNED SAME AS REQUESTED           FW012020
*                                                                       FW012030
*TK-P011905FW03FYPIO&CG1 DS 0XL8     RESPONSE PIC INFORMATION           FW012040
FW03FYPIO&CG1  DS   0XL14       RESPONSE PIC INFORMATION   TK-P011905   FW012040
*                                       FARE QUOTE PROCESSING ONLY      FW012050
*                                                                       FW012060
*TK-P011905FW03FYPIR&CG1 DS CL3         PIC CODE RETURNED               FW012070
FW03FYPIR&CG1  DS   CL10            PIC CODE RETURNED      TK-P011905   FW012070
*                                                                       FW012080
FW03FYAMR&CG1  DS   XL4            RETURN AMOUNT                        FW012090
*                                                                       FW012100
FW03FYIN2&CG1  DS   X              INDICATOR                            FW012110
#FW03FYITR&CG1 EQU  X'80'          IATA FORMAT PIC - 2 BYTE PIC         FW012120
#FW03FYATR&CG1 EQU  X'40'          ATPCO FORMAT PIC  - 3 BYTE PIC       FW012130
#FW03FYPCR&CG1 EQU  X'20'          AMOUNT IS PERCENTAGE                 FW012140
#FW03FYAMR&CG1 EQU  X'10'          AMOUNT IS AMOUNT                     FW012150
#FW03FYAGR&CG1 EQU  X'08'          AMOUNT IS AGE                        FW012160
#FW03FYPFC&CG1 EQU  X'04'          PFC'S APPLY                          FW012170
#FW03FYBPC&CG1 EQU  X'02'          BP00N1 AWARD FARE       TK-P011905   FW012170
#FW03FYZZC&CG1 EQU  X'01'          ECN ZS CODE             TK-P011905
*                                                                       FW012180
FW03FYIN3&CG1  DS   X              INDICATOR               TK-P011905   FW012110
#FW03FYAWD&CG1 EQU  X'80'          BP00N1 INTERN. IND.     TK-P012051
*                   X'40'          BIT 1 - EXTRA SEAT FOUNDTK-P029436
FW03FYIN4&CG1  DS   X              INDICATOR               TK-P011905   FW012110
FW03FYIN5&CG1  DS   X              INDICATOR               TK-P011905   FW012110
               DS   CL5            SPARE                   TK-P011905   FW012110
FW03FYNBR&CG1  DS   X              NUMBER OF PASSENGERS WITH THIS PIC   FW012190
FW03FYPSG&CG1  DS   CL2            PASSENGER NBR (MULTIPLE MAY EXIST)   FW012200
*********************************************************************** FW012210
** END OF PIC INFORMATION                                            ** FW012220
*********************************************************************** FW012230
FW03EPI&CG1  EQU  *                END OF PIC INFORMATION               FW012240
         EJECT                                                          FW012250
*********************************************************************** FW012260
*********************************************************************** FW012270
**                                                                   ** FW012280
** SECTION INFORMATION:                                              ** FW012290
**                                                                   ** FW012300
** TYPE:        QUERY                                                ** FW012310
** NAME:        FLIGHT LED AVAILABILITY CONTROL INFORMATION PHASE 1  ** FW012320
** IDENTIFIER:  1                                                    ** FW012330
**                                                                   ** FW012340
** PRIME KEY:   X'38'                                                ** FW012350
** ITEM ID:     F1                                                   ** FW012360
** UNIQUE KEY:  LINE NUMBER IN FARE DISPLAY STARTING FROM X'0001'    ** FW012370
**                                                                   ** FW012380
** PURPOSE:     THIS SECTION IS USED TO SUPPLY CONTROL INFORMATION   ** FW012390
**              FOR FLIGHT LED AVAILABILITY PHASE 1.  IT IS A        ** FW012400
**              REQUIRED SECTION FOR FLIGHT LED AVAILABILITY QUERIES.** FW012410
**                                                                G03** FW012420
*********************************************************************** FW012430
*********************************************************************** FW012440
          ORG  FW03USR&CG1                                              FW012450
FW03Q1CXR&CG1  DS   CL2            OVERRIDE CARRIER CODE                FW012460
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW012470
*BG09FW03Q1FBC&CG1  DS   CL10      FARE BASIS CODE - LEFT JUSTIFIED,    FW012480
*BG09                              BLANK FILLED                         FW012490
FW03Q1BRD&CG1  DS   CL3            JOURNEY BOARD                        FW012500
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW012510
FW03Q1OFF&CG1  DS   CL3            JOURNEY OFF                          FW012520
               DS   CL2            RESERVED FOR CITY CODE EXPANSION     FW012530
*                                                                       FW012540
*********************************************************************** FW012550
** END OF FLIGHT LED AVAILABILITY CONTROL INFORMATION PHASE 1        ** FW012560
*********************************************************************** FW012570
FW03EF0&CG1 EQU  *                  END OF FLA CONTROL INFORMATION  G08 FW012580
*                                                                       FW012590
*********************************************************************** FW012600
*********************************************************************** FW012610
**                                                                   ** FW012620
** SECTION INFORMATION:                                              ** FW012630
**                                                                   ** FW012640
** TYPE:        QUERY                                                ** FW012650
** NAME:        HEADER                                               ** FW012660
** IDENTIFIER:  H                                                    ** FW012670
**                                                                   ** FW012680
** PRIME KEY:   X'38'                                                ** FW012690
** ITEM ID:     QH                                                   ** FW012700
** UNIQUE KEY:  X'0000'                                              ** FW012710
**                                                                   ** FW012720
** PURPOSE:     THIS SECTION IDENTIFIES THE ACTION CODE, CONTAINS    ** FW012730
**              PERTINENT AGENT INFORMATION, AND HAS SERVICE LEVEL   ** FW012740
**              INDICATORS.  IT MUST ACCOMPANY EACH REQUEST INTO     ** FW012750
**              GLOBAL FARES.                                        ** FW012760
**                                                                   ** FW012770
*********************************************************************** FW012780
*********************************************************************** FW012790
          ORG  FW03USR&CG1                                              FW012800
FW03QHVRI&CG1  DS   X              GF BLOCK INPUT VERSION SENT          FW012810
*                                  MUST BE 1 FOR THIS VERSION           FW012820
FW03QHCTY&CG1  DS   CL3            CRT LOCATION/SELLING CITY            FW012830
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW012840
FW03QHPPC&CG1  DS   CL4            AGENT PSEUDO CITY CODE               FW012850
*                                                                       FW012860
FW03QHCRS&CG1  DS   X              AGENT CRS EQUATE                     FW012870
*FW03QHAPO&CG1 EQU  X'00'          APOLLO CRS                       G03 FW012880
*FW03QHGAL&CG1 EQU  X'01'          GALILEO CRS                      G03 FW012890
*FW03QHGEM&CG1 EQU  X'02'          GEMINI CRS                       G03 FW012900
*FW03QHKLM&CG1 EQU  X'03'          KLM                              G03 FW012910
*FW03QHSAR&CG1 EQU  X'04'          SWISS AIR                        G03 FW012920
*                                                                       FW012930
#FW03QH1V&CG1  EQU  X'00'          APOLLO                           G03 FW012940
#FW03QH1G&CG1  EQU  X'01'          GALILEO                          G03 FW012950
#FW03QH1C&CG1  EQU  X'02'          GEMINI                           G03 FW012960
#FW03QHAC&CG1  EQU  X'03'          AC/RES3                          G03 FW012970
#FW03QHKL&CG1  EQU  X'04'          KLM                              G03 FW012980
#FW03QHEI&CG1  EQU  X'05'          EI                               G03 FW012990
#FW03QHSR&CG1  EQU  X'06'          SWISS                            G03 FW013000
#FW03QHBA&CG1  EQU  X'07'          BA                               G03 FW013010
#FW03QHTP&CG1  EQU  X'08'          TAP                              G03 FW013020
#FW03QHTK&CG1  EQU  X'10'          THY                           TK1000 FW013020
*                                                                       FW013030
FW03QHDIF&CG1  DS   XL2            TIME DIFFERENTIAL FROM DEN IN 30 MIN FW013040
*                 B'0 000000000000000' INTERVALS                        FW013050
*                   ¦ ¦                                                 FW013060
*                   ¦ NO. OF 30 MIN INTERVALS                           FW013070
*                   POSITIVE/NEGATIVE DIFFERENTIAL                      FW013080
*                    OFF = POSITIVE                                     FW013090
*                    ON  = NEGATIVE                                     FW013100
*                                                                       FW013110
FW03QHLNG&CG1  DS   X              LANGAUGE NUMBER                      FW013120
#FW03QHENG&CG1 EQU  X'00'          ENGLISH - DEFAULT                    FW013130
#FW03QHFRC&CG1 EQU  X'01'          FRENCH CANADIEN - NOT AVLBL ON   G03 FW013140
*                                                    ALL ENTRIES    G03 FW013150
#FW03QHESP&CG1 EQU  X'02'          SPANISH - NOT YET AVAILABLE      G03 FW013160
#FW03QHPOR&CG1 EQU  X'03'          PORTUGESE -  NOT YET AVAILABLE   G03 FW013170
*                                                                       FW013180
FW03QHACT&CG1  DS   X              ACTION CODE IDENTIFIER               FW013190
*                                                                       FW013200
*                           ACTION CODE  GALILEO   APOLLO ENTRY         FW013210
*                            NUM  HEX    ENTRY     FQS      IFQ         FW013220
*                           ____  _____  ________  ______   ________    FW013230
*  IGNORE/ET-END SESSION    = 0   X'00'  I/ET      I/ET     I/ET        FW013240
*  FARE QUOTE FROM PNR      = 1   X'01'  FQ        àB       àB          FW013250
*  BEST BUY                 = 1   X'01'  FQBB      àBB      àBB         FW013260
*  TARIFF DISPLAY           = 2   X'02'  FD        àD       àD          FW013270
*  ONE TARIFF/OTHER PSGR    = 3   X'03'  FD*                àD#         FW013280
*  LEG MILEAGE DISPLAY      = 4   X'04'  FL                 àLM         FW013290
*  MILEAGE SURCHG BANDS     = 4   X'04'  FM                 àLM         FW013300
*                           = 5   X'05'                                 FW013310
*  ROUTES AFTER àD          = 6   X'06'  FR        àLR      àLR         FW013320
*  UNSALEABLE FARES DISPLAY = 7   X'07'  FU                 àLU         FW013330
*  CITY INFO FROM àD        = 8   X'08'  FC*                àLI         FW013340
*                           = 9   X'09'                                 FW013350
*  FQ ALTERNATES            = 10  X'0A'  FQA                FQA         FW013360
*  FI/REDISPLAY LINEAR      = 11  X'0B'  FIR                FIR         FW013370
*  DISPLAY BLANK LADDER     = 12  X'0C'  FQB                FQB         FW013380
*  FARE AMENDS W/FQ         = 13  X'0D'  FA...¦FQ           FA...¦FQ    FW013390
*  PSEUDO ITINS W/FQ        = 14  X'0E'  FO...¦FQ           FO...¦FQ    FW013400
*  FI/REDISP ORIG LADDER    = 15  X'0F'  FIL                FIL         FW013410
*  FARE IGNORE              = 16  X'10'  FI                 FI          FW013420
*  PSEUDO ITINERARIES       = 17  X'11'  FO                 FO          FW013430
*  REDISPLAY LAST FQ        = 18  X'12'  FQ*                FQ*         FW013440
*  DISPLAY ALTERNATE FQ     = 19  X'13'  FQA*               FQA*        FW013450
*  DISPLAY FQ COMPONENTS    = 20  X'14'  FQN                FQN         FW013460
*  DISP DETAIL FQ LADDER    = 21  X'15'  FQL                FQL         FW013470
*  FARE QUOTE W/OUT PNR     = 22  X'16'  FQ                 FQ          FW013480
*  FARE RULES FROM FD       = 23  X'17'  FN*       àV       àV/FN*      FW013490
*  FARE AMENDMENTS          = 24  X'18'  FA                 FA          FW013500
*  CURRENCY DISP/CONVERT    = 25  X'19'  FZ                 FZ          FW013510
*  CITY INFORMATION         = 26  X'1A'  FC                 FC          FW013520
*                           = 27  X'1B'                                 FW013530
*  FLIGHT TYPE TABLE        = 28  X'1C'  FE                 FE          FW013540
*                           = 29  X'1D'                                 FW013550
*  ADD ON DISPLAY           = 30  X'1E'  FH*#               FD#         FW013560
*  FARES RULES FROM FQN     = 31  X'1F'  FN                 FN          FW013570
*  ROUTES AFTER FQN         = 32  X'20'  FR                 FR          FW013580
*  FI/REDISP CURR LADDER    = 33  X'21'  FIB                FIB         FW013590
*  DIRECT RULES DISPLAY     = 34  X'22'  FN        àV/CTY               FW013600
*  RULES FROM FQS FQ        = 35  X'23'  FN        àV:                  FW013610
*  ROUTES AFTER FQS FQ      = 36  X'24'  FRS       àLRS                 FW013620
*  FQ WITHOUT ITINERARY     = 37  X'25'  FQO       àQAO     àQAO        FW013630
*    THIS ACTION CODE NOT SUPPORTED ANYMORE                      OZ
*  FQ BEST NORMAL FARE      = 38  X'26'  FQY                FQY         FW013640
*  DISPLAY BOOKING CODES    = 39  X'27'  FDC                àLB         FW013650
*  DISPLAY INT'L TAX TXT    = 40  X'28'  FTAX               àTAX        FW013660
*  DISPLAY PFC TABLE        = 41  X'29'  FTAX*PFC           àPFC        FW013670
*  DISPLAY MORE ROUTES      = 42  X'2A'  FR*MORE            àLR*        FW013680
*  BOOKED/LOWEST COMPARE    = 43  X'43'  FQBC               àBBC        FW013690
*  FQP ENTRY                =     X'80'  FQP                FQP         FW013700
*  STRUCTURED RULES RQST    =     X'81'  N/A                N/A         FW013710
*  FLA REQUEST              =     X'82'                             G03 FW013720
*                                                                       FW013730
* THE FOLLOWING 3 INDICATORS ARE GENERAL SERVICE LEVEL                  FW013740
* INDICATORS.  THEY MAY NOT BE REDEFINED.                               FW013750
*                                                                       FW013760
FW03QHGSV1&CG1 DS   X              GENERAL SERVICE LEVEL IND. 1         FW013770
*              B'0 1 2 3 4 5 6 7'                                       FW013780
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW013790
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ INPUT NUMBER 'NB' SECTION EXISTS         FW013800
*                ¦ ¦ ¦ ¦ ¦ ¦ PRIVATE FARE 'PV' SECTION EXISTS           FW013810
*                ¦ ¦ ¦ ¦ ¦ PENALTY MODIFIER 'PE' SECTION EXISTS         FW013820
*                ¦ ¦ ¦ ¦ FI PLUS ANOTHER ENTRY                          FW013830
*                ¦ ¦ ¦ INPUT MSG 'IM' SECTION EXISTS                    FW013840
*                ¦ ¦ REDISPLAY ACTION CODE                              FW013850
*                ¦ SUPPRESS MESSAGE TEXT                                FW013860
*                RETURN CRT(OM) OUTPUT                                  FW013870
*                                                                       FW013880
#FW03QHCRT&CG1 EQU  X'80'          RETURN CRT OUTPUT                    FW013890
#FW03QHMST&CG1 EQU  X'40'          SUPPRESS MESSAGE TEXT                FW013900
#FW03QHRED&CG1 EQU  X'20'          REDISPLAY ACTION CODE ENTERED BELOW  FW013910
#FW03QHINP&CG1 EQU  X'10'          INPUT MESSAGE SECTION EXISTS         FW013920
#FW03QHFIP&CG1 EQU  X'08'          FI PLUS ANOTHER ENTRY                FW013930
#FW03QHPEN&CG1 EQU  X'04'          PENALTY MODIFIER 'PE' SECTION EXISTS FW013940
#FW03QHPVT&CG1 EQU  X'02'          PRIVATE FARE SECTION EXISTS          FW013950
#FW03QHNBE&CG1 EQU  X'01'          'NB' SECTION EXISTS                  FW013960
*                                                                       FW013970
FW03QHGSV2&CG1 DS   X              GENERAL SERVICE LEVEL IND. 2         FW013980
*              B'0 1 2 3 4 5 6 7'                                       FW013990
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW014000
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW014010
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW014020
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW014030
*                ¦ ¦ ¦ ¦ FQFA ENTRY ( FILE ANCILLARY) EXIST      TKT-61 FW014040
*                ¦ ¦ ¦ FQDA ENTRY ( DISPLAY ANCILLARY) EXIST     TKT-61 FW014050
*                ¦ ¦ PASSENGER IDENTIFIER 'PI' SECTION EXISTS           FW014060
*                ¦ TRANSLATE '.' TO #END                                FW014070
*                ACTION CODE ONLY                                       FW014080
*                                                                       FW014090
#FW03QHACO&CG1 EQU  X'80'          ACTION CODE ONLY                     FW014100
#FW03QHD2E&CG1 EQU  X'40'          TRANSLATE '.' TO #END                FW014110
#FW03QHPIC&CG1 EQU  X'20'          PIC SECTION EXISTS                   FW014120
#FW03QHPDA&CG1 EQU  X'10'          FQDA - DISPLAY ANCILLARY SERV.TKT-61 FW014120
#FW03QHPFA&CG1 EQU  X'08'          FQFA - FILE  ANCILLARY SERV.  TKT-61 FW014120
*                                                                       FW014130
FW03QHGSV3&CG1 DS   X              GENERAL SERVICE LEVEL IND. 3         FW014140
*                                                                       FW014150
*              B'0 1 2 3 4 5 6 7'                                       FW014160
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW014170
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AIRLINE PRIVATE FARES REQUESTED          FW014180
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW014190
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW014200
*                ¦ ¦ ¦ ¦ SPARE                                          FW014210
*                ¦ ¦ ¦ SPARE                                            FW014220
*                ¦ ¦ PRIVATE FARE PQ SECTION  EXISTS                    FW014230
*                ¦ PRIVATE FARE PW SECTION EXISTS                       FW014240
*                DEFAULT CURRENCY = 'EUR'                               FW014250
*TK1000          SPARE                                                  FW014250
*                                                                       FW014260
#FW03QHEUR&CG1   EQU  X'80'  DEFAULT CURRENCY = 'EUR'      TK1000
#FW03QHPWE&CG1   EQU  X'40'  PRIVATE FARE PW SECTION EXISTS  TK14574
#FW03QHPQE&CG1   EQU  X'20'  PRIVATE FARE PQ SECTION EXISTS  TK14574
#FW03QHLCU&CG1   EQU  X'02'  DEFAULT CURRENCY = 'LCU'      TK1000
#FW03QHPFR&CG1   EQU  X'01'  AIRLINE PRIVATE FARES REQUESTED TK14574
* THE FOLLOWING TWO INDICATORS ARE SERVICE LEVEL INDICATORS SPECIFIC    FW014270
* TO EACH APPLICATION.  THEY MAY BE REDEFINED FOR EACH ENTRY TYPE.      FW014280
*                                                                       FW014290
FW03QHASV1&CG1 DS   X              APPLICATIONS SERVICE LEVEL IND. 1    FW014300
*                                                                       FW014310
*********************************************************************** FW014320
*  START OF DEFINITIONS FOR FD TARIFF DISPLAY ENTRIES                 * FW014330
*********************************************************************** FW014340
*              B'0 1 2 3 4 5 6 7'                                       FW014350
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW014360
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ HMCT PSUEDOS INPUT                       FW014370
*                ¦ ¦ ¦ ¦ ¦ ¦ -PRIVATE DISPLAY                           FW014380
*                ¦ ¦ ¦ ¦ ¦ :P NON-INTEGRATED DISPLAY                    FW014390
*                ¦ ¦ ¦ ¦ :F FORMULA DISPLAY                             FW014400
*                ¦ ¦ ¦ -PRI REQUEST                                     FW014410
*                ¦ ¦ RETURN DISPLAY IN HIGH TO LOW ORDER                FW014420
*                ¦ SUPPRESS AIRPORT SORT                                FW014430
*                SUPPRESS YY CARRIER CODE                               FW014440
*                                                                       FW014450
#FW03Q2NOYY&CG1 EQU  X'80'         SUPPRESS YY CARRIER CODE             FW014460
#FW03Q2NOAS&CG1 EQU  X'40'         SUPPRESS AIRPORT SORT                FW014470
#FW03Q2NHIH&CG1 EQU  X'20'         RETURN DISPLAY HIGH TO LOW           FW014480
#FW03Q2PRI&CG1  EQU  X'10'         -PRI REQUEST                         FW014490
#FW03Q2PFD&CG1  EQU  X'08'         :F FORMULA DISPLAY REQUEST           FW014500
#FW03Q2PNI&CG1  EQU  X'04'         :P NON-INTEGRATED REQUEST            FW014510
#FW03Q2PRV&CG1  EQU  X'02'         -PRIVATE DISPLAY REQUEST             FW014520
#FW03Q2PHM&CG1  EQU  X'01'         HMCT PSEUDOS INPUT                   FW014530
*                                  NOTE: THIS IMPLIES FW03QZPPC         FW014540
*                                  SHOULD BE USED IN $D REQUESTS        FW014550
*********************************************************************** FW014560
*  END OF DEFINITIONS FOR FD TARIFF DISPLAY ENTRIES                   * FW014570
*********************************************************************** FW014580
*                                                                       FW014590
*********************************************************************** FW014600
*  START OF DEFINITIONS FOR FQ ENTRIES                                * FW014610
*********************************************************************** FW014620
*                                                                       FW014630
*              B'0 1 2 3 4 5 6 7'                                       FW014640
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW014650
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ MUST ONLY BREAK FARE AT PTS INDICATED 02 FW014660
*                ¦ ¦ ¦ ¦ ¦ ¦ SUPPRESS FARE BASIS CODES IN FC LREC   G03 FW014670
*                ¦ ¦ ¦ ¦ ¦ RETURN CHEAPEST FARES FOR FQA                FW014680
*                ¦ ¦ ¦ ¦ TREAT FQ AS A FQBB ENTRY                       FW014690
*                ¦ ¦ ¦ DON'T INTEGRATE PRIVATE FARE QUOTE (/:P)         FW014700
*                ¦ ¦ DON'T APPLY PFC LOGIC                              FW014710
*                ¦ INTERNATIONAL TAX EXEMPT ENTRY                       FW014720
*                REMOVE US TRANSPORTATION TAX AND AK/HI RATIO TAX       FW014730
*                                                                       FW014740
#FW03QANOTX&CG1  EQU X'80'         REMOVE US TAX                        FW014750
#FW03QATXEX&CG1  EQU X'40'         INT'L TAX EXEMPT ENTRY               FW014760
#FW03QAXPFC&CG1  EQU X'20'         DON'T APPLY PFC LOGIC                FW014770
#FW03QAXPVF&CG1  EQU X'10'         DON'T INTEGRATE PRIV FARES           FW014780
#FW03QAFQBB&CG1  EQU X'08'         TREAT FQ AS A FQBB ENTRY             FW014790
#FW03QAFQAL&CG1  EQU X'04'         RETURN CHEAPEST FARES FOR FQA        FW014800
*                                   IF = 0, USE BUCKET CONCEPT FOR FQA  FW014810
#FW03QGNOFB&CG1 EQU X'02'          SUPPRESS FBC IN FC LREC          G03 FW014820
#FW03QAMOB&CG1  EQU X'01'          MUST ONLY BREAK FARE AS INDICATED 02 FW014830
*********************************************************************** FW014840
*  END OF DEFINITIONS FOR FQ ENTRIES                                  * FW014850
*********************************************************************** FW014860
*                                                                       FW014870
*********************************************************************** FW014880
*  START OF DEFINITIONS FOR FR FOLLOW-UP TO FD - ACTION CODE 6        * FW014890
*********************************************************************** FW014900
*                                                                       FW014910
*              B'0 1 2 3 4 5 6 7'                                       FW014920
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW014930
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW014940
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW014950
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW014960
*                ¦ ¦ ¦ ¦ SPARE                                          FW014970
*                ¦ ¦ ¦ DESTINATION                                      FW014980
*                ¦ ¦ S-SPECIFIED                                        FW014990
*                ¦ O-ORIGIN                                             FW015000
*                BASE/TAX/TOTAL DISPLAY FOR FARE                        FW015010
*                                                                       FW015020
#FW03QRBTT&CG1 EQU  X'80'          DISPLAY BASE/TAX/TOTAL FOR FARE      FW015030
*                                                                       FW015040
* THE FOLLOWING THREE INDICATORS ARE VALID FOR IFQ DISPLAYS ONLY        FW015050
*                                                                       FW015060
#FW03QRORG&CG1 EQU  X'40'          DISPLAY ORIGIN OPTION                FW015070
#FW03QRSPC&CG1 EQU  X'20'          DISPLAY SPECIFIED OPTION             FW015080
#FW03QRDST&CG1 EQU  X'10'          DISPLAY DESTINATION OPTION           FW015090
*********************************************************************** FW015100
*  END OF DEFINITIONS FOR FR FOLLOW-UPS TO FD                         * FW015110
*********************************************************************** FW015120
*                                                                       FW015130
*********************************************************************** FW015140
*  START OF DEFINITIONS FOR FZ CURRENCY CONVERSION ENTRIES            * FW015150
*********************************************************************** FW015160
*                                                                       FW015170
*              B'0 1 2 3 4 5 6 7'                                       FW015180
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW015190
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW015200
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW015210
*                ¦ ¦ ¦ ¦ ¦ DISPLAY FROM TABLE ENTRY                     FW015220
*                ¦ ¦ ¦ ¦ SPARE                                      G10 FW015230
*                ¦ ¦ ¦ SPARE                                        G10 FW015240
*                ¦ ¦ SPARE                                          G10 FW015250
*                ¦ SPARE                                            G10 FW015260
*                FZINUC CALCULATOR ENTRY                            G10 FW015270
*                                                                       FW015280
*G10#FW03QFBUP&CG1 EQU  X'80'          BEGIN UPDATE SESSION             FW015290
*G10#FW03QFADD&CG1 EQU  X'40'          ADD/CHANGE                       FW015300
*G10#FW03QFDEL&CG1 EQU  X'20'          DELETE                           FW015310
*G10#FW03QFCHS&CG1 EQU  X'10'          CHANGE SCREEN ????               FW015320
*G10#FW03QFCPY&CG1 EQU  X'08'          COPY                             FW015330
#FW03QFADD&CG1 EQU  X'80'          FZINUC CALCULATOR ENTRY          G10 FW015340
#FW03QRDSP&CG1 EQU  X'04'          DISPLAY FROM TABLE ENTRY             FW015350
*********************************************************************** FW015360
*  END OF DEFINITIONS FOR FZ CURRENCY CONVERSION ENTRIES              * FW015370
*********************************************************************** FW015380
FW03QHASV2&CG1 DS   X              APPLICATIONS SERVICE LEVEL IND. 2    FW015390
*********************************************************************** FW015400
*  START OF DEFINITIONS FOR FD ENTRIES                                * FW015410
*********************************************************************** FW015420
*              B'0 1 2 3 4 5 6 7'                                       FW015430
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW015440
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW015450
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW015460
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW015470
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW015480
*                ¦ ¦ ¦ NAFQ DEFAULT TO BASE FARES WHEN NO MODIFIERS.    FW015490
*                ¦ ¦ SUPPRESS COMPANION FARES FROM NLX DISPLAY   G10G07 FW015500
*                ¦ HISTORICAL FARES ENTRY (ONLY VALID ON TEST SYSTEM)   FW015510
*                REMOVE INFANTS FROM EXB/NXB/NLB                        FW015520
*                                                                       FW015530
#FW03Q2INF&CG1 EQU  X'80'          DISPLAY BASE/TAX/TOTAL FOR FARE      FW015540
#FW03Q2HST&CG1 EQU  X'40'          HISTORICAL FARES ENTRY (TEST ONLY)   FW015550
#FW03Q2SCF&CG1 EQU  X'20'          SUPR COMPN FARES FROM NLX DSP G10G07 FW015560
#FW03Q2NAF&CG1 EQU  X'10'          IF ON,NAFQ DEFAULT TO BASE FARES .   FW015570
#FW03Q2KRR&CG1 EQU X'08'        FULLY STRUCTURED RULES RESPONSE  TK4629 GF018500
#FW03Q2NFT&CG1 EQU X'04'  FULLY STRUCTURED TARIF DISPLAY RESPONSETK4629 GF018500
#FW03Q2PRF&CG1 EQU X'02'  PREFERENCE DATA REQUIRED (FOR CUSTOMER TK4629 GF018500
*                                DATA STORE)                     TK4629 GF018500
#FW03Q2NET&CG1 EQU X'01'  NET FARES ONLY :C                      TK4629 GF018500
*********************************************************************** FW015580
*  END OF DEFINITIONS FOR FD ENTRIES                                  * FW015590
*********************************************************************** FW015600
*                                                                       FW015610
*********************************************************************** FW015620
*  START OF DEFINITIONS FOR àB..., FQ..., AND àQ... ENTRIES SV2     G03 FW015630
*********************************************************************** FW015640
*                                                                       FW015650
*              B'0 1 2 3 4 5 6 7'                                       FW015660
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW015670
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW015680
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW015690
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW015700
*                ¦ ¦ ¦ ¦ SPARE                                          FW015710
*                ¦ ¦ ¦ SPARE                                            FW015720
*                ¦ ¦ REQUEST HISTORICAL FARE QUOTE                 AG09 FW015730
*                ¦ SOME (BUT NOT ALL) FLIGHTS ON CA TAX EXEMPT AIRC G03 FW015740
*                ALL FLIGHTS ON CANADIAN TAX EXEMPT AIRCRAFT        G03 FW015750
*                                                                       FW015760
#FW03QGCAEX&CG1 EQU X'80'          ALL FLIGHTS CANADIAN TAX EXEMPT  G03 FW015770
#FW03QGCAMX&CG1 EQU X'40'          SOME FLIGHTS CANADIAN TAX EXEMPT G03 FW015780
#FW03QGCHST&CG1 EQU X'20'          REQUEST HISTORICAL FARE QUOTE   AG09 FW015790
*                                                                       FW015800
*********************************************************************** FW015810
*  END OF DEFINITIONS FOR àB..., FQ..., AND àQ ENTRIES SV2          G03 FW015820
*********************************************************************** FW015830
*                                                                       FW015840
*********************************************************************** FW015850
*  START OF DEFINITIONS FOR FQP ENTRIES SV2                             FW015860
*********************************************************************** FW015870
*                                                                       FW015880
*              B'0 1 2 3 4 5 6 7'                                       FW015890
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW015900
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW015910
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW015920
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW015930
*                ¦ ¦ ¦ ¦ SPARE                                          FW015940
*                ¦ ¦ ¦ SYSTEM GENERATED DATES USED                  G03 FW015950
*                ¦ ¦ @SPCLS ENTERED                                     FW015960
*                ¦ @APEXS ENTERED                                       FW015970
*                @NORMS ENTERED                                         FW015980
*                                                                       FW015990
#FW03FNORM&CG1 EQU X'80'           @NORMS ENTERED                       FW016000
#FW03FAPEX&CG1 EQU X'40'           @APEXS ENTERED                       FW016010
#FW03FSPCL&CG1 EQU X'20'           @SPCLS ENTERED                       FW016020
#FW03FSDAT&CG1 EQU X'10'           SYSTEM GENERATED DATES USED      G03 FW016030
*********************************************************************** FW016040
*  END OF DEFINITIONS FOR FQP ENTRIES SV2                             * FW016050
*********************************************************************** FW016060
*                                                                       FW016070
*G10******************************************************************* FW016080
*G10*  START OF DEFINITIONS FOR FZ CURRENCY CONVERSION ENTRIES SV2    * FW016090
*G10******************************************************************* FW016100
*G10*                                                                   FW016110
*G10*              B'0 1 2 3 4 5 6 7'                                   FW016120
*G10*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                    FW016130
*G10*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                FW016140
*G10*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                  FW016150
*G10*                ¦ ¦ ¦ ¦ ¦ SPARE                                    FW016160
*G10*                ¦ ¦ ¦ ¦ SPARE                                      FW016170
*G10*                ¦ ¦ ¦ IATA RATES                                   FW016180
*G10*                ¦ ¦ IATA CLEARING HOUSE RATES                      FW016190
*G10*                ¦ SELLING RATES   /BOTH BUYING AND SELLING         FW016200
*G10*                BUYING RATES      \INDICATORS MAY BE SET ON.       FW016210
*G10*                                                                   FW016220
*G10#FW03QFBUY&CG1 EQU  X'80'          BUYING RATE TABLE                FW016230
*G10#FW03QFSLL&CG1 EQU  X'40'          SELLING RATE TABLE               FW016240
*G10#FW03QFBYS&CG1 EQU  #FW03QFBUY&CG1+#FW03QFSLL&CG1 BUYING, SELLING   FW016250
*G10*                                                RATE TABLE         FW016260
*G10#FW03FITC&CG1  EQU  X'20'          IATA CLEARING HOUSE RATE TABLE   FW016270
*G10#FW03QFITA&CG1 EQU  X'10'          IATA RATE TABLE                  FW016280
*G10*                                                                   FW016290
*G10******************************************************************* FW016300
*G10*  END OF DEFINITIONS FOR FZ CURRENCY CONVERSION ENTRIES SV2      * FW016310
*G10******************************************************************* FW016320
*G10*                                                                   FW016330
FW03EQH&CG1 EQU *         END OF DATA ID 'QH'                           FW016340
*********************************************************************** FW016350
** END OF QUERY HEADER SECTION                                       ** FW016360
*********************************************************************** FW016370
          EJECT                                                         FW016380
*********************************************************************** FW016390
*********************************************************************** FW016400
**                                                                   ** FW016410
** SECTION INFORMATION:                                              ** FW016420
**                                                                   ** FW016430
** TYPE:        QUERY                                                ** FW016440
** NAME:        $D / FARE DISPLAY                                    ** FW016450
** IDENTIFIER:  2                                                    ** FW016460
**                                                                   ** FW016470
** PRIME KEY:   X'38'                                                ** FW016480
** ITEM ID:     FD                                                   ** FW016490
** UNIQUE KEY:  X'0000'                                              ** FW016500
**                                                                   ** FW016510
** PURPOSE:     DATA FIELDS FOR $D / FARE DISPLAY                    ** FW016520
**                                                                   ** FW016530
*********************************************************************** FW016540
*********************************************************************** FW016550
          ORG  FW03USR&CG1                                              FW016560
*                                                                       FW016570
*                                                                       FW016580
* THE FOLLOWING TWO FIELDS ARE REQUIRED                                 FW016590
*                                                                       FW016600
FW03Q2BDC&CG1  DS   CL3            BOARD CITY                           FW016610
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW016620
FW03Q2OFC&CG1  DS   CL3            OFF CITY                             FW016630
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW016640
*                                                                       FW016650
*********************************************************************** FW016660
*  OPTIONAL FIELDS FOR TARIFF DISPLAY ($D) - THEY ARE FOLLOWED BY     * FW016670
*  SYSTEM DEFAULTS AS APPROPRIATE AS WELL AS AN INDICATION IF THEY    * FW016680
*  APPLY ONLY TO FQS  OR IFQ.                                         * FW016690
*********************************************************************** FW016700
*                                                                       FW016710
FW03Q2DI1&CG1 DS    X              TARIFF DISPLAY INDICATORS            FW016720
*              B'0 1 2 3 4 5 6 7'                                       FW016730
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW016740
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ BASE FARES REQUEST                       FW016750
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦   IFQ DEFAULTS TO THIS                   FW016760
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦   FQS  DEFAULTS TO BASE+TAXES            FW016770
*                ¦ ¦ ¦ ¦ ¦ ¦ WITH RULES REQUEST                         FW016780
*                ¦ ¦ ¦ ¦ ¦ ¦   FQS  ONLY - IGNORED BY IFQ               FW016790
*                ¦ ¦ ¦ ¦ ¦ FARES WITHOUT PENALTY REQUEST                FW016800
*                ¦ ¦ ¦ ¦ ¦   FQS  ONLY - ERR MSG FROM IFQ               FW016810
*                ¦ ¦ ¦ ¦ NUC VALUES REQUEST                             FW016820
*                ¦ ¦ ¦ ¦   IFQ ONLY - ERR MSG FROM FQS                  FW016830
*                ¦ ¦ ¦ VALIDATING DISPLAY REQUEST                       FW016840
*                ¦ ¦ ¦   FQS  ONLY - ERR MSG FROM IFQ                   FW016850
*                ¦ ¦ LONG DISPLAY REQUEST                               FW016860
*                ¦ ROUND TRIP FARES REQUEST                             FW016870
*                ONE WAY FARES REQUEST                                  FW016880
*                                                                       FW016890
#FW03Q2OW&CG1 EQU  X'80'           ONE WAY FARES REQUEST                FW016900
#FW03Q2RT&CG1 EQU  X'40'           ROUND TRIP FARES REQUEST             FW016910
#FW03Q2LG&CG1 EQU  X'20'           LONG DISPLAY REQUEST                 FW016920
#FW03Q2VD&CG1 EQU  X'10'           VALIDATING DISPLAY REQUEST           FW016930
#FW03Q2NU&CG1 EQU  X'08'           NUC VALUES REQUEST                   FW016940
#FW03Q2PE&CG1 EQU  X'04'           FARES WITHOUT PENALTY REQUEST        FW016950
#FW03Q2WR&CG1 EQU  X'02'           WITH RULES REQUEST                   FW016960
#FW03Q2BS&CG1 EQU  X'01'           BASE FARES REQUEST                   FW016970
*                                                                       FW016980
FW03Q2DI2&CG1 DS    X              TARIFF DISPLAY INDICATORS            FW016990
*              B'0 1 2 3 4 5 6 7'                                       FW017000
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW017010
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW017020
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW017030
*                ¦ ¦ ¦ ¦ ¦ SURCHARGES APPLY              TK4629         FW017040
*                ¦ ¦ ¦ ¦ FW03Q2HLF HALF ROUND TRIP MODIFIER         06  FW017050
*                ¦ ¦ ¦ FW03Q2FCL = FARE TYPE (FQS  ONLY)                FW017060
*                ¦ ¦ CONVERT ADVANCE PURCHASE COLUMN                    FW017070
*                ¦ INCLUDE DOMESTIC TAX REQUEST                         FW017080
*                CONNECTION CITIES DISPLAY REQUEST                      FW017090
*                                                                       FW017100
#FW03Q2CX&CG1   EQU  X'80'         CONNECTION CITIES DISPLAY REQUEST    FW017110
#FW03Q2DTX&CG1  EQU  X'40'         INCLUDE DOMESTIC TAX REQUEST         FW017120
#FW03Q2DAP&CG1  EQU  X'20'         CONVERT ADVANCE PURCHASE COLUMN      FW017130
#FW03Q2FTP&CG1  EQU  X'10'         FW03Q2FCL = FQS  BOOKING CODE        FW017140
#FW03Q2HLF&CG1  EQU  X'08'         HALF ROUND TRIP MODIFIER         06  FW017150
*                                                                       FW017160
FW03Q2DOT&CG1  DS   XL2            PARS DATE OF TRAVEL                  FW017170
*                                    DEFAULTS TO SYSTEM DATE            FW017180
FW03Q2CAR&CG1  DS   CL2            CARRIER CODE 1 FOR USE IN DISPLAY    FW017190
               DS   C                RESERVED FOR CARRIER EXPANSION     FW017200
FW03Q2CA2&CG1  DS   CL2            CARRIER CODE 2 FOR USE IN DISPLAY    FW017210
               DS   C                RESERVED FOR CARRIER EXPANSION     FW017220
FW03Q2CA3&CG1  DS   CL2            CARRIER CODE 3 FOR USE IN DISPLAY    FW017230
               DS   C                RESERVED FOR CARRIER EXPANSION     FW017240
FW03Q2GDI&CG1  DS   CL2            GLOBAL DIRECTION REQUESTED           FW017250
*                                    IFQ ONLY - IGNORED BY FQS          FW017260
FW03Q2CX1&CG1  DS   CL3            CONNECTION CITY 1                    FW017270
               DS   C                RESERVED FOR CITY CODE EXPANSION   FW017280
*                                    FQS  - ERR MSG FROM IFQ            FW017290
FW03Q2CX2&CG1  DS   CL3            CONNECTION CITY 2                    FW017300
               DS   C                RESERVED FOR CITY CODE EXPANSION   FW017310
*                                    FQS  - ERR MSG FROM IFQ            FW017320
FW03Q2DOR&CG1  DS   XL2            PARS DTE OF RETURN/VALIDATING DISP   FW017330
*                                    FQS  ONLY - ERR MSG FROM IFQ       FW017340
FW03Q2DTT&CG1  DS   XL2            PARS FUTURE TICKETING DATE           FW017350
*                                    DEFAULTS TO SYSTEM DATE            FW017360
*                                    IFQ ONLY - ERR MSG FROM FQS        FW017370
*                                                                       FW017380
FW03Q2FCL&CG1 DS    CL8            FARE TYPE/CLASS IDENTIFIER           FW017390
*                                    FQS  - FARE BASIS CODE ONLY        FW017400
*                                          IF NO MATCHING FARE BASIS,   FW017410
*                                          DEFAULTS TO COMPLETE DISPLAY FW017420
*                                          EXCEPT FOR AGREED UPON       FW017430
*                                          EQUATES                      FW017440
*                                    IFQ - P, F, J, C, Y, APEX, NORMS,  FW017450
*                                          SPCLS, IATA, FARE BASIS      FW017460
*                                          CODE ALL APPLY               FW017470
*                                                                       FW017480
FW03Q2CUR&CG1  DS   CL3            CURRENCY CODE FOR DISPLAY            FW017490
FW03Q2CTY&CG1  DS   CL3            CITY CODE FOR CURRENCY CONVERSION    FW017500
               DS   C                RESERVED FOR CITY CODE EXPANSION   FW017510
FW03Q2SCR&CG1  DS   CL3            SELLING CURRENCY OVERRIDE         04 FW017520
FW03Q2FTY&CG1  DS   X              FARE TYPE INDICATORS              04 FW017530
*              B'0 1 2 3 4 5 6 7'                                    04 FW017540
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                     04 FW017550
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                 04 FW017560
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                   04 FW017570
*                ¦ ¦ ¦ ¦ ¦ SPARE                                     04 FW017580
*                ¦ ¦ ¦ ¦ SPARE                                       04 FW017590
*                ¦ ¦ ¦ SPARE                                         04 FW017600
*                ¦ ¦ CIRCLE TRIP/TRIANGLE FARES                      04 FW017610
*                ¦ ROUND THE WORLD FARES                             04 FW017620
*                JOINT FARES REQUEST                                 04 FW017630
*                                                                    04 FW017640
#FW03Q2JNT&CG1 EQU  X'80'          JOINT FARES REQUEST               04 FW017650
#FW03Q2RWF&CG1 EQU  X'40'          ROUND THE WORLD FARES             04 FW017660
#FW03Q2CTF&CG1 EQU  X'20'          CIRCLE TRIP/TRIANGLE FARES        04 FW017670
#FW03Q2SUR&CG1  EQU  X'04'         SURCHARGES APPLY            TK4629   FW017150
*                                                                       FW017680
*********************************************************************** FW017690
** END OF QUERY $D / FARE DISPLAY DATA FIELDS SECTION                ** FW017700
*********************************************************************** FW017710
FW03EFD&CG1  EQU  *                END OF $D / FARE DISPLAY SECTION     FW017720
          EJECT                                                         FW017730
*********************************************************************** FW017740
*********************************************************************** FW017750
**                                                                   ** FW017760
** SECTION INFORMATION:                                              ** FW017770
**                                                                   ** FW017780
** TYPE:        QUERY                                                ** FW017790
** NAME:        AGENT INPUT MESSAGE                                  ** FW017800
** IDENTIFIER:  3                                                    ** FW017810
**                                                                   ** FW017820
** PRIME KEY:   X'38'                                                ** FW017830
** ITEM ID:     IM                                                   ** FW017840
** UNIQUE KEY:  X'0000'                                              ** FW017850
**                                                                   ** FW017860
** PURPOSE:     IF PRESENT, THE INPUT MESSAGE AREA WILL START HERE   ** FW017870
**              AND CONTINUE UNTIL AN EOM IS REACHED.  THE INPUT     ** FW017880
**              MESSAGE STARTS AFTER THE APOLLO ACTION CODE.         ** FW017890
**              FOR EXAMPLE:                                         ** FW017900
**                    AGENT INPUT - FZSJYE350000USD                  ** FW017910
**                    GFI BLOCK   - SJYE350000USD+                   ** FW017920
**                    WITH AN ACTION CODE NUMBER OF 25               ** FW017930
*********************************************************************** FW017940
*********************************************************************** FW017950
          ORG  FW03USR&CG1                                              FW017960
*                                                                       FW017970
FW03Q3IMG&CG1  DS  C               START OF INPUT MESSAGE               FW017980
*********************************************************************** FW017990
** END OF AGENT INPUT MESSAGE SECTION                                ** FW018000
*********************************************************************** FW018010
FW03EIM&CG1  EQU  *                END OF INPUT MESSAGE SECTION         FW018020
          EJECT                                                         FW018030
*********************************************************************** FW018040
*********************************************************************** FW018050
**                                                                   ** FW018060
** SECTION INFORMATION:                                              ** FW018070
**                                                                   ** FW018080
** TYPE:        QUERY                                                ** FW018090
** NAME:        AGENT INPUT NUMBER                                   ** FW018100
** IDENTIFIER:  4                                                    ** FW018110
**                                                                   ** FW018120
** PRIME KEY:   X'38'                                                ** FW018130
** ITEM ID:     NB                                                   ** FW018140
** UNIQUE KEY:  X'0000'                                              ** FW018150
**                                                                   ** FW018160
** PURPOSE:     IF PRESENT, NUMBER INPUT BY AGENT, USUALLY DEPICTING ** FW018170
**              LINE NUMBER OR QUOTE NUMBER, DEPENDING UPON FOLLOW-  ** FW018180
**              UP ACTION CODE.                                      ** FW018190
**                                                                   ** FW018200
**                    AGENT INPUT - FD3                              ** FW018210
**                    GFI BLOCK   - X'0003'                          ** FW018220
**                    WITH AN ACTION CODE NUMBER OF 30               ** FW018230
**                                                                   ** FW018240
*********************************************************************** FW018250
*********************************************************************** FW018260
          ORG  FW03USR&CG1                                              FW018270
*                                                                       FW018280
FW03Q4NBR&CG1  DS   XL2            INPUT NUMBER                         FW018290
*********************************************************************** FW018300
** END OF AGENT INPUT MESSAGE SECTION                                ** FW018310
*********************************************************************** FW018320
FW03ENB&CG1  EQU  *                END OF INPUT NUMBER SECTION          FW018330
          EJECT                                                         FW018340
*********************************************************************** FW018350
*********************************************************************** FW018360
**                                                                   ** FW018370
** SECTION INFORMATION:                                              ** FW018380
**                                                                   ** FW018390
** TYPE:        QUERY                                                ** FW018400
** NAME:        AUXILIARY MILEAGE / LEG MILEAGE ENTRIES              ** FW018410
** IDENTIFIER:  5                                                    ** FW018420
**                                                                   ** FW018430
** PRIME KEY:   X'38'                                                ** FW018440
** ITEM ID:     MQ                                                   ** FW018450
** UNIQUE KEY:  X'0000'                                              ** FW018460
**                                                                   ** FW018470
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INPUT FOR LEG MILEAGE ** FW018480
**              AND SURCHARGE BAND DISPLAYS.  MILEAGE DISPLAYS WHICH ** FW018490
**              ARE ONLY SENDING A LINE NUMBER, E.G. $LM4, SHOULD    ** FW018500
**              USE SECTION GQ4 FOR INPUT OF THE LINE NUMBER.  IF    ** FW018510
**              SECTION IS USED, THEN SECTION GQ4 SHOULD NOT BE USED.** FW018520
**              IF A SURFACE SECTOR IS TO BE INDICATED, THEN LEAVE   ** FW018530
**              A X'00' CITY CODE WHERE SURFACE SECTOR IS DESIRED.   ** FW018540
**                                                                   ** FW018550
*********************************************************************** FW018560
*********************************************************************** FW018570
          ORG  FW03USR&CG1                                              FW018580
FW03Q5LMI&CG1  DS   X               DISPLAY TYPE                        FW018590
*              B'0 1 2 3 4 5 6 7'                                       FW018600
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW018610
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW018620
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW018630
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW018640
*                ¦ ¦ ¦ ¦ SPARE                                          FW018650
*                ¦ ¦ ¦ SPARE                                            FW018660
*                ¦ ¦ TPM MILEAGE                                        FW018670
*                ¦ MILEAGE AUXILIARY                                    FW018680
*                SURCHARGE BAND                                         FW018690
*                                                                       FW018700
#FW03Q5FM&CG1   EQU  X'80'         FM SURCHARGE BAND DISPLAY            FW018710
#FW03Q5AUX&CG1  EQU  X'40'         FL / MILEAGE AUXILIARY               FW018720
#FW03Q5TPM&CG1  EQU  X'20'         FL TPM MILEAGE                       FW018730
*                                                                       FW018740
*         IF NEITHER BIT IS ON, THEN DEFAULT IS FL DISPLAY              FW018750
*                                                                       FW018760
FW03Q5CAR&CG1  DS   CL2            CARRIER CODE FOR MILEAGE EXCEPTIONS  FW018770
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW018780
FW03Q5GDD&CG1  DS   CL2            GLOBAL DIRECTION                     FW018790
FW03Q5DAY&CG1  DS   XL2            TICKET DATE REQUESTED                FW018800
FW03Q5TRV&CG1  DS   XL2            TRAVEL DATE REQUESTED                FW018810
FW03Q5CCD&CG1  DS   CL3            CURRENCY CODE                        FW018820
FW03Q5AMT&CG1  DS   CL8            CURRENCY AMOUNT                      FW018830
FW03Q5MIL&CG1  DS   XL2            MILEAGE AMOUNT                       FW018840
FW03Q5NCT&CG1  DS   X              NUMBER OF CITIES TO FOLLOW           FW018850
*                                    LEG MILEAGE                        FW018860
*                                    MIN = 2, MAX = 33                  FW018870
*                                    SURCHARGE BANDS                    FW018880
*                                    IF CITIES ENTERED, MANDATORY = 2   FW018890
FW03Q5CIT&CG1  DS   0CL4             4 BYTE CITY CODE                   FW018900
FW03Q5CTY&CG1  DS   CL3              FIRST CITY 3 BYTE CITY CODE        FW018910
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW018920
*                                  POSSIBLE FOR 28 MORE CITY CODES      FW018930
*                                  PLUS 13 GAPS FOR A TOTAL OF 42 ITEMS FW018940
*********************************************************************** FW018950
** END OF MILEAGE SECTION                                            ** FW018960
*********************************************************************** FW018970
FW03EMQ&CG1  EQU  *                END OF MILEAGE SECTION               FW018980
*                                                                       FW018990
*********************************************************************** FW019000
*********************************************************************** FW019010
**                                                                   ** FW019020
** SECTION INFORMATION:                                              ** FW019030
**                                                                   ** FW019040
** TYPE:        QUERY                                                ** FW019050
** NAME:        RULES DISPLAY (àV:) FOLLOWING FQS FARE QUOTE         ** FW019060
** IDENTIFIER:  8                                                    ** FW019070
**                                                                   ** FW019080
** PRIME KEY:   X'38'                                                ** FW019090
** ITEM ID:     RF                                                   ** FW019100
** UNIQUE KEY:  X'0000'                                              ** FW019110
**                                                                   ** FW019120
** PURPOSE:     THIS SECTION IS USED TO REQUEST RULES TEXT DISPLAY   ** FW019130
**              FOLLOWING AN FQS ONLY (PURELY NORTH AMERICAN) FARE   ** FW019140
**              QUOTE.  ALL FIELDS ARE OPTIONAL.  IF NO FIELDS ARE   ** FW019150
**              ENTERED BY THE AGENT, THEN THIS SECTION IS NOT       ** FW019160
**              REQUIRED.  THIS ENTRY LETS THE AGENT DISPLAY FQS     ** FW019170
**              RULES BY SEGMENT, PIC, AND PARAGRAPH. THE VARIABLE   ** FW019180
**              PARAGRAPH DATA IS VARIABLE IN LENGTH AND MUST END    ** FW019190
**              IN EITHER '.' OR #EOM.                               ** FW019200
**                                                                   ** FW019210
**              THE RESPONSE IS RETURNED AS OM TYPE DATA.            ** FW019220
**                                                                   ** FW019230
*********************************************************************** FW019240
*********************************************************************** FW019250
          ORG  FW03USR&CG1                                              FW019260
FW03Q8SEG&CG1  DS   X              SEGMENT NUMBER REQUESTED             FW019270
FW03Q8IN2&CG1  DS   X              RULE INDICATORS                      FW019280
*                                                                       FW019290
*  THESE INDICATORS ARE USED CONSISTENTLY BETWEEN FOLLOWUP RULES,       FW019300
*  DIRECT RULES, AND FLIGHT TYPE TABLES DISPLAYS.  BITS 0-3 ARE CON-    FW019310
*  SISTENT AND BITS 4-7 ARE ENTRY SPECIFIC.  THE EQUATES HAVE BEEN      FW019320
*  DEFINED HERE FOR GENERAL AND SPECIFICALLY WITH EACH ENTRY.           FW019330
*                                                                       FW019340
*              B'0 1 2 3 4 5 6 7'                                       FW019350
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW019360
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW019370
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW019380
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW019390
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW019400
*                ¦ ¦ ¦ FRENCH RULES TEXT MODIFIER - NOT USED YET        FW019410
*                ¦ ¦ SUMMARY RULE DISPLAY REQUESTED                     FW019420
*                ¦ ALL PARAGRAPHS REQUESTED                             FW019430
*                REVERSE DISPLAY REQUESTED - NOT USED YET               FW019440
*                                                                       FW019450
#FW03Q8REV&CG1 EQU  X'80'          REVERSE DISPLAY REQUEST - NOT USED   FW019460
#FW03Q8AAL&CG1 EQU  X'40'          ALL RULE PARAGRAPHS REQUESTED        FW019470
#FW03Q8SMM&CG1 EQU  X'20'          SUMMARY DISPLAY REQUESTED            FW019480
#FW03Q8FR2&CG1 EQU  X'10'          FRENCH RULES TEXT-NOT USED YET       FW019490
*                                                                       FW019500
FW03Q8VR2&CG1  EQU  *              VARIABLE PARAGRAPH DATA START        FW019510
*                                  (ENDS WITH C'.' OR #EOM)             FW019520
*********************************************************************** FW019530
** END OF FQS àV: RULES DISPLAY SECTION                              ** FW019540
*********************************************************************** FW019550
FW03ERF&CG1  EQU  *                END OF FQS àV: RULES DISPLAY SECTION FW019560
          EJECT                                                         FW019570
*********************************************************************** FW019580
*********************************************************************** FW019590
**                                                                   ** FW019600
** SECTION INFORMATION:                                              ** FW019610
**                                                                   ** FW019620
** TYPE:        QUERY                                                ** FW019630
** NAME:        DIRECT RULES DISPLAY FROM FQS                        ** FW019640
** IDENTIFIER:  9                                                    ** FW019650
**                                                                   ** FW019660
** PRIME KEY:   X'38'                                                ** FW019670
** ITEM ID:     RL                                                   ** FW019680
** UNIQUE KEY:  X'0000'                                              ** FW019690
**                                                                   ** FW019700
** PURPOSE:     THIS SECTION IS USED TO REQUEST RULES TEXT DISPLAY   ** FW019710
**              FROM FQS ONLY.  A LONG RULES DISPLAY ENTRY DOES NOT  ** FW019720
**              YET EXIST FOR IFQ.  ALL FIELDS ARE OPTIONAL. THIS    ** FW019730
**              ENTRY LETS THE AGENT DISPLAY FQS RULES BY CITY PAIR, ** FW019740
**              DATE, CARRIER, AND FARE BASIS.                       ** FW019750
**                                                                   ** FW019760
**              THE RESPONSE IS RETURNED AS OM TYPE DATA.            ** FW019770
**                                                                   ** FW019780
*********************************************************************** FW019790
*********************************************************************** FW019800
          ORG  FW03USR&CG1                                              FW019810
FW03Q9BRD&CG1  DS   CL3            BOARD CITY                           FW019820
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW019830
FW03Q9OFF&CG1  DS   CL3            OFF CITY                             FW019840
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW019850
FW03Q9DAT&CG1  DS   XL2            DATE                                 FW019860
FW03Q9FAR&CG1  DS   CL8            FARE BASIS CODE                      FW019870
FW03Q9CAR&CG1  DS   CL2            CARRIER                              FW019880
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW019890
FW03Q9JTC&CG1  DS   CL2            JOINT CARRIER                        FW019900
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW019910
FW03Q9IN1&CG1  DS   X              RULE INDICATORS                      FW019920
*                                                                       FW019930
*              B'0 1 2 3 4 5 6 7'                                       FW019940
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW019950
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW019960
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW019970
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW019980
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW019990
*                ¦ ¦ ¦ FRENCH RULES TEXT MODIFIER - NOT USED YET        FW020000
*                ¦ ¦ SUMMARY RULE DISPLAY REQUESTED                     FW020010
*                ¦ ALL PARAGRAPHS REQUESTED                             FW020020
*                REVERSE DISPLAY REQUESTED                              FW020030
*                                                                       FW020040
#FW03Q9REV&CG1 EQU  X'80'          REVERSE DISPLAY REQUEST              FW020050
#FW03Q9AAL&CG1 EQU  X'40'          ALL RULE PARAGRAPHS REQUESTED        FW020060
#FW03Q9SMM&CG1 EQU  X'20'          SUMMARY DISPLAY REQUESTED            FW020070
#FW03Q9FR2&CG1 EQU  X'10'          FRENCH RULES TEXT-NOT USED YET       FW020080
*                                                                       FW020090
FW03Q9VR1&CG1  EQU  *              VARIABLE PARAGRAPH DATA START        FW020100
*                                  (ENDS WITH C'.' OR #EOM)             FW020110
*********************************************************************** FW020120
** END OF FQS LONG RULES DISPLAY SECTION                             ** FW020130
*********************************************************************** FW020140
FW03ERL&CG1  EQU  *                END OF FQS LONG RULES ENTRY SECTION  FW020150
          EJECT                                                         FW020160
*********************************************************************** FW020170
*********************************************************************** FW020180
**                                                                   ** FW020190
** SECTION INFORMATION:                                              ** FW020200
**                                                                   ** FW020210
** TYPE:        QUERY                                                ** FW020220
** NAME:        RULES DISPLAY FROM FARE DISPLAY                      ** FW020230
** IDENTIFIER:  A                                                    ** FW020240
**                                                                   ** FW020250
** PRIME KEY:   X'38'                                                ** FW020260
** ITEM ID:     RD                                                   ** FW020270
** UNIQUE KEY:  X'0000'                                              ** FW020280
**                                                                   ** FW020290
** PURPOSE:     THIS SECTION IS USED TO REQUEST RULES TEXT DISPLAY   ** FW020300
**              FOLLOWING A FARE DISPLAY.  THE ONLY REQUIRED FIELD   ** FW020310
**              IS LINE NUMBER.  ALL OTHER FIELDS ARE OPTIONAL.      ** FW020320
**              IF THE LINE NUMBER IS ZERO, THEN THE FREEFORM        ** FW020330
**              SECTION INDICATES THE ADDITIONAL RULE PARAS TO       ** FW020340
**              OUTPUT FOR THE SAME FARE AS THE LAST RULES DISPLAY   ** FW020350
**              ENTRY.                                               ** FW020360
**                                                                   ** FW020370
**              THE RESPONSE IS RETURNED AS OM TYPE DATA.            ** FW020380
**                                                                   ** FW020390
*********************************************************************** FW020400
*********************************************************************** FW020410
          ORG  FW03USR&CG1                                              FW020420
FW03QANBR&CG1  DS   XL2            LINE NUMBER                          FW020430
FW03QASUM&CG1  DS   X              RULES INDICATORS                     FW020440
*              B'0 1 2 3 4 5 6 7'                                       FW020450
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW020460
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW020470
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW020480
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW020490
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW020500
*                ¦ ¦ ¦ FULL FARE RULES DISPLAY REQUESTED             05 FW020510
*                ¦ ¦ SUMMARY RULE DISPLAY REQUESTED                     FW020520
*                ¦ ALL PARAGRAPHS REQUESTED                             FW020530
*                AVAILABLE                                              FW020540
*                                                                       FW020550
#FW03QAALL&CG1 EQU  X'40'          ALL RULE PARAGRAPHS REQUESTED        FW020560
#FW03QAFNS&CG1 EQU  X'20'          SUMMARY RULE DISPLAY REQUESTED       FW020570
*                                                                       FW020580
FW03QACR1&CG1  DS   CL2            CARRIER 1 FOR RULES DISPLAY          FW020590
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW020600
FW03QACR2&CG1  DS   CL2            CARRIER 2 FOR RULES DISPLAY          FW020610
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW020620
*                                                                       FW020630
*  THE FREEFORM SECTION CAN CONTAIN PARGRAPH NUMBERS OR PARAGRAPH       FW020640
*  HEADINGS ONLY.  APOLLO WILL EDIT FOR '.' AND '-'.  ALL OTHER         FW020650
*  REQUESTOR-SPECIFIC INFORMATION MUST BE REMOVED.                      FW020660
*                                                                       FW020670
*  THE FREEFORM SECTION CAN STAND ALONE OR BE USED IN CONJUNCTION       FW020680
*  WITH THE BIT SETTINGS ABOVE AND THE CARRIER CODE FIELDS.             FW020690
*                                                                       FW020700
FW03QARUL&CG1  EQU  *              FREEFORM RULE PARAGRAPH NUMBERS      FW020710
*                                  REQUESTED                            FW020720
*                                  EX:  3.4                             FW020730
*                                  EX:  3-4.7                           FW020740
*                                  EX:  MIN.MAX                         FW020750
*                                  (ENDS WITH #EOM)                     FW020760
*********************************************************************** FW020770
** END OF RULES DISPLAY FROM FARE DISPLAY SECTION                    ** FW020780
*********************************************************************** FW020790
FW03ERD&CG1  EQU  *                END OF RULES DISPLAY SECTION         FW020800
          EJECT                                                         FW020810
*********************************************************************** FW020820
*********************************************************************** FW020830
**                                                                   ** FW020840
** SECTION INFORMATION:                                              ** FW020850
**                                                                   ** FW020860
** TYPE:        QUERY                                                ** FW020870
** NAME:        BOOKING CODE DETAIL DISPLAY SECTION                  ** FW020880
** IDENTIFIER:  B                                                    ** FW020890
**                                                                   ** FW020900
** PRIME KEY:   X'38'                                                ** FW020910
** ITEM ID:     LB                                                   ** FW020920
** UNIQUE KEY:  X'0000'                                              ** FW020930
**                                                                   ** FW020940
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INFORMATION FOR THE   ** FW020950
**              FDC BOOKING CODE DETAIL DISPLAY.  THE RESPONSE IS    ** FW020960
**              RETURNED IN AN OM BLOCK FORMAT.                      ** FW020970
**                                                                   ** FW020980
*********************************************************************** FW020990
*********************************************************************** FW021000
          ORG  FW03USR&CG1                                              FW021010
FW03QBNBR&CG1  DS   XL2            LINE NUMBER - MANDATORY              FW021020
FW03QBAIR&CG1  DS   CL2            CARRIER     - OPTIONAL               FW021030
*              DS   C              RESERVED FOR CARRIER EXPANSION    03 FW021040
*                                  EXTRA BYTE MEANS MISMATCH WITH 1G 03 FW021050
FW03QBAIR2&CG1 DS   CL2            SECONDARY CARRIER - OPTIONAL      03 FW021060
               DS   C              RESERVED FOR CARRIER EXPANSION    03 FW021070
FW03QBIND&CG1  DS   X              INDICATOR BYTE                    03 FW021080
*              B'0 1 2 3 4 5 6 7'                                    03 FW021090
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW021100
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW021110
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW021120
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW021130
*                ¦ ¦ ¦ ¦ SPARE                                          FW021140
*                ¦ ¦ ¦ SPARE                                            FW021150
*                ¦ ¦ SPARE                                              FW021160
*                ¦ SPARE                                                FW021170
*                GIBA DATA REQUEST INDICATOR                         03 FW021180
*                                                                       FW021190
#FW03QBGIB&CG1 EQU X'80'           INDICATE REQUEST FOR GIBA DATA    03 FW021200
*********************************************************************** FW021210
** END OF FDC SECTION                                                ** FW021220
*********************************************************************** FW021230
FW03ELB&CG1  EQU  *                END OF FDC SECTION                   FW021240
          EJECT                                                         FW021250
*********************************************************************** FW021260
*********************************************************************** FW021270
**                                                                   ** FW021280
** SECTION INFORMATION:                                              ** FW021290
**                                                                   ** FW021300
** TYPE:        QUERY                                                ** FW021310
** NAME:        FLIGHT TYPE TABLE DISPLAY                            ** FW021320
** IDENTIFIER:  C                                                    ** FW021330
**                                                                   ** FW021340
** PRIME KEY:   X'38'                                                ** FW021350
** ITEM ID:     FE                                                   ** FW021360
** UNIQUE KEY:  X'0000'                                              ** FW021370
**                                                                   ** FW021380
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INFORMATION FOR THE   ** FW021390
**              FE FLIGHT TYPE TABLE DISPLAY.  THIS ENTRY CAN BE     ** FW021400
**              A FOLLOWUP TO FARE DISPLAY OR A STAND ALONE ENTRY.   ** FW021410
**                                                                   ** FW021420
*********************************************************************** FW021430
*********************************************************************** FW021440
          ORG  FW03USR&CG1                                              FW021450
FW03QCNBR&CG1  DS   XL2            LINE NUMBER (FOLLOWUP FARE DISPLAY)  FW021460
*                                  IF GQCNBR IS 0, THEN NOT FOLLOWUP    FW021470
*                                                                       FW021480
FW03QCFEI&CG1  DS   X              DISPLAY OPTION INDICATORS            FW021490
*                                                                       FW021500
*              B'0 1 2 3 4 5 6 7'                                       FW021510
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW021520
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW021530
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW021540
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW021550
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW021560
*                ¦ ¦ ¦ AVAILABLE                                        FW021570
*                ¦ ¦ AVAILABLE                                          FW021580
*                ¦ AVAILABLE                                            FW021590
*                REVERSE DISPLAY REQUESTED                              FW021600
*                                                                       FW021610
#FW03QCREV&CG1 EQU  X'80'          FE REVERSE DISPLAY OPTION            FW021620
*                                                                       FW021630
FW03QCCT1&CG1  DS   CL3            CITY 1                               FW021640
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW021650
FW03QCCT2&CG1  DS   CL3            CITY 2                               FW021660
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW021670
FW03QCDAT&CG1  DS   XL2            DATE FOR FLIGHT TYPE TABLE           FW021680
*                                    DEFAULTS TO FARE DISPLAY DATE      FW021690
*                                    IF FOLLOWUP ENTRY.  DEFAULTS TO    FW021700
*                                    SYSTEM DATE OTHERWISE.             FW021710
FW03QCCXX&CG1  DS   CL2            CARRIER CODE                         FW021720
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW021730
FW03QCFLT&CG1  DS   CL4            FLIGHT NUMBER                        FW021740
FW03QCFAR&CG1  DS   CL8            FARE TYPE REQUESTED                  FW021750
*********************************************************************** FW021760
** END OF FLIGHT TYPE TABLE DISPLAY                                  ** FW021770
*********************************************************************** FW021780
FW03EFE&CG1  EQU  *                END OF FE SECTION                    FW021790
         EJECT                                                          FW021800
*********************************************************************** FW021810
*********************************************************************** FW021820
**                                                                   ** FW021830
** SECTION INFORMATION:                                              ** FW021840
**                                                                   ** FW021850
** TYPE:        QUERY                                                ** FW021860
** NAME:        FOLLOWUP ENTRIES TO FARE QUOTE                       ** FW021870
** IDENTIFIER:  D                                                    ** FW021880
**                                                                   ** FW021890
** PRIME KEY:   X'38'                                                ** FW021900
** ITEM ID:     FU                                                   ** FW021910
** UNIQUE KEY:  X'0000'                                              ** FW021920
**                                                                   ** FW021930
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INFORMATION FOR       ** FW021940
**              FOLLOWUP ENTRIES TO FARE QUOTE.                      ** FW021950
**                                                                   ** FW021960
**              FOLLOWING AN FQ ENTRY, DISPLAY FARE COMPONENTS       ** FW021970
**              (FQN), FI AND REDISPLAY LADDER WITH AMENDMENTS       ** FW021980
**              (FIB), FI AND REDISPLAY ORIGINAL LADDER (FIL),       ** FW021990
**              FI AND REDISPLAY LINEAR FARE QUOTE (FIR), DISPLAY    ** FW022000
**              BLANK LADDER (FQB), AND DISPLAY FARE CONSTRUCTION    ** FW022010
**              LADDER (FQL) ONLY NEED ACTION CODE NUMBERS IN THE    ** FW022020
**              "QH" SECTION.  THIS SECTION IS NOT NEEDED.           ** FW022030
**                                                                   ** FW022040
**              FOLLOWING AN FI TYPE ENTRY, FARE QUOTE ALTERNATES    ** FW022050
**              (FQA), FARE QUOTE NORMALS (FQY), AND FARE QUOTE (FQ) ** FW022060
**              ENTRIES ONLY NEED ACTION CODE NUMBERS.               ** FW022070
**                                                                   ** FW022080
**              FQN AND FQL ENTRIES MAY SPECIFY A QUOTE NUMBER TO    ** FW022090
**              DISPLAY.                                             ** FW022100
**                                                                   ** FW022110
**              FOLLOWING AN FQN ENTRY, FARE RULES (FN) AND/OR       ** FW022120
**              ROUTES (FR) MAY BE DISPLAYED.  THE COMPONENT NBR IS  ** FW022130
**              REQUIRED FOR BOTH, AND VARIABLE DATA (PARAGRAPH      ** FW022140
**              NUMBERS) FOLLOWS THE RULE COMPONENT NBR TO DISPLAY.  ** FW022150
**                                                                   ** FW022160
*********************************************************************** FW022170
*********************************************************************** FW022180
          ORG  FW03USR&CG1                                              FW022190
FW03QDQNO&CG1  DS   XL2            QUOTE NUMBER IF APPLICABLE AFTER FQA FW022200
*                                  ENTRY AND THERE IS MORE THAN ONE     FW022210
*                                  QUOTE - COMPONENT NUMBER AFTER FQN   FW022220
FW03QDSUM&CG1  DS   CL1            RULES INDICATORS                     FW022230
*                                                                       FW022240
*              B'0 1 2 3 4 5 6 7'                                       FW022250
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW022260
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW022270
*                ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                  FW022280
*                ¦ ¦ ¦ ¦ ¦ AVAILABLE                                    FW022290
*                ¦ ¦ ¦ ¦ AVAILABLE                                      FW022300
*                ¦ ¦ ¦ FULL FARE RULES DISPLAY REQUESTED             05 FW022310
*                ¦ ¦ AVAILABLE                                          FW022320
*                ¦ ALL PARAGRAPHS REQUESTED                             FW022330
*                AVAILABLE                                              FW022340
*                                                                       FW022350
#FW03QDALL&CG1 EQU  X'40'          ALL RULE PARAGRAPHS REQUESTED        FW022360
*                                                                       FW022370
FW03QDVAR&CG1  EQU  *              VARIABLE DATA - AS INPUT BY AGENT    FW022380
*                                  (PARAGRAPH NUMBERS - ENDS            FW022390
*                                  WITH EOM)                            FW022400
*                                  SEE RULES DISPLAY FOLLOWING FARE     FW022410
*                                  DISPLAY (SECTION ID:RD) FOR INFO     FW022420
*********************************************************************** FW022430
** END OF FOLLOWUP ENTRIES TO FARE QUOTE SECTION                     ** FW022440
*********************************************************************** FW022450
FW03EFU&CG1  EQU *                 END OF FOLLOWUPS FOR FARE QUOTE      FW022460
          EJECT                                                         FW022470
*********************************************************************** FW022480
*********************************************************************** FW022490
**                                                                   ** FW022500
** SECTION INFORMATION:                                              ** FW022510
**                                                                   ** FW022520
** TYPE:        QUERY                                                ** FW022530
** NAME:        CITY PAIR TEXT UPDATE AND DISPLAY                    ** FW022540
** IDENTIFIER:  E                                                    ** FW022550
**                                                                   ** FW022560
** PRIME KEY:   X'38'                                                ** FW022570
** ITEM ID:     CP                                                   ** FW022580
** UNIQUE KEY:  X'0000'                                              ** FW022590
**                                                                   ** FW022600
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INFORMATION FOR THE   ** FW022610
**              CITY PAIR TEXT (FC) ENTRIES.  IF THE INPUT IS NOT A  ** FW022620
**              MAINTENANCE ENTRY, THEN GQEACT IS SET TO X'00'.      ** FW022630
**              OTHERWISE GQEID1 WILL HAVE THE APPROPRIATE ACTION    ** FW022640
**              CODE.  THE CITY INFORMATION NEEDS TO BE LEFT         ** FW022650
**              JUSTIFIED BLANK FILLED.  THE ONLY REQUIRED FIELD IS  ** FW022660
**              THE ACTION CODE.  ALL OTHER FIELDS ARE OPTIONAL.     ** FW022670
**              THE RESPONSE IS RETURNED IN AN OM BLOCK FORMAT.      ** FW022680
**                                                                   ** FW022690
*********************************************************************** FW022700
*********************************************************************** FW022710
          ORG  FW03USR&CG1                                              FW022720
FW03QEACT&CG1  DS   X              UPDATE CITY TEXT ACTION              FW022730
#FW03QENOT&CG1 EQU  X'00'          NOT MAINTENANCE ENTRY                FW022740
#FW03QEIDX&CG1 EQU  X'01'          FC/ALL     (DISPLAY INDEX)           FW022750
#FW03QESEL&CG1 EQU  X'02'          FCNN       (SELECT ITEM)             FW022760
#FW03QELCK&CG1 EQU  X'03'          FC/LOCK    (LOCK INDEX)              FW022770
#FW03QEFRE&CG1 EQU  X'04'          FC/FREE    (FREE INDEX)              FW022780
#FW03QECHG&CG1 EQU  X'05'          FCNNN@*    (CHANGE LINE OF TEXT)     FW022790
#FW03QEDET&CG1 EQU  X'06'          FCNNN-NNN@ (DELETE LINES OF TEXT)    FW022800
#FW03QEINT&CG1 EQU  X'07'          FC/NNN*    (INSERT LINE OF TEXT)     FW022810
#FW03QEFIL&CG1 EQU  X'08'          FC@F       (FILE ITEM)               FW022820
#FW03QECPY&CG1 EQU  X'09'          FCCOPYNNNTONNN (COPY ITEM'S TEXT)    FW022830
#FW03QEDEI&CG1 EQU  X'0A'          FC@D/NNN   (DELETE ITEM)             FW022840
#FW03QEINI&CG1 EQU  X'0B'          FC@I       (INSERT ITEM)             FW022850
#FW03QEIDS&CG1 EQU  X'0C'          FC/V/V/CC  (DISPLAY INDEX W/ VARS)   FW022860
*                                                                       FW022870
*         THE FOLLOWING TWO FIELDS WILL BE LEFT JUSTIFIED BLANK FILLED  FW022880
*                                                                       FW022890
FW03QEBDC&CG1  DS   CL6            BOARD CITY                           FW022900
FW03QEOFC&CG1  DS   CL6            OFF CITY                             FW022910
*                                                                       FW022920
FW03QECAR&CG1  DS   CL2            CARRIER CODE 1 FOR USE IN            FW022930
*                                  CITY PAIR TEXT                       FW022940
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW022950
*                                                                       FW022960
FW03QEHD1&CG1  DS   XL2            HISTORICAL EFFECTIVE DATE            FW022970
FW03QEHD2&CG1  DS   XL2            HISTORICAL DISCONTINUE DATE          FW022980
*                                                                       FW022990
FW03QENM1&CG1  DS   X              HEX LINE NUMBER 1                    FW023000
FW03QENM2&CG1  DS   X              HEX LINE NUMBER 2                    FW023010
FW03QESIZ&CG1  DS   X              SIZE OF TEXT                         FW023020
FW03QETXT&CG1  DS   X              LINE OF CITY PAIR TEXT               FW023030
*********************************************************************** FW023040
** END OF CITY PAIR TEXT UPDATE SECTION                              ** FW023050
*********************************************************************** FW023060
FW03ECP&CG1  EQU *                 END OF CITY PAIR TEXT UPDATE AREA    FW023070
          EJECT                                                         FW023080
*********************************************************************** FW023090
*********************************************************************** FW023100
**                                                                   ** FW023110
** SECTION INFORMATION:                                              ** FW023120
**                                                                   ** FW023130
** TYPE:        QUERY                                                ** FW023140
** NAME:        CURRENCY CONVERSION DISPLAY                          ** FW023150
** IDENTIFIER:  F                                                    ** FW023160
**                                                                   ** FW023170
** PRIME KEY:   X'38'                                                ** FW023180
** ITEM ID:     FZ                                                   ** FW023190
** UNIQUE KEY:  X'0000'                                              ** FW023200
**                                                                   ** FW023210
** PURPOSE:     THIS SECTION IS USED TO SUPPLY INFORMATION FOR THE   ** FW023220
**              FZ CURRENCY CONVERSION ENTRY. THE RESPONSE IS        ** FW023230
**              RETURNED IN AN OM BLOCK FORMAT.                      ** FW023240
**                                                                   ** FW023250
*********************************************************************** FW023260
*********************************************************************** FW023270
          ORG  FW03USR&CG1                                              FW023280
FW03QFNBR&CG1  DS   XL2            LINE NUMBER                          FW023290
FW03QFDSP&CG1  DS   X              DISPLAY INDICATOR                    FW023300
*              B'0 1 2 3 4 5 6 7                                        FW023310
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW023320
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SELLING CITY USED FOR ITA     TK-PRICING FW023330
*                ¦ ¦ ¦ ¦ ¦ ¦ IATA CONVERSION                            FW023340
*                ¦ ¦ ¦ ¦ ¦ IATA RATES (FZI)                             FW023350
*                ¦ ¦ ¦ ¦ IATA CLEARING HOUSE RATES (FZC)                FW023360
*                ¦ ¦ ¦ RATES BETWEEN CURRENCIES                         FW023370
*                ¦ ¦ DETERMINE CITY CURRENCY                            FW023380
*                ¦ OBTAIN RATE AGAINST CRT LOCATION                     FW023390
*                DISPLAY RATE TABLES                                    FW023400
*                                                                       FW023410
#FW03QFRAT&CG1  EQU X'80'     DISPLAY RATE TABLES - QFCOU               FW023420
#FW03QFCRT&CG1  EQU X'40'     OBTAIN RATE AGAINST CRT LOCATION - QFCC1  FW023430
#FW03QFCTY&CG1  EQU X'20'     DETERMINE CURRENCY OF A CITY - QFCIT      FW023440
#FW03QFCUR&CG1  EQU X'10'     DISPLAY RATE BETWEEN CURRENCIES - CC1/CC2 FW023450
#FW03QFICH&CG1  EQU X'08'     DISPLAY IATA CLEARING HOUSE RATES (FZC)   FW023460
#FW03QFICC&CG1  EQU X'04'     DISPLAY IATA RATES BY CURRENCY (FZI)      FW023470
#FW03QFICV&CG1  EQU X'02'     CONVERT BETWEEN CURRENCIES USING IATA RTE FW023480
#FW03QFICI&CG1  EQU X'01'     SELLING CITY USED              TK-PRICING FW023480
*                                                                       FW023490
FW03QFFZI&CG1  DS   X              FZ INDICATORS                        FW023500
*              B'0 1 2 3 4 5 6 7                                        FW023510
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW023520
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ RATES BETWEEN CURRS BSR/BBR/ICH      G10 FW023530
*                ¦ ¦ ¦ ¦ ¦ ¦ FZ DISPLAY FROM AUDIT TRAIL            G10 FW023540
*                ¦ ¦ ¦ ¦ ¦ FZ DISPLAY FROM BUYERS TABLE                 FW023550
*                ¦ ¦ ¦ ¦ FZI/ALL ENTRY                                  FW023560
*                ¦ ¦ ¦ AGENT-SPECIFIED DIVISION FACTOR PRESENT          FW023570
*                ¦ ¦ AGENT-SPECIFIED MULTIPLICATION FACTOR PRESENT      FW023580
*                ¦ NO ROUNDING OPTION                                   FW023590
*                FZ DISPLAY FROM SELLER'S TABLE                         FW023600
*                                                                       FW023610
#FW03QFFZS&CG1  EQU X'80'          FZ DISPLAY FROM SELLER'S TABLE       FW023620
*                                    DEFAULT IS FZI IF BIT 0 = 0        FW023630
#FW03QFRND&CG1  EQU X'40'          FZ DISPLAY NO ROUNDING OPTION        FW023640
#FW03QFMULT&CG1 EQU X'20'          AGT-SPECIFIED MULTIPLICATION FACTOR  FW023650
#FW03QFDIV&CG1  EQU X'10'          AGT-SPECIFIED DIVISION FACTOR        FW023660
#FW03QFIALL&CG1 EQU X'08'          FZI/ALL ENTRY                        FW023670
#FW03QFIFZB&CG1 EQU X'04'          FZ DISPLAY FROM BUYERS TABLE         FW023680
#FW03QFADTR&CG1 EQU X'02'          FZ DISPLAY FROM AUDIT TRAIL      G10 FW023690
#FW03QFDBSC&CG1 EQU X'01'          RATES BETWEEN CURRS BSR/BBR/ICH  G10 FW023700
*                                                                       FW023710
*  IF THERE IS ONLY ONE CURRENCY CODE FIELD, IT IS TO BE PLACED IN THE  FW023720
*  'FROM' CURRENCY CODE FIELD.  EACH ADDITIONAL CURRENCY CODE SHOULD BE FW023730
*  FILLED IN IN ORDER FROM THE INPUT MESSAGE, 'TO' THEN CRT.            FW023740
*                                                                       FW023750
FW03QFCOU&CG1  DS   CL2            COUNTRY CODE                         FW023760
FW03QFCC1&CG1  DS   CL3            'FROM' CURRENCY CODE                 FW023770
FW03QFCC2&CG1  DS   CL3            'TO' CURRENCY CODE                   FW023780
FW03QFCC3&CG1  DS   CL3            CRT CURRENCY FOR SIMULTANEOUS CONV   FW023790
*TKT-681 FW03QFNUM&CG1  DS   CL8            AMOUNT TO CONVERT           FW023800
FW03QFNUM&CG1  DS   CL12           AMOUNT TO CONVERT            TKT-681 FW023800
FW03QFCIT&CG1  DS   CL3            OVERRIDING CITY FOR DISPLAY          FW023810
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW023820
FW03QFFAC&CG1  DS   CL8      AGENT-ENTERED SPECIFIED BANK RATE          FW023830
FW03QFDTE&CG1  DS   XL2            DATE FOR DISPLAY                     FW023840
FW03QFDT2&CG1  DS   XL2            2ND DATE FOR AUDIT TRAIL         G10 FW023850
*G10               REMAINDER OF FIELDS IN CURRENCY SECTION ADDED -      FW023860
* #FW03QFDLEN&CG1 EQU *-FW03REC&CG1  LEN OF DISPLAY FZ SECTION          FW023870
*                                                                       FW023880
*G10          ORG  FW03USR&CG1                                          FW023890
*G10******************************************************************* FW023900
*G10** THIS SECTION IS FOR BEGINNING AN UPDATE SESSION               ** FW023910
*G10******************************************************************* FW023920
*G10FW03QFBCOU&CG1 DS   CL2            COUNTRY                          FW023930
*G10#FW03QFBLEN&CG1 EQU *-FW03REC&CG1  LEN OF START SESSION FZ SECTION  FW023940
*G10*                                                                   FW023950
*G10          ORG  FW03USR&CG1                                          FW023960
*G10******************************************************************* FW023970
*G10** THIS SECTION IS FOR ADDING OR CHANGING AN ITEM                ** FW023980
*G10******************************************************************* FW023990
*G10FW03QFACNT&CG1 DS   X              NUMBER OF ITEMS                  FW024000
*G10FW03QFAMAX&CG1 EQU  X'64'          MAX NUMBER OF ITEMS FOR ADD/CHG  FW024010
*G10*                                                                   FW024020
*G10* THE FOLLOWING ITEM WILL BE REPEATED FW03QFACNT TIMES              FW024030
*G10*                                                                   FW024040
*G10FW03QFAITM&CG1 DS   0CL14          CURRENCY ITEM                    FW024050
*G10FW03QFACUR&CG1 DS   CL3            CURRENCY CODE                    FW024060
*G10FW03QFASIZ&CG1 DS   X              SIZE OF EXCHANGE RATE (?)        FW024070
*G10FW03QFAEXR&CG1 DS   CL10           EXCHANGE RATE                    FW024080
*G10#FW03QFALEN&CG1 EQU *-FW03REC&CG1  MIN LENGTH OF FZ ADD SECTION     FW024090
*G10*                                                                   FW024100
*G10          ORG  FW03USR&CG1                                          FW024110
*G10******************************************************************* FW024120
*G10** THE FOLLOWING SECTION IS FOR DELETING AN ITEM                 ** FW024130
*G10******************************************************************* FW024140
*G10FW03QFXCNT&CG1 DS   X              NUMBER OF CURRENCY CODES         FW024150
*G10FW03QFXMAX&CG1 EQU  X'07'          MAX NUMBER OF ITEMS FOR DELETE   FW024160
*G10*                                                                   FW024170
*G10* THE FOLLOWING ITEM WILL BE REPEATED GQFDCNT TIMES                 FW024180
*G10*                                                                   FW024190
*G10FW03QFXCUR&CG1 DS   CL3            CURRENCY CODE                    FW024200
*G10#FW03QFXLEN&CG1 EQU *-FW03REC&CG1  MIN LENGTH OF FZ DELETE SECTION  FW024210
*G10*                                                                   FW024220
*G10          ORG  FW03USR&CG1                                          FW024230
*G10******************************************************************* FW024240
*G10** THE FOLLOWING SECTION IS FOR COPYING AN ITEM                  ** FW024250
*G10******************************************************************* FW024260
*G10FW03QFCFRM&CG1 DS   X              TABLE TO COPY FROM               FW024270
*G10*                                  USE EQUATES DEFINED IN GQHASV2   FW024280
*G10*                                  FOR FZ ENTRIES (#GQF...)         FW024290
*G10*                                                                   FW024300
*G10FW03QFCCOU&CG1 DS   CL3            COUNTRY (CITY CODE) TO COPY FROM FW024310
*G10#FW03QFCLEN&CG1 EQU *-FW03REC&CG1  LENGTH OF FZ COPY SECTION        FW024320
*G10*                                                                   FW024330
*G10          ORG  FW03USR&CG1                                          FW024340
*G10******************************************************************* FW024350
*G10** THE FOLLOWING SECTION IS FOR CHANGING A SCREEN                ** FW024360
*G10******************************************************************* FW024370
*G10FW03QFSCRN&CG1 DS   CL(64*12)      THE SCREEN????                   FW024380
*G10#FW03QFSLEN&CG1 EQU *-FW03REC&CG1  LENGTH OF FZ SCREEN UPD SECTION  FW024390
*G10*                                                                   FW024400
*********************************************************************** FW024410
** END OF CURRENCY CONVERSION SECTION                                ** FW024420
*********************************************************************** FW024430
FW03EFZ&CG1    EQU  *   END OF CURRENCY CONVERTION SECTION              FW024690
FW03QFDSC&CG1  DS   XL3            SELLING CITY             TK-PRICING  FW023850
FW03EFI&CG1    EQU  *   END OF CURR.CONV.SEC. FOR ITA       TK-PRICING  FW023070
*********************************************************************** FW024450
*********************************************************************** FW024460
**                                                                   ** FW024470
** SECTION INFORMATION:                                              ** FW024480
**                                                                   ** FW024490
** TYPE:        QUERY                                                ** FW024500
** NAME:        FZI CURRENCY ADDITION AMOUNTS                        ** FW024510
** IDENTIFIER:  K                                                    ** FW024520
**                                                                   ** FW024530
** PRIME KEY:   X'38'                                                ** FW024540
** ITEM ID:     ZA                                                   ** FW024550
** UNIQUE KEY:  X'0000'                                              ** FW024560
**                                                                   ** FW024570
** PURPOSE:     THIS SECTION IS USED TO SUPPLY FZI CURRENCY          ** FW024580
**              ADDITION AMOUNTS FOR ENTRIES IN THE FORM:            ** FW024590
**              FZINUCAMT1/AMT2/AMT3/.../AMT9CURR                    ** FW024600
**                                                               G10 ** FW024610
*********************************************************************** FW024620
*********************************************************************** FW024630
          ORG  FW03USR&CG1                                              FW024640
FW03QKAMT&CG1  DS   CL8            ADDITION AMOUNT FOR FZI              FW024650
*********************************************************************** FW024660
** END OF FZI CURRENCY ADDITION AMOUNTS SECTION                      ** FW024670
*********************************************************************** FW024680
FW03EZA&CG1    EQU  *              END OF FZI CUR ADDITION SECTION      FW024690
*********************************************************************** FW024700
*********************************************************************** FW024710
**                                                                   ** FW024720
** SECTION INFORMATION:                                              ** FW024730
**                                                                   ** FW024740
** TYPE:        QUERY                                                ** FW024750
** NAME:        GENERAL INFORMATION SECTION                          ** FW024760
** IDENTIFIER:  G                                                    ** FW024770
**                                                                   ** FW024780
** PRIME KEY:   X'38'                                                ** FW024790
** ITEM ID:     GI                                                   ** FW024800
** UNIQUE KEY:  X'0000'                                              ** FW024810
**                                                                   ** FW024820
** PURPOSE:     THIS SECTION IS USED TO SUPPLY GENERAL INFORMATION   ** FW024830
**              FOR THE FOLLOWING ENTRIES:                           ** FW024840
**                                                                   ** FW024850
**              FQ..., $B..., AND $Q...                              ** FW024860
**                                                                   ** FW024870
*********************************************************************** FW024880
*********************************************************************** FW024890
          ORG  FW03USR&CG1                                              FW024900
*                                                                       FW024910
FW03QGCOT&CG1  DS   CL3            TICKETING CITY - MUST BE CITY    OZ  FW024920
*                                  CODE - NOT AIRPORT               OZ
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW024930
FW03QGDOQ&CG1  DS   XL2            DATE ON WHICH QUOTE TO BE BASED      FW024940
FW03QGCOQ&CG1  DS   CL3            CITY ON WHICH QUOTE TO BE BASED      FW024950
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW024960
FW03QGCOR&CG1  DS   CL3            CURRENCY CODE FOR RESPONSE           FW024970
FW03QGARD&CG1  DS   XL2            RESERVATION DATE OF FIRST SEGMENT    FW024980
FW03QGART&CG1  DS   XL2            RESERVATION TIME OF FIRST SEGMENT    FW024990
*                                    MINUTES PAST MIDNIGHT              FW025000
FW03QGPLC&CG1  DS   CL2            PLATING CARRIER FOR PFC INFO         FW025010
               DS   C              RESERVED FOR CARRIER EXPANSION       FW025020
*                                                                       FW025030
FW03QGZCC&CG1  DS   XL2            BIT MAP OF SEGMENTS W/ C CLASS       FW025040
*                                  BYTE 1  BIT 0 == SEGMENT 1           FW025050
*                                          BIT 1 == SEGMENT 2           FW025060
*                                                                       FW025070
*                                  BYTE 2  BIT 7 == SEGMENT 16          FW025080
*                                                                       FW025090
FW03QGSCR&CG1  DS   CL3            SELLING CURRENCY OVERRIDE         04 FW025100
FW03QGDTE&CG1  DS   XL2            HOST SYSTEM DATE              TK1002 GF015040
FW03QGIND&CG1  DS   XL1            GENERAL INFORMATION INDICATOR TK1002 GF015040
*              B'0 1 2 3 4 5 6 7'                                       GF016950
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        GF016960
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ FQ,WAVE PARAMETER USED ('-@') TK-PRICING GF016970
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      GF016980
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        GF016990
*                | | | | PAPER TICKET FARES REQUESTED            TK4589
*                | | | ELECTRONIC TICKET FARES REQUESTED         TK4589
*                ¦ ¦ LCU OVERRIDE REQUESTED                      TK1002 GF017020
*                ¦ EUR OVERRIDE REQUESTED                        TK1002 GF017030
*                DO NOT GUARANTEE TKT RESTR FQ                    @16   GF017040
*                                                                       GF017050
#FW03QGNOTG&CG1 EQU  X'80'          DON'T GUARANTEE TKT RESTR FQ TK1002 GF017060
#FW03QGEUR&CG1  EQU  X'40'          EUR OVERRIDE REQUESTED       TK1002 GF017060
#FW03QGLCU&CG1  EQU  X'20'          LCU OVERRIDE REQUESTED       TK1002 GF017060
#FW03QGETK&CG1  EQU  X'10'          ELECTRONIC TKT FARES REQUESTED 4589
#FW03QGPTK&CG1  EQU  X'08'          PAPER TICKET FARES REQUESTED TK4589
#FW03QGACR&CG1  EQU  X'04'          ALTERNATE CITY REQUESTED     TK4589
#FW03QGADR&CG1  EQU  X'02'          ALTERNATE DATE REQUESTED     TK4589
#FW03QGWAV&CG1  EQU  X'01'          FQ WAVE
FW03QGIN1&CG1  DS   XL1             GENERAL INFORMATION IND             GF015040
#FW03QGCORP&CG1 EQU  X'80'          **CP  USED                          GF017060
#FW03QGBUSC&CG1 EQU  X'40'          **BC  USED                          GF017060
#FW03QGFRSA&CG1 EQU  X'20'          /*BP00N1  INT.MIL.       TK-P012051
#FW03QGGMIL&CG1 EQU  X'10'          SSRGMIL FOUND IND.       TK-P016059
               DS   XL2             SPARES
*              DS   XL3             SPARES                       TK4589
***********************************************************************
** END OF GENERAL INFORMATION SECTION                                **
***********************************************************************
FW03EGI&CG1  EQU  *               END OF GENERAL INFORMATION SECTION    FW025140
          EJECT                                                         FW025150
*********************************************************************** FW025160
*********************************************************************** FW025170
**                                                                   ** FW025180
** SECTION INFORMATION:                                              ** FW025190
**                                                                   ** FW025200
** TYPE:        QUERY                                                ** FW025210
** NAME:        ITINERARY ITEM                                       ** FW025220
** IDENTIFIER:  I                                                    ** FW025230
**                                                                   ** FW025240
** PRIME KEY:   X'38'                                                ** FW025250
** ITEM ID:     IT                                                   ** FW025260
** UNIQUE KEY:  RELATIVE SEGMENT NUMBER - MATCHES LF SECTION         ** FW025270
**                                                                   ** FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ITINERARY INFORMATION ** FW025290
**              FOR THE FOLLOWING ENTRIES:                           ** FW025300
**                                                                   ** FW025310
**              FQ..., $B..., AND $Q...                              ** FW025320
**                                                                   ** FW025330
*********************************************************************** FW025340
*********************************************************************** FW025350
          ORG  FW03USR&CG1                                              FW025360
*                                                                       FW025370
FW03QIIT1&CG1 DS    X              INDICATOR                            FW025380
*              B'0 1 2 3 4 5 6 7'                                       FW025390
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW025400
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ OFF CITY IS A MUST BREAK POINT        02 FW025410
*                ¦ ¦ ¦ ¦ ¦ ¦ OFF CITY IS A MUST NOT BREAK POINT      02 FW025420
*                ¦ ¦ ¦ ¦ ¦ LINE OF FLIGHT INFO EXISTS FOR THIS SEGMENT  FW025430
*                ¦ ¦ ¦ ¦ NO STOPOVER AT OFFPOINT                        FW025440
*                ¦ ¦ ¦ STOPOVER AT OFFPOINT                             FW025450
*                ¦ ¦ OPEN                                               FW025460
*                ¦ UNCONFIRMED (DEFAULT TO HL)                          FW025470
*                CONFIRMED (DEFAULT TO HK)                              FW025480
*                                                                       FW025490
#FW03QICNF&CG1 EQU  X'80'          CONFIRMED (DEFAULT TO HK)            FW025500
#FW03QIUCF&CG1 EQU  X'40'          UNCONFIRMED (DEFAULT TO HL)          FW025510
#FW03QIOPN&CG1 EQU  X'20'          OPEN                                 FW025520
#FW03QISTP&CG1 EQU  X'10'          STOPOVER AT OFFPOINT                 FW025530
#FW03QIXSP&CG1 EQU  X'08'          NO STOPOVER AT OFFPOINT              FW025540
*                                  DEFAULTS TO STOPOVER AND PERFORMS    FW025550
*                                  INTERNAL ITINERARY ANALYSIS NEITHER  FW025560
*                                  BIT IS ON                            FW025570
#FW03QILOF&CG1 EQU  X'04'          LINE OF FLIGHT EXISTS FOR SEGMENT    FW025580
#FW03QIMNB&CG1 EQU  X'02'          OFF CITY IS A MUST NOT BRK POINT  02 FW025590
#FW03QIMBP&CG1 EQU  X'01'          OFF CITY IS A MUST BREAK POINT    02 FW025600
*                                                                       FW025610
FW03QICXR&CG1  DS   CL2            CARRIER CODE                         FW025620
*TK-P..STATUS  DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW025630
FW03QISTA&CG1  DS   X              SEGMENT STATUS CODE   TK-P...STATUS  FW025630
*                                  01 -  OPEN
*                                  02 -  STANDBY
*                                  03 -  WAITLIST
*                                  04 -  CONFIRMED
*                                  05 -  UNKNOWN
FW03QIFLT&CG1  DS   CL4            FLIGHT NUMBER                        FW025640
FW03QIDPT&CG1  DS   XL2            DATE OF DEPARTURE                    FW025650
FW03QIBRD&CG1  DS   CL3            BOARD POINT                          FW025660
*TK-PRICING    DS   C              RESERVED FOR CITY CODE EXPANSION     FW025670
FW03QICNT&CG1  DS   X              SEAT COUNT                TK-PRICING FW025670
FW03QIOFF&CG1  DS   CL3            OFF POINT                            FW025680
*07            DS   C              RESERVED FOR CITY CODE EXPANSION     FW025690
FW03QIIT2&CG1  DS   X              INDICATOR                         07 FW025700
*              B'0 1 2 3 4 5 6 7'                                    07 FW025710
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                     07 FW025720
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                 07 FW025730
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                   07 FW025740
*                ¦ ¦ ¦ ¦ ¦ SPARE                                     07 FW025750
*                ¦ ¦ ¦ ¦ STOPOVER OR BREAK MODIFIER USED IN INPUT    07 FW025760
*                ¦ ¦ ¦ SPARE                                         07 FW025770
*                ¦ ¦ SPARE                                           07 FW025780
*                ¦ SPARE                                             07 FW025790
*                SPARE                                               07 FW025800
*                                                                    07 FW025810
#FW03QISCM&CG1 EQU  X'08'          STOPOVER OR BREAK MODIFIER USED   07 FW025820
*                                                                    07 FW025830
FW03QITOD&CG1  DS   XL2            TIME OF DEPARTURE - MINUTES PAST     FW025840
*                                    MIDNIGHT LOCAL TIME                FW025850
FW03QITOA&CG1  DS   XL2            TIME OF ARRIVAL - MINUTES PAST       FW025860
*                                    MIDNIGHT LOCAL TIME                FW025870
FW03QIDIF&CG1  DS   X              DAY DIFF. - LOW ORDER 4 BITS      02 FW025880
*                                                                    02 FW025890
*                                                                    02 FW025900
*              B'0 1 2 3 4 5 6 7'                                    02 FW025910
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                     02 FW025920
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ BITS 4-7                              02 FW025930
*                ¦ ¦ ¦ ¦ ¦ ¦ USED                                    02 FW025940
*                ¦ ¦ ¦ ¦ ¦ FOR DAY                                   02 FW025950
*                ¦ ¦ ¦ ¦ DIFFERENTIAL                                02 FW025960
*                ¦ ¦ ¦ SPARE                                         02 FW025970
*                ¦ ¦ SPARE                                           02 FW025980
*                ¦ MUST BREAK FARE AT BOARD POINT                    02 FW025990
*                MUST NOT BREAK FARE AT BOARD POINT                  02 FW026000
*                                                                    02 FW026010
#FW03QIBNB&CG1 EQU  X'80'          BRD CITY IS MUST NOT BREAK POINT  02 FW026020
#FW03QIBMB&CG1 EQU  X'40'          BRD CITY IS MUST BREAK POINT      02 FW026030
*                                                                       FW026040
FW03QIFIC&CG1  DS   CL8            FIC OVERRIDE FOR SEGMENT             FW026050
FW03QIBKC&CG1  DS   CL2            BOOKING CLASS - OPTIONAL             FW026060
*                                  'BC' SECTION STILL REQUIRED          FW026070
*                                                                       FW026080
#FW03QILEN&CG1 EQU  *-FW03REC&CG1 LENGTH OF NON-FQP ITINERARY SEC   G03 FW026090
*                                                                       FW026100
FW03QIGLD&CG1  DS   CL2            GLOBAL DIRECTION FOR FQP ONLY        FW026110
FW03QIFPI&CG1  DS   X              FUNCTION UNIQUE INDICATOR            FW026120
*                                                                       FW026130
*  FQP DEFINITIONS                                                      FW026140
*                                                                       FW026150
*              B'0 1 2 3 4 5 6 7'                                       FW026160
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW026170
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW026180
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW026190
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW026200
*                ¦ ¦ ¦ ¦ SPARE                                          FW026210
*                ¦ ¦ ¦ THIS BOARD PT IS IN SAME CITY AS PREV OFF PT G03 FW026220
*                ¦ ¦ STOPOVER/CONNECTION FORCED                         FW026230
*                ¦ DATE FORCED                                          FW026240
*                NON-PNR/BOOKING FILE SEGMENT                           FW026250
*                (REQUESTER USE ONLY)                                   FW026260
*                                                                       FW026270
#FW03QINON&CG1 EQU  X'80'          NON-PNR/BOOKING FILE SEGMENT         FW026280
*                                  (REQUESTER USE ONLY)                 FW026290
#FW03QIDTF&CG1 EQU  X'40'          DATE FORCED                          FW026300
#FW03QISOC&CG1 EQU  X'20'          STOPOVER/CONNECTION FORCED       G03 FW026310
#FW03QICCS&CG1 EQU  X'10'          BRD PT & PREV OFF PT IN SAME CTY G03 FW026320
*                                                                       FW026330
*********************************************************************** FW026340
** END OF ITINERARY INFORMATION SECTION                              ** FW026350
*********************************************************************** FW025170
FW03EIT&CG1  EQU  *                END OF ITINERARY SECTION
          EJECT
***********************************************************************
***********************************************************************
**                                                                   ** FW025180
** SECTION INFORMATION:                                              ** FW025190
**                                                                   ** FW025200
** TYPE:        QUERY                                                ** FW025210
** NAME:        ITINERARY ITEM FOR ANCILLARY                         ** FW025220
** IDENTIFIER:  I                                                    ** FW025230
**                                                                   ** FW025240
** PRIME KEY:   X'38'                                                ** FW025250
** ITEM ID:     IA                                                   ** FW025260
** UNIQUE KEY:                                                       ** FW025270
**                                                                   ** FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY SELECTED ITIN.        ** FW025290
**              FOR THE FOLLOWING ENTRIES:                           ** FW025300
**                                                                   ** FW025310
**              FQDA - DISPLAY ANCILLARY FARE                        ** FW025320
**              FQFA - FILE ANCILLARY FARE                           ** FW025330
**                                                                   ** FW025330
**              FQFAS2-4                                 TKT-61      ** FW025330
**                                                                   ** FW025330
*********************************************************************** FW025340
*********************************************************************** FW025350
          ORG  FW03USR&CG1                                              FW025360
*                                                                       FW025370
FW03QKITS&CG1  DS   0CL32          ITINERARY INDEX AREA                 FW025380
FW03QKIT1&CG1  DS   CL2            ITIN. 1 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT2&CG1  DS   CL2            ITIN. 2 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT3&CG1  DS   CL2            ITIN. 3 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT4&CG1  DS   CL2            ITIN. 4 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT5&CG1  DS   CL2            ITIN. 5 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT6&CG1  DS   CL2            ITIN. 6 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT7&CG1  DS   CL2            ITIN. 7 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT8&CG1  DS   CL2            ITIN. 8 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT9&CG1  DS   CL2            ITIN. 9 (IT SECTION INDEX NUM.)      FW025380
FW03QKIT10&CG1 DS   CL2            ITIN. 10 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT11&CG1 DS   CL2            ITIN. 11 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT12&CG1 DS   CL2            ITIN. 12 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT13&CG1 DS   CL2            ITIN. 13 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT14&CG1 DS   CL2            ITIN. 14 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT15&CG1 DS   CL2            ITIN. 15 (IT SECTION INDEX NUM.)     FW025380
FW03QKIT16&CG1 DS   CL2            ITIN. 16 (IT SECTION INDEX NUM.)     FW025380
*
FW03QKIA1&CG1  DS   X               INDICATOR                           FW025380
*                                   BIT 0 - (SPARE)
*                                   BIT 1 - (SPARE)
*                                   BIT 2 - (SPARE)
*                                   BIT 3 - (SPARE)
*                                   BIT 4 - (SPARE)
*                                   BIT 5 - (SPARE)
*                                   BIT 6 - (SPARE)
*                                   BIT 7 - (SPARE)
               DS   CL10            SPARE                               FW025380
*                                                                       FW026080
*                                                                       FW026330
*********************************************************************** FW026340
** END OF ITINERARY ANCILLARY INFO SECTION                           ** FW026350
*********************************************************************** FW026360
FW03EIA&CG1  EQU  *                END OF ITINERARY ANCILLARY SECTION   FW026370
          EJECT                                                         FW026380
***********************************************************************
***********************************************************************
**                                                                   ** FW025180
** SECTION INFORMATION:                                              ** FW025190
**                                                                   ** FW025200
** TYPE:        QUERY                                                ** FW025210
** NAME:        RFC CODE FOR ANCILLARY                               ** FW025220
** IDENTIFIER:  I                                                    ** FW025230
**                                                                   ** FW025240
** PRIME KEY:   X'38'                                                ** FW025250
** ITEM ID:     RA                                                   ** FW025260
** UNIQUE KEY:                                                       ** FW025270
**                                                                   ** FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY RFC CODE.             ** FW025290
**              FOR THE FOLLOWING ENTRIES:                           ** FW025300
**                                                                   ** FW025310
**              FQDA - DISPLAY ANCILLARY FARE                        ** FW025320
**              FQFA - FILE ANCILLARY FARE                           ** FW025330
**                                                                   ** FW025330
**              FQFAS2-4/RF-ABC                          TKT-61      ** FW025330
**                                                                   ** FW025330
*********************************************************************** FW025340
*********************************************************************** FW025350
          ORG  FW03USR&CG1                                              FW025360
*                                                                       FW025370
FW03QRRFC&CG1  DS   CL3             RFC CODE                            FW025380
*
FW03QRRA1&CG1  DS   X               INDICATOR                           FW025380
*                                   BIT 0 - (SPARE)
*                                   BIT 1 - (SPARE)
*                                   BIT 2 - (SPARE)
*                                   BIT 3 - (SPARE)
*                                   BIT 4 - (SPARE)
*                                   BIT 5 - (SPARE)
*                                   BIT 6 - (SPARE)
*                                   BIT 7 - (SPARE)
               DS   CL6             SPARE                               FW025380
FW03QRSSR&CG1  DS   CL4             SSR CODE                            FW025380
*                                                                       FW026080
*                                                                       FW026330
*********************************************************************** FW026340
** END OF ITINERARY ANCILLARY INFO SECTION                           ** FW026350
*********************************************************************** FW026360
FW03ERA&CG1  EQU  *                END OF ITINERARY ANCILLARY SECTION   FW026370
          EJECT                                                         FW026380
***********************************************************************
***********************************************************************
**                                                                   ** FW025180
** SECTION INFORMATION:                                              ** FW025190
**                                                                   ** FW025200
** TYPE:        QUERY                                                ** FW025210
** NAME:        SSR CODE DETAIL FROM EMD VALIDATION TABLE            ** FW025220
** IDENTIFIER:  I                                                    ** FW025230
**                                                                   ** FW025240
** PRIME KEY:   X'38'                                                ** FW025250
** ITEM ID:     RB                                                   ** FW025260
** UNIQUE KEY:                                                       ** FW025270
**                                                                   ** FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY SSR CODE.             ** FW025290
**              FOR THE FOLLOWING ENTRIES:                           ** FW025300
**                                                                   ** FW025310
**              FQDA - DISPLAY ANCILLARY FARE                        ** FW025320
**              FQFA - FILE ANCILLARY FARE                           ** FW025330
**                                                                   ** FW025330
**              FQFAS2-4/SSR-RQST/P1*ADT.....                        ** FW025330
**              FQDAS2-4/SSR-RQST/P1*ADT.....            TKT-..AC2   ** FW025330
**                                                                   ** FW025330
*********************************************************************** FW025340
*********************************************************************** FW025350
          ORG  FW03USR&CG1                                              FW025360
*                                                                       FW025370
FW03QYRFC&CG1  DS   CL4             SSR CODE  (REASON CODE-RQST)        FW025380
*                                   VARIABLE PART
FW03QYSCT&CG1  DS   XL1             CODE COUNTER                        FW025380
FW03QYSCX&CG1  DS   0CL6            SUB.CODE SLOT
FW03QYSC1&CG1  DS   CL3             SUB.CODE 1 - RFISC  CODE
FW03QYSC2&CG1  DS   CL3             SUB.CODE 2 - RFISCI CODE
*    .
*    .
*                                   END OF VARIABLE PART
FW03QYRA1&CG1  DS   X               INDICATOR
*                                   BIT 0 - (SPARE)
*                                   BIT 1 - (SPARE)
*                                   BIT 2 - (SPARE)
*                                   BIT 3 - (SPARE)
               DS   XL9             SPARE AREA
*
*********************************************************************** FW026340
** END OF ITINERARY ANCILLARY INFO SECTION                           ** FW026350
*********************************************************************** FW026360
FW03ERB&CG1  EQU  *                END OF  ANCILLARY RB  SECTION        FW026370
          EJECT                                                         FW026380
***********************************************************************
***********************************************************************
**                                                                   ** FW025180
** SECTION INFORMATION:                                              ** FW025190
**                                                                   ** FW025200
** TYPE:        QUERY                                                ** FW025210
** NAME:        SEAT CHARACTERISTIC FROM SSRASVC                     ** FW025220
** IDENTIFIER:  I                                                    ** FW025230
**                                                                   ** FW025240
** PRIME KEY:   X'38'                                                ** FW025250
** ITEM ID:     RC                                                   ** FW025260
** UNIQUE KEY:                                                       ** FW025270
**                                                                   ** FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY SEAT CHARACT.         ** FW025290
**              FOR THE FOLLOWING ENTRIES:                           ** FW025300
**                                                                   ** FW025310
**              FQDA - DISPLAY ANCILLARY FARE                        ** FW025320
**              FQFA - FILE ANCILLARY FARE                           ** FW025330
**                                                                   ** FW025330
**              FQFAS2-4/SSR-RQST/P1*ADT.....                        ** FW025330
**              FQDAS2-4/SSR-RQST/P1*ADT.....            TKT-..AC2   ** FW025330
**                                                                   ** FW025330
*********************************************************************** FW025340
*********************************************************************** FW025350
          ORG  FW03USR&CG1                                              FW025360
*                                   (INFORMATION FROM PNR)              FW025370
FW03QYPXN&CG1  DS   XL1             PAX.NUMBER                          FW025380
FW03QYRA2&CG1  DS   X               INDICATOR
*                                   BIT 0 - (SPARE)
*                                   BIT 1 - (SPARE)
*                                   BIT 2 - (SPARE)
*                                   BIT 3 - (SPARE)
               DS   XL9             SPARE AREA
*
FW03QYTSN&CG1  DS   XL1             TOTAL SEGMENT COUNT                 FW025380
*                                   VARIABLE PART FOR EACH SEGMENT.
*FW03QYSLT&CG1  DS   0CL11           SLOT                               FW025380
FW03QYSLT&CG1  DS   0CL31           SLOT  TK-P028897
FW03QYSNB&CG1  DS   XL2             SEGMENT NUMBER                      FW025380
FW03QYSSC&CG1  DS   CL3             SEGMENT SUB.CODE       (0B5)
FW03QYSCR&CG1  DS   CL6             SEGMENT CHARACTERISTIC (27CCWE)
FW03QMAPC&CG1  DS   CL20            SCMT MAP CHARACTERISTIC (C,W,L)
*                                   END OF VARIABLE PART
*********************************************************************** FW026340
** END OF ITINERARY ANCILLARY INFO SECTION                           ** FW026350
*********************************************************************** FW026360
FW03ERC&CG1  EQU  *                 END OF ANCILLARY SEAT CHRACTERISTIC FW026370
          EJECT                                                         FW026380
*********************************************************************** FW026390
*********************************************************************** FW026400
**                                                                   ** FW026410
** SECTION INFORMATION:                                              ** FW026420
**                                                                   ** FW026430
** TYPE:        QUERY                                                ** FW026440
** NAME:        PENALTY MODIFIERS                                    ** FW026450
** IDENTIFIER:  J                                                    ** FW026460
**                                                                   ** FW026470
** PRIME KEY:   X'38'                                                ** FW026480
** ITEM ID:     PE                                                   ** FW026490
** UNIQUE KEY:  X'0000'                                              ** FW026500
**                                                                   ** FW026510
** PURPOSE:     THIS SECTION IS USED TO SUPPLY PENALTY MODIFIERS     ** FW026520
**              FOR THE FOLLOWING ENTRIES:                           ** FW026530
**                                                                   ** FW026540
**              FD..., FQ..., àB..., AND àQ...                       ** FW026550
**                                                                   ** FW026560
**              IF FW03QJPEI=X'00' THEN IT IS ASSUMED THE PENALTY    ** FW026570
**              DESIRED IS AN AMOUNT.  ONLY ONE PENALTY IS VALID     ** FW026580
**              FOR A SINGLE QUOTE.                                  ** FW026590
**                                                                   ** FW026600
*********************************************************************** FW026610
*********************************************************************** FW026620
          ORG  FW03USR&CG1                                              FW026630
FW03QJPEN&CG1  DS   CL2            PENALTY AMOUNT (EX: àBPE25)          FW026640
FW03QJPEI&CG1  DS   X              PENALTY INDICATORS                   FW026650
*              B'0 1 2 3 4 5 6 7'                                       FW026660
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW026670
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW026680
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW026690
*                ¦ ¦ ¦ ¦ ¦ NO VUSA FARES (àD ONLY)                      FW026700
*                ¦ ¦ ¦ ¦ NO MIN/MAX STAY                                FW026710
*                ¦ ¦ ¦ NO ADVANCED PURCHASE                             FW026720
*                ¦ ¦ NO RESTRICTIONS                                    FW026730
*                ¦ NO MAXIMUM STAY                                      FW026740
*                NO MINIMUM STAY                                        FW026750
*                                                                       FW026760
#FW03QJMIN&CG1 EQU  X'80'          NO MINIMUM STAY RESTRICTIONS         FW026770
#FW03QJMAX&CG1 EQU  X'40'          NO MAXIMUM STAY RESTRICTIONS         FW026780
#FW03QJNNR&CG1 EQU  X'20'          NO RESTRICTIONS                      FW026790
#FW03QJNAP&CG1 EQU  X'10'          NO ADVANCED PURCHASE                 FW026800
#FW03QJNMM&CG1 EQU  X'08'          NO MINIMUM OR MAXIMUM                FW026810
#FW03QJNNV&CG1 EQU  X'04'          NO VUSA FARES (àD ONLY)              FW026820
*********************************************************************** FW026830
** END OF ITINERARY INFORMATION SECTION                              ** FW026840
*********************************************************************** FW026850
FW03EPE&CG1  EQU  *                END OF PENALTY MODIFIER SECTION      FW026860
*********************************************************************** FW026870
*********************************************************************** FW026880
**                                                                   ** FW026890
** SECTION INFORMATION:                                              ** FW026900
**                                                                   ** FW026910
** TYPE:        QUERY                                                ** FW026920
** NAME:        LINE OF FLIGHT INFORMATION                           ** FW026930
** IDENTIFIER:  L                                                    ** FW026940
**                                                                   ** FW026950
** PRIME KEY:   X'38'                                                ** FW026960
** ITEM ID:     LF                                                   ** FW026970
** UNIQUE KEY:  RELATIVE SEGMENT NUMBER - MATCHES IT SECTION         ** FW026980
**                                                                   ** FW026990
** PURPOSE:     THIS SECTION IS USED TO SUPPLY LINE OF FLIGHT        ** FW027000
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW027010
**                                                                   ** FW027020
**              FQ..., $B..., AND $Q...                              ** FW027030
**                                                                   ** FW027040
**              MULTIPLE ITEMS MAY EXIST INTERNALLY                  ** FW027050
**                                                                   ** FW027060
*********************************************************************** FW027070
*********************************************************************** FW027080
          ORG  FW03USR&CG1                                              FW027090
*                                                                       FW027100
FW03QLLIT&CG1  DS   0XL9           LEG ITEM                             FW027110
FW03QLBPT&CG1  DS   CL3            BOARD CITY                           FW027120
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW027130
FW03QLIN1&CG1  DS   X              INDICATORS                           FW027140
*                                                                       FW027150
*              B'0 1 2 3 4 5 6 7'                                       FW027160
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ -/ DATE ADJUSTMENT FROM              G03 FW027170
*                ¦ ¦ ¦ ¦ ¦ ¦ ---\ PREVIOUS LEG                      G03 FW027180
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW027190
*                ¦ ¦ ¦ ¦ NEGATIVE DATE ADJUSTMENT                   G03 FW027200
*                ¦ ¦ ¦ AVAILABLE                                        FW027210
*                ¦ ¦ AVAILABLE                                          FW027220
*                ¦ NOOP                                                 FW027230
*                TERMINATING CITY                                       FW027240
*                                                                       FW027250
#FW03QLTERM&CG1 EQU X'80'          TERMINATING CITY                     FW027260
#FW03QLNOOP&CG1 EQU X'40'          NOOP FLIGHT THIS DATE                FW027270
#FW03QLNEGD&CG1 EQU X'08'          NEGATIVE DATE ADJUSTMENT         G03 FW027280
*               EQU X'03           DATE ADJUSTMENT FROM PREVIOUS LEGG03 FW027290
*                                                                       FW027300
FW03QLDIS&CG1   DS  X                   DATE DISCREPANCY VALUE.         FW027310
*                                  0,1,2 BASED ON BOARD STATION.        FW027320
FW03QLDAT&CG1   DS  XL3            DEPARTURE/ARRIVAL TIME EXPRESSED AS  FW027330
*                                  MINUTES SINCE MIDNIGHT.              FW027340
*                                  BITS 00-11 = DEPARTURE TIME          FW027350
*                                  BITS 12-23 = ARRIVAL TIME            FW027360
*********************************************************************** FW027370
** END OF LINE OF FLIGHT INFORMATION                                 ** FW027380
*********************************************************************** FW027390
FW03ELF&CG1  EQU  *                END OF LINE OF FLIGHT SECTION        FW027400
         EJECT                                                          FW027410
*********************************************************************** FW027420
*********************************************************************** FW027430
**                                                                   ** FW027440
** SECTION INFORMATION:                                              ** FW027450
**                                                                   ** FW027460
** TYPE:        QUERY                                                ** FW027470
** NAME:        FTAX*PFC (àPFC)                                      ** FW027480
** IDENTIFIER:  P                                                    ** FW027490
**                                                                   ** FW027500
** PRIME KEY:   X'38'                                                ** FW027510
** ITEM ID:     PC                                                   ** FW027520
** UNIQUE KEY:  X'0000'                                              ** FW027530
**                                                                   ** FW027540
** PURPOSE:     THIS SECTION IS USED TO SUPPLY A CITY OR AIRLINE     ** FW027550
**              CODE FOR THE àPFC ENTRY.  THE RESPONSE IS IN OM      ** FW027560
**              BLOCK FORMAT.                                        ** FW027570
**                                                                   ** FW027580
*********************************************************************** FW027590
*********************************************************************** FW027600
          ORG  FW03USR&CG1                                              FW027610
FW03QPCTY&CG1  DS   CL3            CITY CODE OR AIRLINE CODE (BLANK     FW027620
*                                                             PADDED)   FW027630
*********************************************************************** FW027640
** END OF FTAX*PFC SECTION                                           ** FW027650
*********************************************************************** FW027660
FW03EPC&CG1  EQU  *              END OF FTAX*PFC SECTION                FW027670
          EJECT                                                         FW027680
*********************************************************************** FW027690
*********************************************************************** FW027700
**                                                                   ** FW027710
** SECTION INFORMATION:                                              ** FW027720
**                                                                   ** FW027730
** TYPE:        QUERY                                                ** FW027740
** NAME:        ROUTING DISPLAY FOLLOWUP TO FARE DISPLAY             ** FW027750
** IDENTIFIER:  R                                                    ** FW027760
**                                                                   ** FW027770
** PRIME KEY:   X'38'                                                ** FW027780
** ITEM ID:     LR                                                   ** FW027790
** UNIQUE KEY:  X'0000'                                              ** FW027800
**                                                                   ** FW027810
** PURPOSE:     THIS SECTION IS USED TO SUPPLY THE INFORMATION       ** FW027820
**              NEEDED FOR THE àLR ROUTING DISPLAY ENTRY.  THIS      ** FW027830
**              ENTRY IS A FOLLOWUP TO A FARE DISPLAY.  IF A         ** FW027840
**              DISPLAY FROM FQS WAS DONE, THEN THE àLR#/T ENTRY     ** FW027850
**              IS INDICATED USING THE APPLICATION SERVICE LEVEL     ** FW027860
**              INDICATOR IN THE QUERY HEADER SECTION.  THIS         ** FW027870
**              SECTION IS NOT REQUIRED IF SUCH IS THE CASE.         ** FW027880
**              THE àLR#/T IS NOT VALID FOLLOWING AN IFQ DISPLAY.    ** FW027890
**              THE RESPONSE IS RETURNED IN THE FORM OF AN OM        ** FW027900
**              BLOCK TYPE.                                          ** FW027910
**                                                                   ** FW027920
*********************************************************************** FW027930
*********************************************************************** FW027940
          ORG  FW03USR&CG1                                              FW027950
FW03QRNBR&CG1  DS   XL2            LINE NUMBER                          FW027960
FW03QRCY1&CG1  DS   CL3            CITY 1 FOR ROUTING VALIDATION        FW027970
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW027980
FW03QRCY2&CG1  DS   CL3            CITY 2 FOR ROUTING VALIDATION        FW027990
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW028000
FW03QRCX1&CG1  DS   CL2            CARRIER 1 FOR ROUTING VALIDATION     FW028010
               DS   C              RESERVED FOR AIRLINE CODE EXPANSION  FW028020
FW03QRCX2&CG1  DS   CL2            CARRIER 2 FOR ROUTING VALIDATION     FW028030
               DS   C              RESERVED FOR AIRLINE CODE EXPANSION  FW028040
*********************************************************************** FW028050
** END OF FR SECTION - ACTION CODE X'06'                             ** FW028060
*********************************************************************** FW028070
FW03ELR&CG1  EQU  *                END OF FR SECTION                    FW028080
          EJECT                                                         FW028090
*********************************************************************** FW028100
*********************************************************************** FW028110
**                                                                   ** FW028120
** SECTION INFORMATION:                                              ** FW028130
**                                                                   ** FW028140
** TYPE:        QUERY                                                ** FW028150
** NAME:        TAX EXEMPT SECTION                                   ** FW028160
** IDENTIFIER:  T                                                    ** FW028170
**                                                                   ** FW028180
** PRIME KEY:   X'38'                                                ** FW028190
** ITEM ID:     TE                                                   ** FW028200
** ITEM ID:     TA          ITEM ID CHANGED            TK1000        ** FW028200
** UNIQUE KEY:  X'0000'                                              ** FW028210
**                                                                   ** FW028220
** PURPOSE:     THIS SECTION IS USED TO SUPPLY TAX EXEMPT            ** FW028230
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW028240
**                                                                   ** FW028250
**              FQ..., $B..., AND $Q...                              ** FW028260
**                                                                   ** FW028270
*********************************************************************** FW028280
*********************************************************************** FW028290
          ORG  FW03USR&CG1                                              FW028300
*                                                                       FW028310
FW03QTTCN&CG1 DS    X              NUMBER OF TAX EXEMPT CODES           FW028320
*                                   (UP TO 7 TAX CODES MAY BE           FW028330
*                                    EXEMPTED)                          FW028340
              DS    XL1            SPARE                     TK1000     FW028340
FW03QTITM&CG1 DS    0XL3           TAX EXEMPT ITEM           TK1000     FW028320
FW03QTIND&CG1 DS    XL1            TAX EXEMPT INDICATOR      TK1000     FW028320
FW03QTTEC&CG1 DS    CL2            TAX CODE TO BE EXEMPTED              FW028350
*********************************************************************** FW028360
** END OF TAX EXEMPT SECTION                                         ** FW028370
*********************************************************************** FW028380
FW03ETE&CG1   EQU  *               END OF TAX EXEMPT SECTION            FW028390
          EJECT                                                         FW028090
*********************************************************************** FW028100
*********************************************************************** FW028110
**                                                                   ** FW028120
** SECTION INFORMATION:                                              ** FW028130
**                                                                   ** FW028140
** TYPE:        QUERY                                                ** FW028150
** NAME:        INCLUDE DU TAX SECTION                               ** FW028160
** IDENTIFIER:  T                                                    ** FW028170
**                                                                   ** FW028180
** PRIME KEY:   X'38'                                                ** FW028190
** ITEM ID:     TD                                                   ** FW028200
** UNIQUE KEY:  X'0000'                                              ** FW028210
**                                                                   ** FW028220
** PURPOSE:     THIS SECTION IS USED TO SUPPLY DU TAX                ** FW028230
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW028240
**                                                                   ** FW028250
**              FQ..., $B..., AND $Q...                              ** FW028260
**                                                 TK-KOLAYBILET     ** FW028270
*********************************************************************** FW028280
*********************************************************************** FW028290
          ORG  FW03USR&CG1                                              FW028300
*                                                                       FW028310
FW03QTDUI&CG1 DS    XL10           DU AMOUNT                            FW028320
*********************************************************************** FW028360
** END OF DU TAX     SECTION                                         ** FW028370
*********************************************************************** FW028380
FW03ETD&CG1   EQU  *               END OF DU TAX  SECTION               FW028390
          EJECT                                                         FW028400
*********************************************************************** FW028100
*********************************************************************** FW028110
**                                                                   ** FW028120
** SECTION INFORMATION:                                              ** FW028130
**                                                                   ** FW028140
** TYPE:        QUERY                                                ** FW028150
** NAME:        INCLUDE GRP SSRREAL ...  GRMS INFO                   ** FW028160
** IDENTIFIER:  T                                                    ** FW028170
**                                                                   ** FW028180
** PRIME KEY:   X'38'                                                ** FW028190
** ITEM ID:     GR                                                   ** FW028200
** UNIQUE KEY:  X'0000'                                              ** FW028210
**                                                                   ** FW028220
** PURPOSE:     THIS SECTION IS USED TO SUPPLY SSRREAL ...           ** FW028230
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW028240
**                                                                   ** FW028250
**              FQ...,                                               ** FW028260
**                                                 TK-PRC.GRMS       ** FW028270
*********************************************************************** FW028280
*********************************************************************** FW028290
          ORG  FW03USR&CG1                                              FW028300
*                                                                       FW028310
FW03QGRAM&CG1 DS    XL50           SSRREAL LINE                         FW028320
*********************************************************************** FW028360
** END OF GR         SECTION                                         ** FW028370
*********************************************************************** FW028380
FW03EGR&CG1   EQU  *               END OF SSR INFO  SECTION             FW028390
          EJECT                                                         FW028400
*********************************************************************** FW028100
*********************************************************************** FW028110
**                                                                   ** FW028120
** SECTION INFORMATION:                                              ** FW028130
**                                                                   ** FW028140
** TYPE:        QUERY                                                ** FW028150
** NAME:        INCLUDE *RP100 PERCENTAGE AMOUNT                     ** FW028160
** IDENTIFIER:  T                                                    ** FW028170
**                                                                   ** FW028180
** PRIME KEY:   X'38'                                                ** FW028190
** ITEM ID:     RP                                                   ** FW028200
** UNIQUE KEY:  X'0000'                                              ** FW028210
**                                                                   ** FW028220
** PURPOSE:     THIS SECTION IS USED TO SUPPLY PERCENTAGE FOR        ** FW028230
**              THE *RP...  PARAMETER                                ** FW028240
**                                                                   ** FW028250
**    SIMDILIK IPTAL                               TK-PRICING        ** FW028270
*********************************************************************** FW028280
*********************************************************************** FW028290
          ORG  FW03USR&CG1                                              FW028300
*                                                                       FW028310
FW03QTRPP&CG1 DS    XL2            RP PERCENTAGE                        FW028320
FW03QTRPI&CG1 DS    XL10           RP PERCENTAGE                        FW028320
*********************************************************************** FW028360
** END OF RP PERCENTAGE SECTION                                      ** FW028370
*********************************************************************** FW028380
FW03ERP&CG1   EQU  *               END OF RP                            FW028390
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE FARE CALCULATION FOR REPRICING               **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     FK                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY FARE CALCULATION      **
**              INFORMATION FOR REPRICING (AUTH.REISSUE FQ).         **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QFKQN&CG1  DS   XL1            QUOTE NUMBER
FW03QFKSC&CG1  DS   XL4            FARE CALCULATION MODE INDICATOR
FW03QFKSO&CG1  DS   XL1            FARE SOURCE CODE
*                                  00  -  OTHER SYSTEMS
*                                  01  -  TK SYSTEM
               DS   XL3            SPARE
FW03QFKBR&CG1  DS   XL2            FC CHAR COUNT
FW03QFKFC&CG1  DS   XL1            FARE CALCULATION (VARIABLE FIELD)
***********************************************************************
** END OF (FK) FARE CALCULATION SECTION                              **
***********************************************************************
FW03EFK&CG1   EQU  *               END OF (FK) FARE CALCUATION SECTION
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE ORIGINAL ISSUE DETAILS                       **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     OG                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ORIGINAL ISSUE        **
**              DETAILS  FOR REPRICING (AUTH.REISSUE FQ).            **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QOGQN&CG1  DS   XL1            QUOTE NUMBER
               DS   XL3            SPARE
FW03QOGCT&CG1  DS   XL2            OG SECTION CHAR COUNT
FW03QOGOR&CG1  DS   XL1            ORIGINAL ISSUE   (VARIABLE FIELD)
***********************************************************************
** END OF (OG)                                                       **
***********************************************************************
FW03EOG&CG1   EQU  *               END OF (OG) ORIGINAL ISSUE
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE ISSUED IN EXCHANGE FOR                       **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     IE                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ISSUED IN EXCHANGE FOR**
**              DETAILS  FOR REPRICING (AUTH.REISSUE FQ).            **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QIEQN&CG1  DS   XL1            QUOTE NUMBER
               DS   XL5            SPARE
FW03QIESL&CG1  DS   0XL16          ORIGINAL DOC SLOT MAX 4.
FW03QIED1&CG1  DS   XL13           ORIGINAL DOC 1  NUMBER
FW03QIET1&CG1  DS   XL3            ORIGINAL DOC 1  TYPE
FW03QIED2&CG1  DS   XL13           ORIGINAL DOC 2  NUMBER
FW03QIET2&CG1  DS   XL3            ORIGINAL DOC 2  TYPE
FW03QIED3&CG1  DS   XL13           ORIGINAL DOC 3  NUMBER
FW03QIET3&CG1  DS   XL3            ORIGINAL DOC 3  TYPE
FW03QIED4&CG1  DS   XL13           ORIGINAL DOC 4  NUMBER
FW03QIET4&CG1  DS   XL3            ORIGINAL DOC 4  TYPE
***********************************************************************
** END OF (FK) FARE CALCULATION SECTION                              **
***********************************************************************
FW03EIE&CG1   EQU  *               END OF (IE) ISSUED IN EXCHANGE FOR
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE ENDRSEMENT  FOR REPRICING                    **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     EN                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ENDORSEMENT           **
**              INFORMATION FOR REPRICING (AUTH.REISSUE FQ).         **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QENQN&CG1  DS   XL1            QUOTE NUMBER
               DS   XL4            SPARE
FW03QENBR&CG1  DS   XL2            ENDORSMENT  CHAR COUNT
FW03QENFC&CG1  DS   XL1            ENDORSMENT AREA  (VARIABLE FIELD)
***********************************************************************
** END OF (EN) ENDORSMENT                                            **
***********************************************************************
FW03EEN&CG1   EQU  *               END OF EN SECTION
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE PRICING INFO                                 **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     IP                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY PRICING               **
**              INFORMATION FOR REPRICING (AUTH.REISSUE FQ).         **
**                                                                   **
**                                                                   **
**                                                 TK-P016508        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QIPQN&CG1  DS   XL1            QUOTE NUMBER
               DS   XL4            SPARE
FW03QIPBR&CG1  DS   XL2            PRICING INFO CHAR COUNT
FW03QIPFC&CG1  DS   XL1            PRIC.INFO  AREA  (VARIABLE FIELD)
*
**FW03QIPQN&CG1  DS   XL1            QUOTE NUMBER
**               DS   XL4            SPARE
**FW03QIPBR&CG1  DS   XL8            GENERAL INDICATOR AREA
*                                   BYTE 0 - DISPLAY INFO ON PNR
*                                   BYTE 1 - DISPLAY INFO ON ETKT
*                                   BYTE 3 - SPARE (BLANK)
*                                   BYTE 4 - SPARE (BLANK)
*                                   BYTE 5 - SPARE (BLANK)
*                                   BYTE 6 - SPARE (BLANK)
*                                   BYTE 7 - SPARE (BLANK)
*                                   BYTE 8 - SPARE (BLANK)
**FW03QIPBC&CG1  DS   XL2            PRICING INFO CHAR COUNT
**               DS   XL1            SPARE
**FW03QIPFC&CG1  DS   CL52           PRIC.INFO  AREA  (VARIABLE FIELD)
***********************************************************************
** END OF (EN) ENDORSMENT                                            **
***********************************************************************
FW03EIP&CG1   EQU  *               END OF IP SECTION
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE MONETARY AMAOUNT                             **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     MN                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY FARE AMAOUNT          **
**              INFORMATION FOR REPRICING (AUTH.REISSUE FQ).         **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QMNQN&CG1  DS   XL1            QUOTE NUMBER
FW03QMNAN&CG1  DS   X              NUMBER OF AMOUNT FIELDS
FW03QMNAL&CG1  DS   0XL15          AMOUNT ITEM SECTION FIXED LENGTH
FW03QMNTY&CG1  DS   XL2            AMOUNT TYPE
FW03QMNAM&CG1  DS   XL10           AMOUNT
FW03QMNCU&CG1  DS   XL3            CURRENCY TYPE
***********************************************************************
** END OF (MN) FARE AMAOUNT INFO                                     **
***********************************************************************
FW03EMN&CG1   EQU  *               END OF (MN) FARE INFO
          EJECT                                                         FW028400
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        INCLUDE TAX DETAILS                                  **
** IDENTIFIER:  T                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     XT                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     THIS SECTION IS USED TO SUPPLY TAX DETAILS           **
**              INFORMATION FOR REPRICING (AUTH.REISSUE FQ).         **
**                                                                   **
**                                                                   **
**                                                 TK-PRICING        **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1
*
FW03QXTQN&CG1  DS   XL1            QUOTE NUMBER
FW03QXTAN&CG1  DS   X              NUMBER OF TAX ITEMS
FW03QXTAL&CG1  DS   0XL18          TAX ITEM SECTION FIXED LENGTH
FW03QXTAM&CG1  DS   XL10           TAX AMOUNT
FW03QXTTY&CG1  DS   XL2            TAX TYPE
FW03QXTCU&CG1  DS   XL3            TAX CURRENCY TYPE
FW03QXTPN&CG1  DS   XL3            TAX PAID/NON-PAID
***********************************************************************
** END OF (MN) FARE AMAOUNT INFO                                     **
***********************************************************************
FW03EXT&CG1   EQU  *               END OF (MN) FARE INFO
          EJECT
*********************************************************************** FW028410
*********************************************************************** FW028420
**                                                                G03** FW028430
** SECTION INFORMATION:                                           G03** FW028440
**                                                                G03** FW028450
** TYPE:        QUERY                                             G03** FW028460
** NAME:        VENDOR ACTION CODE                                G03** FW028470
** IDENTIFIER:  V                                                 G03** FW028480
**                                                                G03** FW028490
** PRIME KEY:   X'38'                                             G03** FW028500
** ITEM ID:     VA                                                G03** FW028510
** UNIQUE KEY:  X'0000'                                           G03** FW028520
**                                                                G03** FW028530
** PURPOSE:     THIS SECTION IS USED FOR THE INPUT ACTION CODE    G03** FW028540
**              FROM THE VENDOR FOR BILLING PURPOSES ONLY.  THIS  G03** FW028550
**              FORMAT IS THE HOST SYSTEM'S ACTION CODE SO THAT   G03** FW028560
**              FINANCE CAN RETURN TO THE VENDOR THEIR ACTION     G03** FW028570
**              CODE WITH THE BILLING STATEMENT.                  G03** FW028580
**                                                                G03** FW028590
*********************************************************************** FW028600
*********************************************************************** FW028610
          ORG  FW03USR&CG1                                        G03   FW028620
FW03QVTRN&CG1 DS   CL6          ALPHANUMERIC TRANSACTION CODE  G03      FW028630
*********************************************************************** FW028640
** END OF VENDOR ACTION CODE SECTION                              G03** FW028650
*********************************************************************** FW028660
FW03EVA&CG1  EQU  *                END OF VENDOR ACTION CODE      G03   FW028670
*                                                                       FW028680
*********************************************************************** FW028690
*********************************************************************** FW028700
**                                                                   ** FW028710
** SECTION INFORMATION:                                              ** FW028720
**                                                                   ** FW028730
** TYPE:        QUERY                                                ** FW028740
** NAME:        TAX INFORMATION SECTION                              ** FW028750
** IDENTIFIER:  X                                                    ** FW028760
**                                                                   ** FW028770
** PRIME KEY:   X'38'                                                ** FW028780
** ITEM ID:     TX                                                   ** FW028790
** UNIQUE KEY:  X'0000'                                              ** FW028800
**                                                                   ** FW028810
** PURPOSE:     PROVIDE INFORMATION FOR àTAX ENTRY.  THIS SECTION IS ** FW028820
**              OPTIONAL.                                            ** FW028830
**                                                                   ** FW028840
*********************************************************************** FW028850
*********************************************************************** FW028860
          ORG  FW03USR&CG1                                              FW028870
FW03QXCNT&CG1  DS   C              COUNTRY CODE OR NAME                 FW028880
*********************************************************************** FW028890
** END OF TAX INFORMATION SECTION                                    ** FW028900
*********************************************************************** FW028910
FW03ETX&CG1  EQU  *                END OF TAX INFORMATION SECTION       FW028920
          EJECT                                                         FW028930
*********************************************************************** FW028940
*********************************************************************** FW028950
**                                                                   ** FW028960
** SECTION INFORMATION:                                              ** FW028970
**                                                                   ** FW028980
** TYPE:        QUERY                                                ** FW028990
** NAME:        PRIVATE FARE INFORMATION                             ** FW029000
** IDENTIFIER:  Z                                                    ** FW029010
**                                                                   ** FW029020
** PRIME KEY:   X'38'                                                ** FW029030
** ITEM ID:     PV                                                   ** FW029040
** UNIQUE KEY:  X'0000' - IF 0, THEN APPLIES TO ENTIRE ENTRY.        ** FW029050
**                        OTHERWISE, IS SEGMENT APPLICABILITY BIT    ** FW029060
**                        MAP, I.E., X'8000' IS SEGMENT 1, X'4000'   ** FW029070
**                        IS SEGMENT 2, ETC.                         ** FW029080
**                                                                   ** FW029090
** PURPOSE:     PROVIDE PRIVATE FARE INFORMATION FOR INPUT           ** FW029100
**                                                                   ** FW029110
*********************************************************************** FW029120
*********************************************************************** FW029130
          ORG  FW03USR&CG1                                              FW029140
*                                                                       FW029150
FW03QZACC&CG1  DS   XL6            ACCOUNT CODE                         FW029160
FW03QZPSC&CG1  DS   XL4            PSEUDO CTY                           FW029170
FW03QZCRS&CG1  DS   X              CRS EQUATE                           FW029180
* NOTE: SEE FW03QHCRS FOR EQUATE VALUES                                 FW029190
FW03QZCON&CG1  DS   XL8            CONTRACT CODE                        FW029200
*********************************************************************** FW029210
** END OF PRIVATE FARES INFORMATION                                  ** FW029220
*********************************************************************** FW029230
FW03EPV&CG1  EQU  *                END OF PRIVATE FARES INFORMATION     FW029240
          EJECT                                                         FW029250
*********************************************************************** FW029260
*********************************************************************** FW029270
**                                                                   ** FW029280
** SECTION INFORMATION:                                              ** FW029290
**                                                                   ** FW029300
** TYPE:        RESPONSE                                             ** FW029310
** NAME:        HEADER                                               ** FW029320
** IDENTIFIER:  H                                                    ** FW029330
**                                                                   ** FW029340
** PRIME KEY:   X'38'                                                ** FW029350
** ITEM ID:     RH                                                   ** FW029360
** UNIQUE KEY:  X'0000'                                              ** FW029370
**                                                                   ** FW029380
** PURPOSE:     RESPONSE HEADER THAT ACCOMPANIES EACH RESPONSE.      ** FW029390
**                                                                   ** FW029400
*********************************************************************** FW029410
*********************************************************************** FW029420
          ORG  FW03USR&CG1                                              FW029430
FW03RHCCT&CG1  DS   XL2            CHARACTER COUNT OF TOTAL MESSAGE     FW029440
*                                                                       FW029450
*                                                                       FW029460
* THE FOLLOWING TWO INDICATORS ARE GENERAL SERVICE LEVEL                FW029470
* INDICATORS.  THEY MAY NOT BE REDEFINED.                               FW029480
*                                                                       FW029490
FW03RHIND1&CG1 DS   X              RESPONSE IND. 1                      FW029500
*              B'0 1 2 3 4 5 6 7'                                       FW029510
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW029520
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW029530
*                | | | | | | NGGF (NEXT GENER) IFQ RESPONSE    ETKTT001
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW029550
*                ¦ ¦ ¦ ¦ SPARE                                          FW029560
*                ¦ ¦ ¦ SPARE                                            FW029570
*                ¦ ¦ AGEBT ALERT BEING RETURNED (MM)                G03 FW029580
*                ¦ ERROR MESSAGE BEING RETURNED                         FW029590
*                CRT (OM) OUTPUT RETURNED                               FW029600
*                                                                       FW029610
#FW03RHCRT&CG1 EQU  X'80'               CRT (OM) OUTPUT RETURNED        FW029620
#FW03RHERR&CG1 EQU  X'40'               ERROR MESSAGE BEING RETURNED    FW029630
#FW03RHALT&CG1 EQU  X'20'               AGENT ALERT BEING RETURNED  G03 FW029640
#FW03RHPF3&CG1 EQU  X'04'               FOR LLPF FIC, NO IFQ FARES ETKT
*                                                                       FW029650
FW03RHIND2&CG1 DS   X                   RESPONSE IND. 2                 FW029660
*              B'0 1 2 3 4 5 6 7'                                       FW029670
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW029680
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ AVAILABLE                                FW029690
*                ¦ ¦ ¦ ¦ ¦ ¦ LAST $V FROM IFQ (IF ZERO, FROM FQS)       FW029700
*                ¦ ¦ ¦ ¦ ¦ LAST $B FROM IFQ (IF ZERO, FROM FQS)         FW029710
*                ¦ ¦ ¦ ¦ LAST $D FROM IFQ (IF ZERO, FROM FQS)           FW029720
*                ¦ ¦ ¦ LAST FQ FROM IFQ (IF ZERO, FROM FQS)             FW029730
*                ¦ ¦ LAST F0 FROM IFQ (IF ZERO, FROM FQS)               FW029740
*                ¦ SPARE                                                FW029750
*                0 = IFQ ONLY OR MIXED ITINERARY                        FW029760
*                1 = FQS ONLY ITINERARY                                 FW029770
*                                                                       FW029780
#FW03RHFQS&CG1  EQU   X'80'        FQS ONLY ITINERARY QUOTED            FW029790
#FW03RHIF0&CG1  EQU   X'20'        LAST F0 FROM IFQ                     FW029800
#FW03RHIFQ1&CG1 EQU   X'10'        LAST FQ FROM IFQ (FROM LADDER)       FW029810
#FW03RHIFD&CG1  EQU   X'08'        LAST FD FROM IFQ                     FW029820
#FW03RHIFQ2&CG1 EQU   X'04'        LAST FQ FROM IFQ (FROM ITIN)         FW029830
#FW03RHIFN&CG1  EQU   X'02'        LAST FN FROM IFQ                     FW029840
*                                                                       FW029850
*                                                                       FW029860
* THE FOLLOWING TWO INDICATORS ARE APPLICATION INDICATORS SPECIFIC      FW029870
* TO EACH APPLICATION.  THEY MAY BE REDEFINED FOR EACH ENTRY TYPE.      FW029880
*                                                                       FW029890
FW03RHAIN1&CG1 DS   X                   APPLICATIONS INDICATOR 1        FW029900
*********************************************************************** FW029910
*  START OF APPLICATIONS INDICATOR 1 DEFINITIONS FOR $B..., FQ..., $Q.* FW029920
*********************************************************************** FW029930
*              B'0 1 2 3 4 5 6 7'                                       FW029940
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW029950
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW029960
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW029970
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW029980
*                ¦ ¦ ¦ ¦ APPEND: BSP NOT APPLICABLE                     FW029990
*                ¦ ¦ ¦ APPEND: A/L NOT APPLICABLE                       FW030000
*                ¦ ¦ APPEND: NOT APPLICABLE                             FW030010
*                ¦ APPEND: MAY APPLY                                    FW030020
*                CANNOT OVERRIDE PFC COLLECTION W/ TAX                  FW030030
*                                                                       FW030040
#FW03RGFO0&CG1 EQU  X'80'     CANNOT OVERRIDE PFC COLLECTION WITH TAX   FW030050
*                        EXEMPT MODIFIER (WHEN CRT IS IN USA)           FW030060
*                                                                       FW030070
*  THE FOLLOWING 4 INDICATORS RESULT IN THE FIXED MESSAGE               FW030080
*  "US PASSENGER FACILITY CHARGE:"  PLUS THE INDICATED APPENDED MSG     FW030090
*                                                                       FW030100
#FW03RGFO1&CG1 EQU  X'40'     MAY APPLY                                 FW030110
#FW03RGFO2&CG1 EQU  X'20'     NOT APPLICABLE                            FW030120
#FW03RGFO3&CG1 EQU  X'10'     A/L NOT APPLICABLE                        FW030130
#FW03RGFO4&CG1 EQU  X'08'     BSP NOT APPLICABLE                        FW030140
*********************************************************************** FW030150
*  END OF APPLICATIONS INDICATOR 1 DEFINITIONS FOR FQ..., $B..., $Q...* FW030160
*********************************************************************** FW030170
FW03RHAIN2&CG1 DS   X                   APPLICATIONS INDICATOR 2        FW030180
*********************************************************************** FW030190
*  START OF APPLICATIONS INDICATOR 2 DEFINITIONS FOR $B..., FQ..., $Q.* FW030200
*********************************************************************** FW030210
*                                                                       FW030220
*********************************************************************** FW030230
*  END OF APPLICATIONS INDICATOR 2 DEFINITIONS FOR FQ..., $B..., $Q...* FW030240
*********************************************************************** FW030250
FW03RHWFA&CG1  DS   XL4                 WFA ADDRESS - DO NOT USE        FW030260
*********************************************************************** FW030270
** END OF RESPONSE HEADER SECTION                                    ** FW030280
*********************************************************************** FW030290
FW03ERH&CG1  EQU  *                   END OF RESPONSE HEADER            FW030300
          EJECT                                                         FW030310
*********************************************************************** FW030320
*********************************************************************** FW030330
**                                                                   ** FW030340
** SECTION INFORMATION:                                              ** FW030350
**                                                                   ** FW030360
** TYPE:        RESPONSE                                             ** FW030370
** NAME:        CRT TYPE RESPONSE                                    ** FW030380
** IDENTIFIER:  3                                                    ** FW030390
**                                                                   ** FW030400
** PRIME KEY:   X'38'                                                ** FW030410
** ITEM ID:     OM                                                   ** FW030420
** UNIQUE KEY:  X'0000'                                              ** FW030430
**                                                                   ** FW030440
** PURPOSE:     NORMAL CRT TYPE RESPONSE, I.E., NOT STRUCTURED DATA. ** FW030450
**                                                                   ** FW030460
*********************************************************************** FW030470
*********************************************************************** FW030480
          ORG  FW03USR&CG1                                              FW030490
*                                                                       FW030500
FW03R3OMG&CG1  EQU  *              START OF OUTPUT MESSAGE              FW030510
*********************************************************************** FW030520
** END OF OUTPUT MESSAGE SECTION                                     ** FW030530
*********************************************************************** FW030540
FW03EOM&CG1  EQU  *                END OF OUTPUT MESSAGE SECTION        FW030550
          EJECT                                                         FW030560
*********************************************************************** FW030570
*********************************************************************** FW030580
**                                                                   ** FW030590
** SECTION INFORMATION:                                              ** FW030600
**                                                                   ** FW030610
** TYPE:        RESPONSE                                             ** FW030620
** NAME:        AUXILIARY MILEAGE / LEG MILEAGE PRIMARY ITEM         ** FW030630
** IDENTIFIER:  5                                                    ** FW030640
**                                                                   ** FW030650
** PRIME KEY:   X'38'                                                ** FW030660
** ITEM ID:     MP                                                   ** FW030670
** UNIQUE KEY:  X'0000'                                              ** FW030680
**                                                                   ** FW030690
** PURPOSE:     THIS SECTION IS USED TO SUPPLY PRIMARY REPLY INFO    ** FW030700
**              FOR MILEAGE LEG AND AUXILIARY DISPLAYS.              ** FW030710
**                                                                   ** FW030720
*********************************************************************** FW030730
*********************************************************************** FW030740
          ORG  FW03USR&CG1                                              FW030750
*                                                                       FW030760
FW03R5OCTY&CG1 DS   CL3            ORIGIN CITY                          FW030770
               DS   C              RESERVED FOR CITY CODE EXPANISON     FW030780
FW03R5OSAT&CG1 DS   CL3            SATELLITE CITY                       FW030790
               DS   C              RESERVED FOR CITY CODE EXPANISON     FW030800
FW03R5LDTE&CG1 DS   XL2            (TRAVEL) DATE REQUESTED (PARS)       FW030810
FW03R5LTKD&CG1 DS   XL2            TICKET DATE REQUESTED (PARS)         FW030820
FW03R5LCAR&CG1 DS   CL2            CARRIER CODE                         FW030830
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW030840
FW03R5PGDI&CG1 DS   CL2            GLOBAL DIRECTION REQUESTED           FW030850
FW03R5MLI0&CG1 DS   X              INDICATORS                           FW030860
*                                                                       FW030870
#FW03R5CXS&CG1 EQU  X'80'          CARRIER SPECIFIED                    FW030880
#FW03R5GDS&CG1 EQU  X'40'          GLOBAL DIRECTION AGENT SPECIFIED     FW030890
#FW03R5DTS&CG1 EQU  X'20'          TRAVEL DATE SPECIFIED                FW030900
#FW03R5TKS&CG1 EQU  X'10'          TICKET DATE SPECIFIED                FW030910
#FW03R5NOD&CG1 EQU  X'08'          MILEAGE DATA INCOMPLETE OR INVALID   FW030920
#FW03R5INT&CG1 EQU  X'04'          INTERMEDIATE POINT TRANSITTED        FW030930
*********************************************************************** FW030940
** END OF MILEAGE PRIMARY ITEM SECTION                               ** FW030950
*********************************************************************** FW030960
FW03EMP&CG1  EQU  *                END OF MILEAGE PRIMARY ITEM SECTION  FW030970
          EJECT                                                         FW030980
*********************************************************************** FW030990
*********************************************************************** FW031000
**                                                                   ** FW031010
** SECTION INFORMATION:                                              ** FW031020
**                                                                   ** FW031030
** TYPE:        RESPONSE                                             ** FW031040
** NAME:        AUXILIARY MILEAGE / LEG MILEAGE SUB-ITIN ITEM        ** FW031050
** IDENTIFIER:  6                                                    ** FW031060
**                                                                   ** FW031070
** PRIME KEY:   X'38'                                                ** FW031080
** ITEM ID:     MS                                                   ** FW031090
** UNIQUE KEY:  X'0000'                                              ** FW031100
**                                                                   ** FW031110
** PURPOSE:     THIS SECTION IS USED TO SUPPLY SUB-ITIN REPLY INFO   ** FW031120
**              FOR MILEAGE LEG AND AUXILIARY DISPLAYS.              ** FW031130
**                                                                   ** FW031140
*********************************************************************** FW031150
*********************************************************************** FW031160
          ORG  FW03USR&CG1                                              FW031170
*                                                                       FW031180
FW03R6LCTY&CG1 DS   CL3            NEXT CITY                            FW031190
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW031200
FW03R6OSAT&CG1 DS   CL3            SATELLITE CITY                       FW031210
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW031220
FW03R6MLI1&CG1 DS   X              INDICATORS                           FW031230
#FW03R6SAM&CG1 EQU  X'80'          SOUTH ATLANTC PROVISION APPLIES      FW031240
#FW03R6GAP&CG1 EQU  X'40'          GAP FROM LAST CITY TO THIS CITY      FW031250
#FW03R6NEG&CG1 EQU  X'20'          NEGATVE MILEAGE EXISTS THIS CTY PAIR FW031260
#FW03R6DOM&CG1 EQU  X'10'          DOMESTIC CITY PAIR                   FW031270
#FW03R6PSS&CG1 EQU  X'08'          PERMISSIBLE SURFACE SECTOR           FW031280
#FW03R6NGP&CG1 EQU  X'04'          AGENT INPUT GAP BETWEEN CITIES       FW031290
#FW03R6PRC&CG1 EQU  X'02'          CITY BEFORE LAST USED AS CITY 1-SAM  FW031300
*                                                                       FW031310
FW03R6MLI2&CG1 DS   X              INDICATORS                           FW031320
#FW03R6RTE&CG1 EQU  X'80'          SPECIFIED ROUTING EXCEPTION APPLIES  FW031330
#FW03R6CEX&CG1 EQU  X'40'          MILEAGE EXCEPTION APPLIES            FW031340
#FW03R6NCX&CG1 EQU  X'20'          CARRIER SPECIFIC EXCEPTION EXISTS    FW031350
#FW03R6MPD&CG1 EQU  X'10'          MPM DEDUCTION                        FW031360
#FW03R6TPD&CG1 EQU  X'08'          TPM DEDUCTION EXISTS (EMA)           FW031370
#FW03R6NOT&CG1 EQU  X'04'          TPM DATA MISSING FOR CITY PAIR       FW031380
#FW03R6NOM&CG1 EQU  X'02'          MPM DATA MISSING FOR CITY PAIR       FW031390
               DS   X              SPARE                                FW031400
*                                                                       FW031410
FW03R6LTPM&CG1 DS   XL2            TPM FROM LAST CITY TO THIS CITY      FW031420
FW03R6LMPM&CG1 DS   XL2            MPM FROM ORIGIN TO THIS CITY         FW031430
FW03R6LGDI&CG1 DS   CL2            GLOBAL DIRECTION                     FW031440
FW03R6LEXA&CG1 DS   XL2            EXCEPTION AMOUNT                     FW031450
*                                                                       FW031460
#FW03R6LN1&CG1 EQU  *-FW03REC&CG1  LENGTH 1 OF MILEAGE SUB-ITIN DATA    FW031470
*                                                                       FW031480
FW03R6QCT&CG1  DS   0XL12          THIS AREA EXISTS IF #FW03R6CEX=1     FW031490
FW03R6CT1A&CG1 DS   CL3            CITY 1 WHICH QUALIFIES FOR EXCEPTION FW031500
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW031510
FW03R6CT2A&CG1 DS   CL3            CITY 2 WHICH QUALIFIES FOR EXCEPTION FW031520
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW031530
FW03R6CT3A&CG1 DS   CL3            CITY 3 WHICH QUALIFIES FOR EXCEPTION FW031540
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW031550
*********************************************************************** FW031560
** END OF MILEAGE AUXILIARY ITEM SECTION                             ** FW031570
*********************************************************************** FW031580
FW03EMS&CG1  EQU *                 END OF MILEAGE AUXILIARY SECTION     FW031590
          EJECT                                                         FW031600
*********************************************************************** FW031610
*********************************************************************** FW031620
**                                                                   ** FW031630
** SECTION INFORMATION:                                              ** FW031640
**                                                                   ** FW031650
** TYPE:        RESPONSE                                             ** FW031660
** NAME:        SURCHARGES                                           ** FW031670
** IDENTIFIER:  7                                                    ** FW031680
**                                                                   ** FW031690
** PRIME KEY:   X'38'                                                ** FW031700
** ITEM ID:     SU                                                   ** FW031710
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1.                    ** FW031720
**                                                                   ** FW031730
** PURPOSE:     1 SECTION MAY EXIST FOR EACH IS/GRI LREC.            ** FW031740
**                                                                   ** FW031750
**              THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING  ** FW031760
**              ENTRIES:                                             ** FW031770
**                                                                   ** FW031780
**              FQ..., àB..., AND àQ...                              ** FW031790
**                                                                G03** FW031800
*********************************************************************** FW031810
*********************************************************************** FW031820
          ORG  FW03USR&CG1                                              FW031830
FW03R7QNB&CG1  DS   X                   QUOTE NUMBER                    FW031840
FW03R7SEG&CG1  DS   X                   ITINERARY SEGMENT NUMBER FROM I FW031850
*                                    RELATED SECTION                    FW031860
FW03R7SUT&CG1  DS   X                   SURCHARGE TYPE                  FW031870
#FW03R7WKE&CG1 EQU  X'01'               WEEKEND SURCHARGE               FW031880
#FW03R7SOP&CG1 EQU  X'02'               STOPOVER SURCHARGE              FW031890
#FW03R7GSS&CG1 EQU  X'03'               GERMAN SENATE SURCHARGE         FW031900
#FW03R7CUM&CG1 EQU  X'04'               CUMULATIVE SURCHARGE            FW031910
#FW03R7QQQ&CG1 EQU  X'05'               Q FUEL SURCHARGE                FW031920
*                                                                       FW031930
FW03R7NCM&CG1  DS   X                   NUMBER OF STOPOVERS IF CUMULATI FW031940
*                                    SURCHARGE                          FW031950
FW03R7AMT&CG1  DS   PL4                 PACKED SURCHARGE AMOUNT         FW031960
FW03R7CUR&CG1  DS   CL3                 CURRENCY CODE                   FW031970
FW03R7DEC&CG1  DS   X                   NUMBER OF DECIMAL PLACES        FW031980
*                                                                       FW031990
*********************************************************************** FW032000
** END OF SURCHARGE INFORMATION                                      ** FW032010
*********************************************************************** FW032020
FW03ESU&CG1  EQU  *                END OF IFQ SPECIFIC RULES SECTION    FW032030
*********************************************************************** FW032040
*********************************************************************** FW032050
**                                                                   ** FW032060
** SECTION INFORMATION:                                              ** FW032070
**                                                                   ** FW032080
** TYPE:        RESPONSE                                             ** FW032090
** NAME:        CITY INDICATORS FOR FARE COMPONENT                   ** FW032100
** IDENTIFIER:  8                                                    ** FW032110
**                                                                   ** FW032120
** PRIME KEY:   X'38'                                                ** FW032130
** ITEM ID:     CI                                                   ** FW032140
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1.                    ** FW032150
**                                                                   ** FW032160
** PURPOSE:     ONE SECTION MAY EXIST FOR EACH RI/GF7.               ** FW032170
**                                                                   ** FW032180
**              THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING  ** FW032190
**              ENTRIES:                                             ** FW032200
**                                                                   ** FW032210
**              FQ..., àB..., AND àQ...                              ** FW032220
**                                                                G03** FW032230
*********************************************************************** FW032240
*********************************************************************** FW032250
          ORG  FW03USR&CG1                                              FW032260
FW03R8QNB&CG1  DS   X                   QUOTE NUMBER                    FW032270
FW03R8FNB&CG1  DS   X                   FARE COMPONENT NUMBER           FW032280
FW03R8CNB&CG1  DS   X                   NUMBER OF CITY INDICATORS FOLLO FW032290
*                                  THERE IS ONE SET OF INDICATORS FOR   FW032300
*                                  EACH CITY IN THE FARE COMPONENT      FW032310
FW03R8CIN&CG1  DS   0XL2                CITY INDICATORS                 FW032320
*                                                                       FW032330
FW03R8CI1&CG1  DS   X                   CITY INDICATOR 1                FW032340
#FW03R8MAN&CG1 EQU  X'80'               MANDATORY - NO STOPOVER         FW032350
#FW03R8MRP&CG1 EQU  X'40'               MANDATORY ROUTE POINT           FW032360
#FW03R81ST&CG1 EQU  X'20'               CITY W/I 1ST LEVEL SIDE TRIP    FW032370
#FW03R82ST&CG1 EQU  X'10'               CITY W/I 2ND LEVEL SIDE TRIP    FW032380
#FW03R8BRK&CG1 EQU  X'08'               BREAK ALLOWABLE AS OPEN JAW     FW032390
#FW03R8ISS&CG1 EQU  X'04'               COMPONENT INCLUDE SURFACE SECTO FW032400
#FW03R8SSE&CG1 EQU  X'02'               SURFACE SECTOR EXCLUEDED        FW032410
#FW03R8SFP&CG1 EQU  X'01'               SYSTEM GENERATED FICTITIOUS POI FW032420
*                                                                       FW032430
FW03R8CI2&CG1  DS   X                   CITY INDICATOR 2                FW032440
#FW03R8NEG&CG1 EQU  X'80'               NEGATIVE MILEAGE EXCEPTION: MPM FW032450
*                                    REDUCTION POINT                    FW032460
#FW03R8RIO&CG1 EQU  X'40'               RIO/SAO MILEAGE CITY            FW032470
#FW03R8UNS&CG1 EQU  X'20'               UNSPECIFIED EXTRA MILEAGE ALLOW FW032480
#FW03R8SAT&CG1 EQU  X'10'               SOUTH ATLANTIC MILEAGE CITY     FW032490
#FW03R8CDF&CG1 EQU  X'08'               CLASS DIFFERENTIAL         G03  FW032500
*                                                                       FW032510
*********************************************************************** FW032520
** END OF CITY INDICATOR SECTION                                     ** FW032530
*********************************************************************** FW032540
FW03ECI&CG1  EQU  *                END OF IFQ SPECIFIC RULES SECTION    FW032550
*********************************************************************** FW032560
*********************************************************************** FW032570
**                                                                   ** FW032580
** SECTION INFORMATION:                                              ** FW032590
**                                                                   ** FW032600
** TYPE:        RESPONSE                                             ** FW032610
** NAME:        FICTITIOUS BOARD POINTS IN FARE COMPONENT            ** FW032620
** IDENTIFIER:  9                                                    ** FW032630
**                                                                   ** FW032640
** PRIME KEY:   X'38'                                                ** FW032650
** ITEM ID:     FP                                                   ** FW032660
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1.                    ** FW032670
**                                                                   ** FW032680
** PURPOSE:     ONE SECTION MAY EXIST FOR EACH RI/GF7.               ** FW032690
**                                                                   ** FW032700
**              THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING  ** FW032710
**              ENTRIES:                                             ** FW032720
**                                                                   ** FW032730
**              FQ..., àB..., AND àQ...                              ** FW032740
**                                                                G03** FW032750
*********************************************************************** FW032760
*********************************************************************** FW032770
          ORG  FW03USR&CG1                                              FW032780
FW03R9QNB&CG1  DS   X                   QUOTE NUMBER                    FW032790
FW03R9FNB&CG1  DS   X                   FARE COMPONENT NUMBER           FW032800
FW03R9CNB&CG1  DS   X                   NUMBER OF SYSTEM GENERATED      FW032810
*                                    FICTICIOUS BOARD POINTS (MAX 6)    FW032820
FW03R9CIT&CG1  DS   0CL5                FICTITIOUS BOARD POINT          FW032830
FW03R9CTS&CG1  DS   CL3                 CURRENT SHORT 3 BYTE CITY CODE  FW032840
          DS   CL2                 RESERVED FOR CITY CODE EXPANSION     FW032850
*                                                                       FW032860
*********************************************************************** FW032870
** END OF FICTITIOUS BOARD POINT SECTION                             ** FW032880
*********************************************************************** FW032890
FW03EFP&CG1  EQU  *                END OF IFQ SPECIFIC RULES SECTION    FW032900
          EJECT                                                         FW032910
*********************************************************************** FW032930
**                                                                   ** FW032940
** SECTION INFORMATION:                                              ** FW032950
**                                                                   ** FW032960
** TYPE:        RESPONSE                                             ** FW032970
** NAME:        FARE QUOTE TAX BREAKDOWN SECTION                     ** FW032980
** IDENTIFIER:  C                                                    ** FW032990
**                                                                   ** FW033000
** PRIME KEY:   X'38'                                                ** FW033010
** ITEM ID:     TS                                                   ** FW033020
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW033030
**                                                                   ** FW033040
** PURPOSE:     THERE MAY BE ONE OR MORE OF THESE  SECTIONS FOR      ** GF026040
**              EACH PASSENGER DESCRIPTION QUOTED.                   ** GF026050
**              THIS AREA PROVIDES A TAX BREAKDOWN SECTION FOR       ** GF026060
**              SPECIFIC TAX CODES.THIS SECTION SUPPLIES INFORMATION ** GF026070
**              FOR THE FOLLOWING ENTRIES:                           ** GF026080
**                                                                   ** GF026090
**                                                                   ** GF026130
**              FQ..., $B..., AND $Q...                              ** GF026140
**    TK4476                     ADDED BY          FILIZ MATUR       ** GF026150
*********************************************************************** GF025920
          ORG  FW03USR&CG1                                              FW032780
*
FW03RCQNM&CG1 DS   XL1                    QUOTE NUMBER
FW03RCSP1&CG1 DS   XL2                    SPARES
FW03RCCDE&CG1 DS   CL2                    TAX CODE
*
FW03RCSP2&CG1 DS   XL1                   SPARE  FOR TAX CODE EXPANSION
FW03RCCUR&CG1 DS   XL3                    TAX CURRENCY CODE
FW03RCDCP&CG1 DS   XL1                    TAX DECIMAL PLACES
FW03RCIND&CG1 DS   XL1                    SPARE INDICATOR BYTE
FW03RCNMT&CG1 DS   XL1                    NUMBER OF TAXES TO FOLLOW
FW03RCLTI&CG1 DS   0XL12                  LENGTH OF REPEATING TAX ITEM
FW03RCCIT&CG1 DS   CL3                    TAX CITY CODE
FW03RCSP3&CG1 DS   CL2                   SPARES FOR CITY CODE EXPANSION
FW03RCAMT&CG1 DS   PL6                    TAX AMOUNT
FW03RCSP4&CG1 DS   XL1                    SPARES
*********************************************************************** GF025920
** END TAX BREAKDOWN SECTION                 TK4476                  ** GF025930
*********************************************************************** GF025920
FW03ETS&CG1  EQU  *                END OF IFQ SPECIFIC RULES SECTION    FW032900
          EJECT                                                         FW032910
*********************************************************************** FW032930
**                                                                   ** FW032940
** SECTION INFORMATION:                                              ** FW032950
**                                                                   ** FW032960
** TYPE:        RESPONSE                                             ** FW032970
** NAME:        FARE CONSTRUCTION                                    ** FW032980
** IDENTIFIER:  F                                                    ** FW032990
**                                                                   ** FW033000
** PRIME KEY:   X'38'                                                ** FW033010
** ITEM ID:     FC                                                   ** FW033020
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW033030
**                                                                   ** FW033040
** PURPOSE:     THERE WILL BE ONE OR MORE OF THESE SECTIONS FOR      ** FW033050
**              EACH PIC TYPE  QUOTED.  THIS AREA CORRESPONDS TO     ** FW033060
**              THE LINEAR FARE CONSTRUCTION CURRENTLY DISPLAYED     ** FW033070
**              BY APOLLO.  FARE BASIS CODES MAY BE SUPRESSED FROM   ** FW033080
**              DISPLAYING IN THE FARE CONSTRUCTION BY SETTING BIT   ** FW033090
**              FW03QHASV1,#FW03QGNOFB.                              ** FW033100
**              THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING  ** FW033110
**              ENTRIES:                                             ** FW033120
**                                                                   ** FW033130
**              FQ..., $B..., AND $Q...                              ** FW033140
**                                                                   ** FW033150
*********************************************************************** FW033160
*********************************************************************** FW033170
          ORG  FW03USR&CG1                                              FW033180
FW03RFQNB&CG1 DS    X              QUOTE NUMBER                         FW033190
FW03RFFAR&CG1 DS    0C             FARE CONSTRUCTION                    FW033200
*********************************************************************** FW033210
** END OF FARE CONSTRUCTION                                          ** FW033220
*********************************************************************** FW033230
FW03EFC&CG1  EQU  *                END OF FARE CONSTRUCTION             FW033240
         EJECT                                                          FW033250
*********************************************************************** FW033260
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        RESPONSE                                             ** FW033310
** NAME:        GENERAL QUOTE INFORMATION                            ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     GQ                                                   ** FW033360
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW033370
**                                                                   ** FW033380
** PURPOSE:     THERE WILL BE ONE OR MORE OF THESE SECTIONS FOR      ** FW033390
**              EACH PIC TYPE  QUOTED.  IN ALL AMOUNT FIELDS,        ** FW033400
**              DECIMALS WILL BE IN PLACE.  THE FIELDS WILL BE       ** FW033410
**              READY FOR OUTPUT DISPLAY.  THIS SECTION SUPPLIES     ** FW033420
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW033430
**                                                                   ** FW033440
**              FQ..., àB...,  AND àQ...                             ** FW033450
**                                                                   ** FW033460
*********************************************************************** FW033470
*********************************************************************** FW033480
          ORG  FW03USR&CG1                                              FW033490
FW03RGQNB&CG1  DS   X             QUOTE NUMBER                          FW033500
FW03RGQTP&CG1  DS   X             QUOTE TYPE                            FW033510
#FW03RGGAR&CG1 EQU  C'G'          COMPUTER GENERATED GUARANTEED         FW033520
#FW03RGNOG&CG1 EQU  C'C'          COMPUTER GENERATED NOT GUARANTEED     FW033530
#FW03RGMAN&CG1 EQU  C'M'          MANUAL                                FW033540
#FW03RGPRI&CG1 EQU  C'P'          PRIVATE                               FW033550
#FW03RGITT&CG1 EQU  C'W'          INTERNET BASED FARE QUOTE TK1183      FW033550
*                                                                       FW033560
FW03RGLDT&CG1  DS   XL2           LAST DATE TO TICKET                   FW033570
FW03RGDOQ&CG1  DS   XL2           DATE OF QUOTE (PARS FORMAT)           FW033580
FW03RGISI&CG1  DS   CL4           INT'L SALE INDICATOR (SITI/SOTI ETC.) FW033590
FW03RGBFC&CG1  DS   CL3           BASE FARE CURRENCY CODE               FW033600
FW03RGBFA&CG1  DS   PL6           BASE FARE AMOUNT                      FW033610
*                                                                       FW033620
*  IF FQP ENTRY, THE FOLLOWING FIELD MAY HAVE THE 'DF' NUC VALUE   G03  FW033630
*                                                                       FW033640
FW03RGBBC&CG1  DS   PL6           LOWEST FARE AS BOOKED ON A àBBC       FW033650
*                                 OR DF NUC VALUE ON FQP ENTRY     G03  FW033660
FW03RGBDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033670
FW03RGEQC&CG1  DS   CL3           EQUIVALENT CURRENCY CODE              FW033680
FW03RGEQA&CG1  DS   PL6           EQUIVALENT AMOUNT                     FW033690
FW03RGEDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033700
FW03RGTTC&CG1  DS   CL3           TOTAL - CURRENCY CODE                 FW033710
FW03RGTTA&CG1  DS   PL6           TOTAL - AMOUNT (BASE FARE PLUS TAXES) FW033720
FW03RGTDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033730
FW03RGITN&CG1  DS   CL15          IT NUMBER                             FW033740
*                                                                       FW033750
FW03RGMRT&CG1  DS   X             MILEAGE/ROUTE INDICATOR               FW033760
*              B'0 1 2 3 4 5 6 7'                                       FW033770
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW033780
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW033790
*                ¦ ¦ ¦ ¦ ¦ ¦ M25                                        FW033800
*                ¦ ¦ ¦ ¦ ¦ M20                                          FW033810
*                ¦ ¦ ¦ ¦ M15                                            FW033820
*                ¦ ¦ ¦ M10                                              FW033830
*                ¦ ¦ M5                                                 FW033840
*                ¦ M0                                                   FW033850
*                ROUTE BASED QUOTE                                      FW033860
*                                                                       FW033870
#FW03RGRTE&CG1 EQU  X'80'         ROUTE BASED                           FW033880
#FW03RGM00&CG1 EQU  X'40'         M0                                    FW033890
#FW03RGM05&CG1 EQU  X'20'         M5                                    FW033900
#FW03RGM10&CG1 EQU  X'10'         M10                                   FW033910
#FW03RGM15&CG1 EQU  X'08'         M15                                   FW033920
#FW03RGM20&CG1 EQU  X'04'         M20                                   FW033930
#FW03RGM25&CG1 EQU  X'02'         M25                                   FW033940
*                                                                       FW033950
FW03RGPVF&CG1  DS   X                          INDICATOR                FW033960
*              B'0 1 2 3 4 5 6 7'                                       FW033970
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW033980
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ QUOTE BASED ON ADULT PIC             G03 FW033990
*                ¦ ¦ ¦ ¦ ¦ ¦ QUOTE BASED ON PIC CODE RETRND (GFYPIR)G03 FW034000
*                ¦ ¦ ¦ ¦ ¦ NB. IF X'03', THEN UNKNOWN PIC USED      G03 FW034010
*                ¦ ¦ ¦ ¦ SPARE                                          FW034020
*                ¦ ¦ ¦ DIRECTIONAL MINIMUM APPLIES                  G03 FW034030
*                ¦ ¦ FLAT FARE QUOTED FOR ONE OR MORE SEGMENTS          FW034040
*                ¦ PRIVATE FARES OVERRIDES/WAIVERS APPLY                FW034050
*                PRIVATE FARE QUOTED FOR ONE OR MORE SEGMENTS           FW034060
*                                                                       FW034070
#FW03RGPFQO&CG1 EQU X'80'         PRIVATE FARE QUOTED                   FW034080
#FW03RGPFOV&CG1 EQU X'40'         PRIVATE FARE OVERRIDE/WAIVERS APPLY   FW034090
#FW03RGPFFL&CG1 EQU X'20'         PRIVATE FARE FLAT FARE QUOTED         FW034100
#FW03RGDMIN&CG1 EQU X'10'         DIRECTIONAL MINIMUM APPLIES       G03 FW034110
*                                                                       FW034120
*  THE FOLLOWING 2 BITS ARE USED FOR FQP ONLY.  THE BITS SHOULD BE  G03 FW034130
*  CHECKED AS AN ABSOLUTE VALUE.  IF BITS ARE ZERO, THEN QUOTE      G03 FW034140
*  IS BASED ON PIC CODE REQUESTED.                                  G03 FW034150
*                                                                       FW034160
#FW03RGQERR&CG1 EQU X'03'          QUOTE BASED ON UNKNOWN PIC CODE  G03 FW034170
#FW03RGQBPR&CG1 EQU X'02'          QUOTE IS BASED ON PIC CODE       G03 FW034180
*                                  RETURNED (GFYPIR)                G03 FW034190
#FW03RGQBAD&CG1 EQU X'01'          QUOTE IS BASED ON ADULT PIC      G03 FW034200
*                                                                       FW034210
FW03RGTXN&CG1  DS   X             NUMBER OF TAX FIELDS                  FW034220
*TKT-686 FW03RGTXL&CG1  DS   0XL10  TAX ITEM SECTION FIXED LENGTH       FW034230
FW03RGTXL&CG1  DS   0XL14         TAX ITEM SECTION FIXED LENGTH TKT-686 FW034230
FW03RGTXC&CG1  DS   CL2           TAX - COUNTRY CODE                    FW034240
*TKT-686 FW03RGTXA&CG1  DS   CL8           TAX - AMOUNT                 FW034250
FW03RGTXA&CG1  DS   CL12          TAX - AMOUNT                  TKT-686 FW034250
*********************************************************************** FW034260
** END OF GENERAL QUOTE INFORMATION                                  ** FW034270
*********************************************************************** FW034280
FW03EGQ&CG1  EQU  *               END OF GENERAL QUOTE INFORMATION      FW034290
         EJECT                                                          FW034300
*********************************************************************** FW034310
*********************************************************************** FW034320
**                                                                   ** FW034330
** SECTION INFORMATION:                                              ** FW034340
**                                                                   ** FW034350
** TYPE:        RESPONSE                                             ** FW034360
** NAME:        ITINERARY SUMMARY                                    ** FW034370
** IDENTIFIER:  I                                                    ** FW034380
**                                                                   ** FW034390
** PRIME KEY:   X'38'                                                ** FW034400
** ITEM ID:     IS                                                   ** FW034410
** UNIQUE KEY:  SEGMENT NUMBER                                       ** FW034420
**                                                                   ** FW034430
** PURPOSE:     THIS SECTION SUPPLIES ITINERARY INFORMATION.         ** FW034440
**              THERE WILL BE ONE OF THESE SECTIONS FOR EACH         ** FW034450
**              SEGMENT OF THE ITINERARY.  IT IS USED TO SUPPLY      ** FW034460
**              RESPONSE INFORMATION FOR THE FOLLOWING ENTRIES:      ** FW034470
**              FOR THE FOLLOWING ENTRIES:                           ** FW034480
**                                                                   ** FW034490
**              FQ..., $B..., AND $Q...                              ** FW034500
**                                                                   ** FW034510
*********************************************************************** FW034520
*********************************************************************** FW034530
          ORG  FW03USR&CG1                                              FW034540
FW03RICAC&CG1  DS   CL2            CARRIER CODE                         FW034550
               DS   C              RESERVED FOR CARRIER EXPANSION       FW034560
FW03RIFLN&CG1  DS   CL4            FLIGHT NUMBER (LEFT JUST/BLNK FILL)  FW034570
FW03RIDEP&CG1  DS   XL2            DEPARTURE DATE (PARS FORMAT)         FW034580
FW03RIBPT&CG1  DS   CL3            BOARDPOINT                           FW034590
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW034600
FW03RIOPT&CG1  DS   CL3            OFFPOINT                             FW034610
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW034620
FW03RITYP&CG1  DS   X                   SEGMENT TYPE                    FW034630
#FW03RIGND&CG1 EQU  X'01'               GROUND SEGMENT                  FW034640
#FW03RIARN&CG1 EQU  X'02'               ARNK SEGMENT                    FW034650
#FW03RIEXP&CG1 EQU  X'03'               EXPANDED TRANSIT SEGMENT        FW034660
#FW03RIAAS&CG1 EQU  X'04'               AGENT AMENDED SEGMENT           FW034670
#FW03RIAIT&CG1 EQU  X'05'               AGENT INSERTED TRANSIT SEGMENT  FW034680
#FW03RISCX&CG1 EQU  X'06'               SEGMENT CANCELLED               FW034690
#FW03RITSS&CG1 EQU  X'07'               TICKETED SURFACE SEGMENT        FW034700
#FW03RIESS&CG1 EQU  X'08'               EMPTY SEGMENT SLOT              FW034710
*                                                                       FW034720
FW03RICPT&CG1  DS   X                   DAY DIFFERENTIAL                FW034730
FW03RIIDI&CG1  DS   X                   ITINERARY INDICATOR             FW034740
#FW03RINOS&CG1 EQU  X'80'               NO STOPOVER AT BOARD POINT      FW034750
#FW03RIBRJ&CG1 EQU  X'40'               BREAK IN JOURNEY                FW034760
#FW03RIBRD&CG1 EQU  X'20'               BREAK DUE TO NO REASONABLY      FW034770
*                                       DIRECT AIR SERVICE              FW034780
#FW03RIFIP&CG1 EQU  X'10'               FICTITIOUS POINT                FW034790
#FW03RIMDP&CG1 EQU  X'08'               MORE DISTANT POINT              FW034800
#FW03RIFGF&CG1 EQU  X'04'          FQS GENERATED FICTITIOUS POINT   G03 FW034810
#FW03RICCS&CG1 EQU  X'02'          BRD PT & PREV OFF PT IN SAME CTY G03 FW034820
*                                                                       FW034830
FW03RIDPT&CG1  DS   XL2                 DEPARTURE TIME                  FW034840
FW03RIART&CG1  DS   XL2                 ARRIVAL TIME                    FW034850
FW03RISVC&CG1  DS   CL2                 CLASS OF SERVICE            G03 FW034860
*********************************************************************** FW034870
** END OF ITINERARY SUMMARY SECTION                                  ** FW034880
*********************************************************************** FW034890
FW03EIS&CG1  EQU  *                END OF ITINERARY SUMMARY SECTION     FW034900
         EJECT                                                          FW034910
*********************************************************************** FW034920
*********************************************************************** FW034930
**                                                                   ** FW034940
** SECTION INFORMATION:                                              ** FW034950
**                                                                   ** FW034960
** TYPE:        RESPONSE                                             ** FW034970
** NAME:        JOURNEY TYPE INFORMATION                             ** FW034980
** IDENTIFIER:  J                                                    ** FW034990
**                                                                   ** FW035000
** PRIME KEY:   X'38'                                                ** FW035010
** ITEM ID:     JT                                                   ** FW035020
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW035030
**                                                                   ** FW035040
** PURPOSE:     THERE WILL BE ONE OR MORE OF THESE SECTIONS FOR      ** FW035050
**              EACH PIC TYPE  QUOTED.  THIS RECORD WILL EXIST FOR   ** FW035060
**              IFQ TYPE ITINERARIES ONLY. THIS SECTION SUPPLIES     ** FW035070
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW035080
**                                                                   ** FW035090
**              FQ..., àB...,  AND àQ...                             ** FW035100
**                                                                   ** FW035110
*********************************************************************** FW035120
*********************************************************************** FW035130
          ORG  FW03USR&CG1                                              FW035140
FW03RJQNB&CG1  DS   X           QUOTE NUMBER                            FW035150
FW03RJNBR&CG1  DS   X           NUMBER OF JOURNEY TYPE ITEMS FOLLOW     FW035160
*                                                                       FW035170
FW03RJJTI&CG1  DS   0XL3        JOURNEY TYPE ITEM                       FW035180
FW03RJJUR&CG1  DS   X           JOURNEY TYPE                            FW035190
*              B'0 1 2 3 4 5 6 7'                                       FW035200
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW035210
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW035220
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW035230
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW035240
*                ¦ ¦ ¦ ¦ ROUND THE WORLD                                FW035250
*                ¦ ¦ ¦ OPEN JAW                                         FW035260
*                ¦ ¦ ONE WAY                                            FW035270
*                ¦ ROUND TRIP                                           FW035280
*                CIRCLE TRIP                                            FW035290
*                                                                       FW035300
#FW03RJCT&CG1  EQU  X'80'         CIRCLE TRIP                           FW035310
#FW03RJRT&CG1  EQU  X'40'         ROUND TRIP                            FW035320
#FW03RJOW&CG1  EQU  X'20'         ONE WAY                               FW035330
#FW03RJOJ&CG1  EQU  X'10'         OPEN JAW                              FW035340
#FW03RJRW&CG1  EQU  X'08'         ROUND THE WORLD                       FW035350
*                                                                       FW035360
FW03RJFCP&CG1  DS   X             NUMBER OF FARE COMPONENTS             FW035370
*                                                                       FW035380
FW03RJEXT&CG1  DS   X             EXTRA AMOUNT/MSG INDICATOR            FW035390
*              B'0 1 2 3 4 5 6 7'                                       FW035400
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW035410
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW035420
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW035430
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW035440
*                ¦ ¦ ¦ ¦ SPARE                                          FW035450
*                ¦ ¦ ¦ NO BANKERS BUYING RATE HELD                      FW035460
*                ¦ ¦ NOTES APPLY                                    G01 FW035470
*                ¦ STOPOVER SURCHARGE                                   FW035480
*                HIF                                                    FW035490
*                                                                       FW035500
#FW03RGHIF&CG1 EQU  X'80'         HIF                                   FW035510
#FW03RGSTP&CG1 EQU  X'40'         STOPOVER SURCHARGE                    FW035520
*G01#FW03RGNNA&CG1 EQU  X'08'         NO NOTES APPLY                G01 FW035530
*G01#FW03RGNBB&CG1 EQU  X'04'         NO BANKERS BUYING RATE HELD   G01 FW035540
#FW03RGNNA&CG1 EQU  X'20'         NOTES APPLY                       G01 FW035550
#FW03RGNBB&CG1 EQU  X'10'         NO BANKERS BUYING RATE HELD       G01 FW035560
*                                                                       FW035570
*********************************************************************** FW035580
** END OF JOURNEY TYPE INFORMATION                                   ** FW035590
*********************************************************************** FW035600
FW03EJT&CG1    EQU  *             END OF JOURNEY TYPE INFORMATION       FW035610
         EJECT                                                          FW035620
*********************************************************************** FW035630
*********************************************************************** FW035640
**                                                                   ** FW035650
** SECTION INFORMATION:                                              ** FW035660
**                                                                   ** FW035670
** TYPE:        RESPONSE                                             ** FW035680
** NAME:        INFORMATIONAL MESSAGES                               ** FW035690
** IDENTIFIER:  M                                                    ** FW035700
**                                                                   ** FW035710
** PRIME KEY:   X'38'                                                ** FW035720
** ITEM ID:     MM                                                   ** FW035730
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER                         ** FW035740
**                                                                   ** FW035750
** PURPOSE:     THIS SECTION CONTAINS MESSAGES THAT APPLY TO THE     ** FW035760
**              WHOLE ITINERARY OR ENTRY.  IF THERE IS PASSENGER     ** FW035770
**              DESCRIPTION  NUMBER IN THE UNIQUE KEY FIELD, THEN    ** FW035780
**              MESSAGE IS SPECIFIC TO THAT PASSENGER TYPE.  IF      ** FW035790
**              THE UNIQUE KEY FIELD IS X'0000', THEN MESSAGE        ** FW035800
**              APPLIES TO ALL PASSENGER TYPES/ENTIRE ENTRY.  THIS   ** FW035810
**              SECTION CAN BE RETURNED ON ANY ENTRY.                ** FW035820
**                                                                   ** FW035830
*********************************************************************** FW035840
*********************************************************************** FW035850
          ORG  FW03USR&CG1                                              FW035860
FW03RMQNB&CG1  DS   X             QUOTE NUMBER                          FW035870
FW03RMNBR&CG1  DS   XL2           MESSAGE NUMBER                        FW035880
FW03RMAPP&CG1  DS   XL2           APPLICATION NUMBER                    FW035890
FW03RMTYP&CG1  DS   X             MESSAGE TYPE                          FW035900
#FW03RMEBX&CG1 EQU  X'01'         ENDORSEMENT BOX                       FW035910
#FW03RMWMS&CG1 EQU  X'02'         WARNING MESSAGE                       FW035920
#FW03RMERR&CG1 EQU  X'03'         ERROR MESSAGE                         FW035930
#FW03RMALT&CG1 EQU  X'04'         AGENT ALERT                       G03 FW035940
#FW03RMINT&CG1 EQU  X'05'         INTERNAL MESSAGE - REQUESTER USE ONLY FW035950
#FW03RMTG8&CG1 EQU  X'06'         TAG 8 MESSAGE                         FW035960
#FW03RMVLD&CG1 EQU  X'07'         VALIDITY MESSAGE                  G03 FW035970
*                                                                       FW035980
FW03RMLNG&CG1  DS   X             LANGUAGE                              FW035990
#FW03RMENG&CG1 EQU  X'00'         ENGLISH - DEFAULT                     FW036000
#FW03RMFRC&CG1 EQU  X'01'         FRENCH CANADIEN - NOT AVAILABL ON G03 FW036010
*                                                   ALL ENTRIES         FW036020
#FW03RMESP&CG1 EQU  X'02'         SPANISH - NOT YET AVAILABLE           FW036030
#FW03RMPOR&CG1 EQU  X'03'         PORTUGESE -  NOT YET AVAILABLE    G03 FW036040
*                                                                       FW036050
FW03RMMSG&CG1  DS   0C            MESSAGE                               FW036060
*********************************************************************** FW036070
** END OF MESSAGE SECTION                                            ** FW036080
*********************************************************************** FW036090
FW03EMM&CG1  EQU  *                END OF MESSAGE SECTION               FW036100
          EJECT                                                         FW036110
*********************************************************************** FW036120
*********************************************************************** FW036130
**                                                                   ** FW036140
** SECTION INFORMATION:                                              ** FW036150
**                                                                   ** FW036160
** TYPE:        RESPONSE                                             ** FW036170
** NAME:        FIC OVERRIDE INFORMATION                             ** FW036180
** IDENTIFIER:  O                                                    ** FW036190
**                                                                   ** FW036200
** PRIME KEY:   X'38'                                                ** FW036210
** ITEM ID:     FO                                                   ** FW036220
** UNIQUE KEY:  SEGMENT NUMBER                                       ** FW036230
**                                                                   ** FW036240
** PURPOSE:     THIS SECTION CONTAINS FIC OVERRIDE INFORMATION THAT  ** FW036250
**              APPLIES TO INDIVIDUAL SEGMENTS.  THE UNIQUE KEY      ** FW036260
**              IS THE SEGMENT NUMBER THIS SECTION SUPPLIES          ** FW036270
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW036280
**                                                                   ** FW036290
**              FQ..., $B..., AND $Q...                              ** FW036300
**                                                                   ** FW036310
*********************************************************************** FW036320
*********************************************************************** FW036330
          ORG  FW03USR&CG1                                              FW036340
FW03ROQNB&CG1 DS    X              QUOTE NUMBER                         FW036350
FW03ROFIC&CG1 DS    CL8            FIC FARE BASIS CODE                  FW036360
FW03ROFIN&CG1 DS   0CL6            FIC INDICATORS                   G02 FW036370
FW03ROFI1&CG1 DS    X              INDICATOR BYTE 1                     FW036380
*                                                                       FW036390
*                       IFQ BIT DEFINITIONS                             FW036400
*                                                                       FW036410
*                       BIT 0 = 1 - NO RULES AVAILABLE FOR VALIDATION   FW036420
*                       BIT 1 = 1 - MINIMUM STAY FAILURE                FW036430
*                       BIT 2 = 1 - ADVANCE PURCHASE FAILUE             FW036440
*                       BIT 3 = 1 - PIC TYPE FAILURE                    FW036450
*                       BIT 4 = 1 - STOPOVERS/TRANSFERS FAILURE         FW036460
*                       BIT 5 = 1 - DATE OF TVL/SEASONALITY FAILURE     FW036470
*                       BIT 6 = 1 - MAXIMUM STAY FAILURE                FW036480
*                       BIT 7 = 1 - ROUTING FAILURE                     FW036490
*                                                                       FW036500
*                       FQS BIT DEFINITIONS                             FW036510
*                                                                       FW036520
*                       CAT 1 - GENERAL INFORMATION                     FW036530
*                       BITS 0-3 = 0 - PASSED                           FW036540
*                       BIT 0 = 1 - EXPIRATION DATE NOT MET             FW036550
*                       BIT 1 = 1 - CHILDS MIN/MAX AGE NOT MET          FW036560
*                       BIT 2 = 1 - FIRST EFF TRVL DATE NOT MET         FW036570
*                       BIT 3 = 1 - SECOND EFF TRVL DATE NOT MET        FW036580
*                                                                       FW036590
*                       CAT 2 - DAY/TIME APPLICATION                    FW036600
*                       BITS 4-5 = 0 - PASSED                           FW036610
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)           FW036620
*                       BIT 5 = 1 - CATEGORY INCOMPLETE (NOT  VALIDATED FW036630
*                                                                       FW036640
*                       CAT 3 - SEASONAL APPLICATION                    FW036650
*                       BITS 6-7 = 0 - PASSED                           FW036660
*                       BIT  6 = 1 - CATEGORY NOT MET (FAILED)          FW036670
*                       BIT  7 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED FW036680
*                                                                       FW036690
FW03ROFI2&CG1 DS    X              INDICATOR BYTE 2                     FW036700
*                                                                       FW036710
*                       IFQ BIT DEFINITIONS                             FW036720
*                                                                       FW036730
*                       BIT 0 = 1 - MILEAGE FAILURE                     FW036740
*                       BIT 1 = 1 - DAY/TIME FAILURE                    FW036750
*                       BIT 2 = 1 - BOOKING CLASS FAILURE               FW036760
*                       BIT 3 = 1 - COMBINEABILITY FAILURE              FW036770
*                       BIT 4 = 1 - OPEN JAW USEAGE FAILURE             FW036780
*                       BIT 5 = 1 - INDIRECT TRAVEL PROVISIONS          FW036790
*                       BIT 6 = 1 - SALES RESTRICTION NOT MET           FW036800
*                       BIT 7 = 1 - FIC'D NORTH AMERICAN FARE           FW036810
*                                                                       FW036820
*                       FQS BIT DEFINITIONS                             FW036830
*                                                                       FW036840
*                       CAT 4 - FLIGHT APPLICATION                      FW036850
*                       BITS 0-1 = 0 - PASSED                           FW036860
*                       BIT  0 = 1 - CATEGORY NOT MET (FAILED)          FW036870
*                       BIT  1 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED FW036880
*                                                                       FW036890
*                       CAT 5 - A) ADVANCED RESERVATIONS                FW036900
*                       BITS 2-3 = 0 - PASSED                           FW036910
*                       BIT  2 = 1 - CATEGORY NOT MET (FAILED)          FW036920
*                       BIT  3 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED FW036930
*                                                                       FW036940
*                       CAT 5 - B) ADVANCED TICKETING                   FW036950
*                       BITS 4-5 = 0 - PASSED                           FW036960
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)           FW036970
*                       BIT 5 = 1 - CATEGORY INCOMPLETE (NOT  VALIDATED FW036980
*                       BIT 6     - SPARE                               FW036990
*                       BIT 7 = 1 - BOOKING CLASS FAILURE               FW037000
*                                                                       FW037010
FW03ROFI3&CG1 DS    X              INDICATOR BYTE 3                     FW037020
*                                                                       FW037030
*                       IFQ BIT DEFINITIONS                             FW037040
*                                                                       FW037050
*                       BIT 0 = 1 - HIF FAILURE                         FW037060
*                       BIT 1 = 1 - INT'L SURFACE SECTOR                FW037070
*                       BIT 2 = 1 - CURRENCY USAGE FAILURE          @23
*                       BIT 3 = 1 - FAILED DISCOUNT APPLICATION     @23
*                       BIT 4 = 1 - IATA FARE NOT VALID THIS CX     @71
*                       BIT 5 = 1 - RECORD ONE UNAVAILABLE          @71
*                       BIT 6 = 1 - CAT01 ELIGIBILITY FAILED        @71
*                       BIT 7 = 1 - CAT04 FLIGHT APPLICATION FAILED @71
*
*                       FQS BIT DEFINITIONS
*                                                                       FW037090
*                       CAT 6 - MINIMUM STAY                            FW037120
*                       BITS 0-2 = 0 - PASSED                           FW037130
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)           FW037140
*                       BIT 1 = 1 - CATEGORY INCOMPLETE (NOT  VALIDATED FW037150
*                       BIT 2 = 1 - OTHER CATEGORIES CONTAIN  OCCURENCE FW037160
*                                   WHICH COULD INVALIDATE TH IS FARE   FW037170
*                                                                       FW037180
*                       CAT 7 - MAXIMUM STAY                            FW037190
*                       BITS 3-5 = 0 - PASSED                           FW037200
*                       BIT 3 = 1 - CATEGORY NOT MET (FAILED)           FW037210
*                       BIT 4 = 1 - CATEGORY INCOMPLETE (NOT  VALIDATED FW037220
*                       BIT 5 = 1 - OTHER CATEGORIES CONTAIN  OCCURENCE FW037230
*                                   WHICH COULD INVALIDATE TH IS FARE   FW037240
*                                                                       FW037250
*                       CAT 8 - SPECIAL STOPOVERS                       FW037260
*                       BITS 6-7 = 0 - PASSED                           FW037270
*                       BIT 6 = 1 - CATEGORY NOT MET (FAILED)           FW037280
*                       BIT 7 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037290
*                                                                       FW037300
FW03ROFI4&CG1 DS    X              INDICATOR BYTE 4                     FW037310
*                                                                       FW037320
*                       IFQ BIT DEFINITIONS                             FW037330
*                                                                       FW037340
*                       BIT 0 = 1 - FOOTNOTE FAILURE                    FW037350
*                       BIT 1 = 1 - CAT11 BLACKOUTS FAILED          @71
*                       BIT 2 = 1 - CAT13 ACCOM TVL REQS FAILED     @71
*                       BIT 3 = 1 - CAT19 CHILDRENS DISC FAILED     @71
*                       BIT 4 = 1 - CAT20 TOUR CONDS DISC FAILED    @71
*                       BIT 5 = 1 - CAT21 AGENTS DISCOUNTS FAILED   @71
*                       BIT 6 = 1 - (INTERNAL APOLLO USE ONLY)
*                       BIT 7 = 1 - (INTERNAL APOLLO USE ONLY)
*                                                                       FW037390
*                       FQS BIT DEFINITIONS                             FW037400
*                                                                       FW037410
*                       CAT 9 - STOPOVERS                               FW037420
*                       BITS 0-3 = 0 - PASSED                           FW037430
*                       BIT 0 = 1 - MAX STOPS REQS NOT MET (FAILED)     FW037440
*                       BIT 1 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037450
*                       BIT 2 = 1 - INBOUND STOP REQS NOT MET (FAILED)  FW037460
*                       BIT 3 = 1 - OUTBOUND STOP REQS NOT MET (FAILED) FW037470
*                                                                       FW037480
*                       CAT 9 - PERMITTED COMBINATIONS                  FW037490
*                       BITS 4-5 = 0 - PASSED                           FW037500
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)           FW037510
*                       BIT 5 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037520
*                                                                       FW037530
*                       CAT 10 - END TO END APPLICATION                 FW037540
*                       BITS 6-7 = 0 - PASSED                           FW037550
*                       BIT 6 = 1 - CATEGORY NOT MET (FAILED)           FW037560
*                       BIT 7 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037570
*                                                                       FW037580
FW03ROFI5&CG1 DS    X              INDICATOR BYTE 5                     FW037590
*                                                                       FW037600
*                       IFQ BIT DEFINITIONS                         @71
*                                                                   @71
*                       BIT 0 = 1 - CAT23 MISC FARE TAGS FAILED     @71
*                       BIT 1 = 1 - CAT25 FARE BY RULE FAILED       @71
*                       BIT 2 = 1 - CAT28 VISIT ANOTHER CO FAILED   @71
*                       BIT 3 = 1 - CAT35 NEGOTIATED FARES FAILED   @71
*                       BIT 4 = 1 - PRI CONTRACT FARE NEEDS VALID   @71
*                       BIT 5 = 1 - PRICING UNIT FAILURE         TK4629 GF031640
*                       BIT 6 = 1 - ABONNEMENT FARE FAILURE      TK4629 GF031640
*                       BIT 7 = 1 - CAT 27 TOUR CODE FAILURE     TK4629 GF031640
*                                                                   @71
*                       FQS BIT DEFINITIONS                             FW037610
*                                                                       FW037620
*                       CAT 11 - BLACKOUTS                              FW037630
*                       BITS 0-1 = 0 - PASSED                           FW037640
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)           FW037650
*                       BIT 1 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037660
*                                                                       FW037670
*                       CAT 12 - SURCHARGES                             FW037680
*                       BITS 2-3 = 0 - PASSED                           FW037690
*                       BIT 2 = 1 - CATEGORY NOT MET (FAILED)           FW037700
*                       BIT 3 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037710
*                                                                       FW037720
*                       CAT 13 - ACCOM TVL REQS                         FW037730
*                       BITS 4-5 = 0 - PASSED                           FW037740
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)           FW037750
*                       BIT 5 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037760
*                                                                       FW037770
*                       CAT 15 - SALES RESTRICTIONS                     FW037780
*                       BITS 6-7 = 0 - PASSED                           FW037790
*                       BIT 6 = 1 - CATEGORY NOT MET (FAILED)           FW037800
*                       BIT 7 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037810
*                                                                       FW037820
FW03ROFI6&CG1 DS    X              INDICATOR BYTE 6                     FW037830
*                                                                       FW037840
*                       IFQ BIT DEFINITIONS                      TK4629 GF031850
*                                                                       GF031840
*                       BITS 0-1  - SPARE /NO LONGER SET         TK4629 GF031640
*                       BIT 0 = 1 - PRICING UNIT FAILURE         TK4629 GF031640
*                       BIT 0 = 1 - CAT 27 TOUR CODE FAILURE     TK4629 GF031640
*                                                                       GF031840
*                       FQS BIT DEFINITIONS                             FW037850
*                                                                       FW037860
*                       CAT 16 - PENALTY AND FEES                       FW037870
*                       BITS 0-1 = 1 - PASSED                           FW037880
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)           FW037890
*                       BIT 1 = 1 - CATEGORY INCOMPLETE (NOT VALIDATED) FW037900
*                      BIT 2-7  SPARE                                   FW037910
*                                                                       FW037920
*********************************************************************** FW037930
** END OF FIC OVERRIDE INFORMATION                                   ** FW037940
*********************************************************************** FW037950
FW03EFO&CG1  EQU  *                END OF FIC OVERRIDE INFORMATION      FW037960
*******************************************************************
** START OF EXTENSION TO FIC OVERRIDE INFORMATION                **
*******************************************************************
FW03ROFI7&CG1 DS   X         INDICATOR BYTE 7
*
*                       FQS BIT DEFINITIONS
*
*                       CAT 17 - HIP/MILEAGE EXCEPTIONS
*                       BITS 0-1 = 0 - PASSED
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 1 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 19 - CHILDREN'S DISCOUNTS
*                       BITS 2-3 = 0 - PASSED
*                       BIT 2 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 3 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 20 - TOUR CONDUCTORS DISCOUNTS
*                       BITS 4-5 = 0 - PASSED
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 5 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 21 - AGENTS DISCOUNTS
*                       BITS 6-7 = 0 - PASSED
*                       BIT 6 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 7 = 1 - CATEGORY INCOMPLETE
*
FW03ROFI8&CG1 DS   X         INDICATOR BYTE 8
*
*                       FQS BIT DEFINITIONS
*
*                       CAT 22 - OTHER DISCOUNTS
*                       BITS 0-1 = 0 - PASSED
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 1 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 23 - MISCELLANEOUS FARE TAGS
*                       BITS 2-3 = 0 - PASSED
*                       BIT 2 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 3 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 25 - FARE BY RULE
*                       BITS 4-5 = 0 - PASSED
*                       BIT 4 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 5 = 1 - CATEGORY INCOMPLETE
*
*                       CAT 28 - VISIT ANOTHER COUNTRY
*                       BITS 6-7 = 0 - PASSED
*                       BIT 6 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 7 = 1 - CATEGORY INCOMPLETE
*
FW03ROFI9&CG1  DS   X         INDICATOR BYTE 9
*
*                       FQS BIT DEFINITIONS
*
*                       CAT 35 - NEGOTIATED FARES
*                       BITS 0-1 = 0 - PASSED
*                       BIT 0 = 1 - CATEGORY NOT MET (FAILED)
*                       BIT 1 = 1 - CATEGORY INCOMPLETE
*
*                       BIT 2 = 1 - PASSENGER TYPE FAILURE
*                       BIT 3 = 1 - RECORD ONE UNAVAILABLE
*                       BIT 4 = 1 - SURFACE SECTOR FAILED
*                       BIT 5 = 1 - INDIRECT TRAVEL FAILED
*                       BIT 6 = 1 - CURRENCY USAGE FAILED
*
*                       BIT 7     - SPARE
*
*******************************************************************
** END OF EXTENSION TO FIC OVERRIDE INFORMATION                  **
*******************************************************************
FW03EFO1&CG1 EQU  *                END OF FIC OVERRIDE INFORMATION
         EJECT                                                          FW037970
*********************************************************************** FW037980
*********************************************************************** FW037990
**                                                                   ** FW038000
** SECTION INFORMATION:                                              ** FW038010
**                                                                   ** FW038020
** TYPE:        RESPONSE                                             ** FW038030
** NAME:        PASSENGER FACILITY CHARGE INFORMATION                ** FW038040
** IDENTIFIER:  P                                                    ** FW038050
**                                                                   ** FW038060
** PRIME KEY:   X'38'                                                ** FW038070
** ITEM ID:     PF                                                   ** FW038080
** UNIQUE KEY:  X'0000'                                              ** FW038090
**                                                                   ** FW038100
** PURPOSE:     THESE SECTIONS APPLY FOR THE ENTIRE ITINERARY AND    ** FW038110
**              USED TO SUPPLY PFC INFORMATION FOR THE FOLLOWING     ** FW038120
**              ENTRIES:                                             ** FW038130
**                                                                   ** FW038140
**              FQ..., $B..., AND $Q...                              ** FW038150
**                                                                   ** FW038160
*********************************************************************** FW038170
*********************************************************************** FW038180
          ORG  FW03USR&CG1                                              FW038190
FW03RPQNB&CG1  DS   X              QUOTE NUMBER                         FW038200
FW03RPNPF&CG1  DS   X              NUMBER OF PFC ITEMS FOLLOW           FW038210
FW03RPNPP&CG1  DS   CL2            TYPE OF PFC PAID NONPAID
*                                   PD    - PAID TAX
*                                   NP    - NOT PAID TAX
*                                   BLANK - NOT PAID TAX
               DS   XL2            SPARE
FW03RPPFL&CG1  DS   0XL15          PFC ITEM FIXED LENGTH                FW038220
FW03RPPFC&CG1  DS   CL3            PFC AIRPORT CODE                     FW038230
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW038240
FW03RPPFA&CG1  DS   CL8            PFC AMOUNT                           FW038250
FW03RPCPF&CG1  DS   CL3            PFC CURRENCY CODE                    FW038260
*********************************************************************** FW038270
** END OF PFC INFORMATION                                            ** FW038280
*********************************************************************** FW038290
FW03EPF&CG1  EQU  *                END OF PFC INFORMATION               FW038300
         EJECT                                                          FW038310
*********************************************************************** FW038320
*********************************************************************** FW038330
**                                                                   ** FW038340
** SECTION INFORMATION:                                              ** FW038350
**                                                                   ** FW038360
** TYPE:        RESPONSE                                             ** FW038370
** NAME:        SEGMENT SPECIFIC INFORMATION                         ** FW038380
** IDENTIFIER:  S                                                    ** FW038390
**                                                                   ** FW038400
** PRIME KEY:   X'38'                                                ** FW038410
** ITEM ID:     SR                                                   ** FW038420
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW038430
**                                                                   ** FW038440
** PURPOSE:     THERE WILL BE ONE OF THESE SECTIONS FOR EACH         ** FW038450
**              SEGMENT IN THE ITINERARY FOR EACH QUOTE PER          ** FW038460
**              PIC TYPE QUOTED, I.E., ONE PER SEGMENT PER           ** FW038470
**              QUOTE PER PIC.  THIS SECTION SUPPLIES INFORMATION    ** FW038480
**              THE FOLLOWING ENTRIES:                               ** FW038490
**                                                                   ** FW038500
**              FQ..., $B..., AND $Q...                              ** FW038510
**                                                                   ** FW038520
*********************************************************************** FW038530
*********************************************************************** FW038540
          ORG  FW03USR&CG1                                              FW038550
FW03RSQNB&CG1 DS    X              QUOTE NUMBER                         FW038560
FW03RSRSN&CG1 DS    X              RELATIVE SEGMENT NUMBER              FW038570
FW03RSNVB&CG1 DS    XL2            NOT VALID BEFORE DATE (PARS FORMAT)  FW038580
FW03RSNVA&CG1 DS    XL2            NOT VALID AFTER DATE (PARS FORMAT)   FW038590
FW03RSSTP&CG1 DS    C              STOPOVER INDICATOR                   FW038600
*                                  X = NO STOPOVER AT OFFPOINT          FW038610
*                                  ' '= STOPOVER AT OFFPOINT            FW038620
FW03RSFBC&CG1 DS    CL8            FARE BASIS CODE                      FW038630
FW03RSTKT&CG1 DS    CL8            TICKET DESIGNATOR CODE               FW038640
FW03RSBAG&CG1 DS    CL3            BAGGAGE INFORMATION                  FW038650
FW03RSFBP&CG1 DS    CL8            FARE FOR THIS SEGMENT                FW038660
*ETKT         DS    XL4            SPARE                                FW038670
FW03RSTG1&CG1 DS    X              TAG 8 NUMBERS                   ETKT
FW03RSTG2&CG1 DS    X              TAG 8 NUMBERS                   ETKT
FW03RSFCN&CG1 DS    X              FARE COMPONENT NUMBER THAT THIS ETKT
*                                  SEGMENT IS A MEMBER OF. CAN BE  ETKT
*                                  USED TO CROSS REFERENCE TO AN   ETKT
*                                  ASSOCIATED 'PW' SECTION.        ETKT
              DS    X              SPARE                           ETKT
*                                                                       FW038680
FW03RSFLM&CG1 DS    CL5            FLOWN MILEAGE FOR THIS SEGMENT       FW038690
FW03RSMPM&CG1 DS    CL5            MAX. PERMITTED MILEAGE               FW038700
*                                                                       FW038710
FW03RSTR1&CG1 DS    X              INDICATOR                            FW038720
*              B'0 1 2 3 4 5 6 7'                                       FW038730
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦                                        FW038740
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                    FW038750
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE                                      FW038760
*                ¦ ¦ ¦ ¦ ¦ SPARE                                        FW038770
*                | | | | PRIVATE FARE QUOTED FOR THIS SEGMENT  TK4589
*                | | | |             (PW SECTION EXISTS)       TK4589
*                | | | FARE HAS A PERMITTED DISCOUNT           TK4589
*                ¦ ¦ FLAT FARE QUOTED FOR THIS SEGMENT                  FW038800
*                ¦ PRIVATE FARE OVERRIDES/WAIVERS APPLY                 FW038810
*                PRIVATE FARE QUOTED FOR THIS SEGMENT                   FW038820
*                                                                       FW038830
#FW03RSPFQ&CG1 EQU  X'80'          PRIVATE FARE QUOTED FOR THIS SEGMENT FW038840
*                                    (PV SECTION EXISTS)         TK4589
#FW03RSPOV&CG1 EQU  X'40'          PRIVATE FARE OVERRIDES/WAIVERS APPLY FW038850
#FW03RSPFT&CG1 EQU  X'20'          PRIVATE FARE FLAT QUOTD THIS SEGMENT FW038860
#FW03RSTRU&CG1 EQU  X'10'          FARE HAS A PERMITTED DISCOUNT TK4589
*                                  THEREFORE FBC IS NOT TRUNCATED K4589
#FW03RSPFW&CG1 EQU  X'08'          PRIVATE FARE QUOTED THIS SEGMEN 4589
*                                    (PW SECTION EXISTS)         TK4589
*              EQU  X'04'   BIT 5- BAGGAGE TYPE KG OR PC?    TK-P029436
*********************************************************************** FW038870
** END OF SEGMENT SPECIFIC INFORMATION                               ** FW038880
*********************************************************************** FW038890
FW03ESR&CG1  EQU  *                END OF SEGMENT SPECIFIC INFORMATION  FW038900
         EJECT                                                          FW038910
***********************************************************************
** PRIVATEFARE QUOTE DATA                                            **
***********************************************************************
FW03RSACC&CG1  DS   CL6             PFARE ACCOUNT CODE USED
FW03RSCCD&CG1  DS   CL8             PFARE CONTRACT CODE USED
FW03RSPCC&CG1  DS   CL4             PFARE PSUEDO CITY CODE USED
FW03RSCRS&CG1  DS   XL1             PFARE CRS CODE USED
FW03RSCAR&CG1  DS   CL3             PFARE CARRIER CODE - ONLY
*                                   POPULATED WHEN DISCOUNT BASED
*                                   ON YY
***********************************************************************
** END OF SEGMENT SPECIFIC INFORMATION WITH PRIVATEFARES             **
***********************************************************************
FW03RSENP&CG1  EQU  *               END OF SEGMENT SPECIFIC PFARE INFO
*
FW03RSIND&CG1  DS   X               INDICATOR
*              B'0 1 2 3 4 5 6 7'
*                | | | | | | | |
*                | | | | | | | SAME CITY CONNECTION
*                | | | | | | SPARE
*                | | | | | LAST SEGMENT IN FARE COMPONENT
*                | | | | AFQ PRICED PORTION OF INT'L ITIN.
*                | | | FARE IS A COMBINATION OF AFQ & IFQ FARES
*                | | CONNECT TO PREVIOUS
*                | CONNECT TO NEXT
*                SPECIAL STOPOVER ON BOARD POINT
*
#FW03RSSBD&CG1 EQU  X'80'          SPECIAL STOPOVER ON BOARD POINT
#FW03RSCNN&CG1 EQU  X'40'          CONNECT TO NEXT
#FW03RSCNP&CG1 EQU  X'20'          CONNECT TO PREVIOUS
#FW03RSAIF&CG1 EQU  X'10'          FARE IS A COMB. OF AFQ & IFQ FARES
#FW03RSDPI&CG1 EQU  X'08'          AFQ PRICED PORTION OF INT'L ITIN.
#FW03RSLFC&CG1 EQU  X'04'          LAST SEGMENT IN FARE COMPONENT
#FW03RSSCC&CG1 EQU  X'01'          SAME CITY CONNECTION
*
FW03RSPDA&CG1  DS   XL4            AMOUNT OF APPLIED DISCOUNT
***********************************************************************
** UPDATED END OF SEGMENT SPECIFIC INFORMATION WITH PRIVATEFARES  @20**
***********************************************************************
FW03RSEN1&CG1  EQU  *             END OF SEGMENT SPECIFIC PFARE INFO
***********************************************************************
** ENHANCED SEGMENT SPECIFIC DATA                                @51 **
***********************************************************************
FW03RSNFB&CG1  DS   CL8                NET FARE - FARE BASIS CODE
               DS   XL20               SPARES
FW03RSTFB&CG1  DS   CL8                TICKETING FARE - FARE BASIS CODE
               DS   XL20               SPARES
FW03RSPRO&CG1  DS   CL8                JOINT FARE PRORATE (EACH AIR-
*                                      LINE'S SHARE OF THE JOINT FARE
*                                      SEGMENT
***********************************************************************
** END OF ENHANCED SEGMENT SPECIFIC INFORMATION                      **
***********************************************************************
FW03RSEN2&CG1  EQU  *                  END OF NET FARE SEGMENT SPECIFIC
          EJECT
*********************************************************************** FW038920
*********************************************************************** FW038930
**                                                                   ** FW038940
** SECTION INFORMATION:                                              ** FW038950
**                                                                   ** FW038960
** TYPE:        RESPONSE                                             ** FW038970
** NAME:        PLUS UP INFORMATION                                  ** FW038980
** IDENTIFIER:  U                                                    ** FW038990
**                                                                   ** FW039000
** PRIME KEY:   X'38'                                                ** FW039010
** ITEM ID:     PU                                                   ** FW039020
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1                     ** FW039030
**                                                                   ** FW039040
** PURPOSE:     THERE CAN BE ONE OF THESE SECTIONS PER PIC TYPE.     ** FW039050
**              HOWEVER, WITHIN EACH PIC TYPE THERE CAN BE UP TO     ** FW039060
**              6 PLUS UP SECTIONS, EACH CONTAINING A DIFFERENT      ** FW039070
**              PLUS UP TYPE AND AMOUNT.  THIS SECTION SUPPLIES      ** FW039080
**              INFORMATION FOR THE FOLLOWING ENTRIES:               ** FW039090
**                                                                   ** FW039100
**              FQ..., $B..., AND $Q...                              ** FW039110
**                                                                   ** FW039120
*********************************************************************** FW039130
*********************************************************************** FW039140
          ORG  FW03USR&CG1                                              FW039150
FW03RUQNB&CG1   DS   X             QUOTE NUMBER                         FW039160
FW03RUNBR&CG1   DS   X             NUMBER OF PLUS UP ITEMS FOLLOW       FW039170
FW03RUITM&CG1   DS   0XL(#FW03RUITML&CG1) PLUS UP ITEM LENGTH           FW039180
FW03RUCT1&CG1   DS   CL3           CITY CODE 1                          FW039190
                DS   C             RESERVED FOR CITY CODE EXPANSION     FW039200
FW03RUCT2&CG1   DS   CL3           CITY CODE 2                          FW039210
                DS   C             RESERVED FOR CITY CODE EXPANSION     FW039220
FW03RUPUR&CG1   DS   CL4           PLUS UP REASON (DCM1, PTF, CTM, ETC) FW039230
FW03RUAMT&CG1   DS   CL8           PLUS UP AMOUNT                       FW039240
FW03RUNEG&CG1   DS   X             WILL BE 'X' IF PLUS UP AMOUNT IS     FW039250
*                                  NEGATIVE (IE. REDUCE AMOUNT)         FW039260
FW03RUCT3&CG1  DS   CL3                 CITY CODE 3                     FW039270
          DS   C                   RESERVED FOR CITY CODE EXPANSION     FW039280
FW03RUCT4&CG1  DS   CL3                 CITY CODE 4                     FW039290
          DS   C                   RESERVED FOR CITY CODE EXPANSION     FW039300
FW03RUSPA&CG1  DS   CL2                 MILEAGE SURCHARGE BAND          FW039310
#FW03RUITML&CG1 EQU *-FW03RUCT1&CG1                                     FW039320
*********************************************************************** FW039330
** END OF PLUS UP INFORMATION                                        ** FW039340
*********************************************************************** FW039350
FW03EPU&CG1  EQU  *                END OF PLUS UP INFORMATION           FW039360
          EJECT                                                         FW039370
*---------------------------------------------------------------------* FW039380
*     ?  SEGMENT MAPPING NUMBERS       PKY #FW03K38   DID #FW03DSM      FW039390
*---------------------------------------------------------------------* FW039400
          ORG  FW03USR&CG1                                              FW039410
FW03SCT&CG1 DS X          COUNT OF SEGMENT NUMBER PAIRS TO FOLLOW       FW039420
FW03SIT&CG1 DS 0XL2       LENGTH OF THE PAIR OF NUMBERS                 FW039430
FW03SNG&CG1 DS X          FIRST GALILEO SEGMENT NUMBER                  FW039440
FW03SNA&CG1 DS X          FIRST APOLLO SEGMENT NUMBER                   FW039450
*                         THIS LREC WILL HAVE 1-32 PAIRS OF NUMBERS     FW039460
FW03SMI&CG1 DS X          INDICATORS FOR SM RECORD                   01 FW039470
*                         BIT 0 = QUOTE NOT FOR ALL PNR SEGMENTS     01 FW039480
*                                                                       FW039490
FW03ESM&CG1 EQU *         END OF DATA ID 'SM'                           FW039500
*---------------------------------------------------------------------* FW039510
*        ARUNK SEGMENT INFORMATION     PKY #FW03K38   DID #FW03DAS      FW039520
*---------------------------------------------------------------------* FW039530
          ORG  FW03USR&CG1                                              FW039540
FW03ANA&CG1 DS X          NUMBER OF ARUNK SEGMENTS THAT FOLLOW          FW039550
FW03ASN&CG1 DS 0XL1       ARUNK SEGMENT NUMBERS START HERE              FW039560
*                                                                       FW039570
FW03EAS&CG1 EQU *         END OF DATA ID 'AS'                           FW039580
*---------------------------------------------------------------------* FW039590
*   BOOKING FILE ACCESS UTILITY LREC   PKY #FW03K38   DID #FW03DBU    * FW039600
*---------------------------------------------------------------------* FW039610
* USED TO ACCESS BOOKING FILE WORK COPY FOR ITIN AND PAX DATA           FW039620
*                                                                       FW039630
         ORG FW03USR&CG1                                                FW039640
FW03BUCB&CG1 DS X         CONTROL BYTE                                  FW039650
#FW03BUSEG&CG1 EQU  C'S'  SEGMENT SELECT SO NEED ITINERARY FROM BF      FW039660
#FW03BUPAX&CG1 EQU  C'P'  PASSENGER SELECT SO NEED PAX DATA FROM BF     FW039670
FW03BUIN&CG1 DS X         MISCALLANEOUS INDICATORS                      FW039680
*               BIT 0 = 1 MISMATCH ON RETURN PASSENGER DESCRIPTION      FW039690
*               BIT 1 - 7 SPARE                                         FW039700
FW03BUTB&CG1 DS X         TABLE NUMBER TO IDENTIFY CONFIRMED STATUS     FW039710
FW03BUTN&CG1 DS X         TOTAL NUMBER OF ITINS/PAXS 'FF' = ALL         FW039720
*G06 FW03BUPD&CG1 DS 0CL7   PASSENGER DESCRIPTION IF 'P' SELECTED       FW039730
*G06 FW03BUPA&CG1 DS CL3    PASSENGER DESCRIPTION ALPHAS                FW039740
FW03BUPD&CG1 DS 0CL9      PASSENGER DESCRIPTION IF 'P' SELECTED     G06 FW039750
FW03BUPA&CG1 DS CL5       PASSENGER DESCRIPTION ALPHAS              G06 FW039760
FW03BUPN&CG1 DS CL4       PASSENGER DESCRIPTION PACKED NUMERICS         FW039770
FW03BUEP&CG1 DS CL10      PASSENGER DESCRIPTION AS ENTERED BY AGENT     FW039780
FW03BUNO&CG1 DS 0XL1      INDIVIDUAL NUMBER ITINS/PAXS IF PAX/SEG       FW039790
*                         SELECT BEGIN HERE                             FW039800
FW03EBU&CG1 EQU *         END OF DATA ID 'BU'                           FW039810
.**************************** <-- INSERT NEW LRECS HERE *************** FW039820
.*                                                                      FW039830
*******NEW DOMESTIC FARE QUOTE LRECS  TK4487*************************** FW011720
** IF IT IS GLOBAL FARES LREC PUT IT BEFORE**************************** FW011730
*********************************************************************** FW011720
**                                                                   ** FW011730
** SECTION INFORMATION:                                              ** FW011740
**                                                                   ** FW011750
** TYPE:        QUERY/RESPONSE                                       ** FW011760
** NAME:        SALES DATE                                           ** FW011770
** IDENTIFIER:  X                                                    ** FW011780
**                                                                   ** FW011790
** PRIME KEY:   X'38'                                                ** FW011800
** ITEM ID:     ST                                                   ** FW011810
** UNIQUE KEY:  NONE                                                 ** FW011820
**                                                                   ** FW011830
** PURPOSE:     SHOW SALES DATE FOR HISTORICAL FARE                  ** FW011840
**                                           TK4487                  ** FW011860
*********************************************************************** FW011870
*********************************************************************** FW011880
          ORG  FW03USR&CG1                                              FW011890
*                                                                       FW011900
FW03STSTR&CG1  DS   0XL7           QUERY SALES DATE INFORMATION         FW011910
FW03STDAT&CG1  DS   CL7            SALES DATE                           FW011920
*                                                                       FW011930
*                                                                       FW012080
*********************************************************************** FW012210
** END OF ST  INFORMATION                                            ** FW012220
FW03EST&CG1  EQU  *                END OF ST  INFORMATION               FW012240
*********************************************************************** FW011720
**                                                                   ** FW011730
** SECTION INFORMATION:                                              ** FW011740
**                                                                   ** FW011750
** TYPE:        QUERY/RESPONSE                                       ** FW011760
** NAME:        PIC CODES                                            ** FW011770
** IDENTIFIER:  Y                                                    ** FW011780
**                                                                   ** FW011790
** PRIME KEY:   X'38'                                                ** FW011800
** ITEM ID:     PS                                                   ** FW011810
** UNIQUE KEY:  PASSENGER NUMBER STARTING FROM 1                     ** FW011820
**                                                                   ** FW011830
** PURPOSE:     PASSENGER INFORMATION FOR BOTH QUERIES AND           ** FW011840
**              RESPONSES FOR ANY ENTRY THAT SUPPORTS PIC CODES.     ** FW011850
**    TK4487    DOMESTIC PASSENGER INFORMATION                       ** FW011860
*********************************************************************** FW011870
*********************************************************************** FW011880
          ORG  FW03USR&CG1                                              FW011890
*                                                                       FW011900
FW03FSPIQ&CG1  DS   0XL14          QUERY PIC INFORMATION                FW011910
FW03FSPIC&CG1  DS   CL10           PIC CODE REQUESTED                   FW011920
*                                                                       FW011930
FW03FSAMT&CG1  DS   XL4            REQUEST AMOUNT                       FW011940
*                                                                       FW011950
FW03FSIN1&CG1  DS   X              INDICATOR                            FW011960
#FW03FSITA&CG1 EQU  X'80'          IATA FORMAT                          FW011970
#FW03FSATP&CG1 EQU  X'40'          APOLLO FORMAT                        FW011980
#FW03FSPCT&CG1 EQU  X'20'          AMOUNT IS PERCENTAGE                 FW011990
#FW03FSAMT&CG1 EQU  X'10'          AMOUNT IS AMOUNT                     FW012000
#FW03FSAGE&CG1 EQU  X'08'          AMOUNT IS AGE                        FW012010
#FW03FSEQU&CG1 EQU  X'04'          RETURNED SAME AS REQUESTED           FW012020
*                                                                       FW012030
FW03FSPIO&CG1  DS   0XL14          RESPONSE PIC INFORMATION - VALID ON  FW012040
*                                       FARE QUOTE PROCESSING ONLY      FW012050
*                                                                       FW012060
FW03FSPIR&CG1  DS   CL10           PIC CODE RETURNED                    FW012070
*                                                                       FW012080
FW03FSAMR&CG1  DS   XL4            RETURN AMOUNT                        FW012090
*                                                                       FW012100
FW03FSIN2&CG1  DS   X              INDICATOR                            FW012110
#FW03FSITR&CG1 EQU  X'80'          IATA FORMAT PIC - 2 BYTE PIC         FW012120
#FW03FSATR&CG1 EQU  X'40'          ATPCO FORMAT PIC  - 3 BYTE PIC       FW012130
#FW03FSPCR&CG1 EQU  X'20'          AMOUNT IS PERCENTAGE                 FW012140
#FW03FSAMR&CG1 EQU  X'10'          AMOUNT IS AMOUNT                     FW012150
#FW03FSAGR&CG1 EQU  X'08'          AMOUNT IS AGE                        FW012160
#FW03FSPFC&CG1 EQU  X'04'          PFC'S APPLY                          FW012170
#FW03FSBPC&CG1 EQU  X'02'          BP00N1 AWARD FARE       TK4646       FW012170
#FW03FSZZC&CG1 EQU  X'01'          ECN ZS CODE             CQFM
*                                                                       FW012180
FW03FSNBR&CG1  DS   X              NUMBER OF PASSENGERS WITH THIS PIC   FW012190
FW03FSPSG&CG1  DS   CL2            PASSENGER NBR (MULTIPLE MAY EXIST)   FW012200
*********************************************************************** FW012210
** END OF PIC INFORMATION                                            ** FW012220
*********************************************************************** FW012230
FW03EPS&CG1  EQU  *                END OF PIC INFORMATION               FW012240
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        ENHANCED PRIVATE FARE FIXED INFORMATION              **
** IDENTIFIER:  Z                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     PQ                                                   **
** UNIQUE KEY:  X'0000'                                              **
**                                                                   **
** PURPOSE:     PROVIDE  PRIVATE FARE REQUESTER INFORMATION          **
**                                                                   **
** OKTAY ZAN       T.H.Y       FIX:TK4574         25/03/2003         **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
*                                                                       FW011900
FW03QZDPC&CG1 DS CL5           DEPARTMENT CODE
FW03QZDPN&CG1 DS CL7           DEPARTMENT NUMBER
FW03QZERP&CG1 DS CL8           ELECTRONIC RESERVATION SERVICE
*                              PROVIDER(FUTURE)
FW03QZCRT&CG1 DS CL3           CRT LOCATION
FW03QZIN1&CG1 DS XL1           PRIVATE FARES INDICATOR
*
*              B'0 1 2 3 4 5 6 7'
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ ¦
*                ¦ ¦ ¦ ¦ ¦ ¦ ¦ SPARE
*                ¦ ¦ ¦ ¦ ¦ ¦ SPARE
*                ¦ ¦ ¦ ¦ ¦ SPARE
*                ¦ ¦ ¦ ¦ SPARE
*                ¦ ¦ ¦ SPARE
*                ¦ ¦ APPLY AIRLINE PRIVATE FARE (INTERNATIONAL $D ONLY)
*                ¦ APPLY AGENCY PRIVATE FARES (INT $D ONLY)
*                PRIVATE FARES ONLY
#FW03QZPRO&CG1 EQU X'80'         PRIVATE FARES ONLY
#FW03QZAGP&CG1 EQU X'40'         APPLY AGENCY PRIVATES(INT)
#FW03QZARP&CG1 EQU X'40'         APPLY AIRLINE PRIVATES(INT)
FW03QZAGY&CG1 DS CL1             AGENCY INDICATOR
#FW03QZAGY&CG1 EQU C'Y'          YES AGENCY
#FW03QZAGN&CG1 EQU C'Y'          NO NOT AN AGENCY
#FW03QZAGB&CG1 EQU C' '          BLANK UNDETERMINED
FW03QZUTY&CG1 DS XL1             USER TYPE(INTERNAL)
FW03QZSPR&CG1 DS CL4             SPARES
***********************************************************************
*        END OF ENHANCED PRIVATE FARES INFORMATION                    *
***********************************************************************
FW03EPQ&CG1  EQU *               END OF ENHANCED PRIV FARE INFO
***********************************************************************
***********************************************************************
** SECTION INFORMATION:                                             *
**                                                                  *
** TYPE:        QUERY/RESPONSE                                      *
** NAME:        ENHANCED PRIVATE FARE VARIABLE INFORMATION          *
** IDENTIFIER:  Z                                                   *
**                                                                  *
** PRIME KEY:   X'38'                                               *
** ITEM ID:     PW                                                  *
** UNIQUE KEY:  FOR QUERY LREC:                                     *
**              X'0000' - IF 0, THEN APPLIES TO ENTIRE ENTRY.       *
**                        OTHERWISE, IS SEGMENT APPLICABILITY BIT   *
**                        MAP, I.E., X'8000' IS SEGMENT 1, X'4000'  *
**                        IS SEGMENT 2, ETC.                        *
**              FOR RESPONSE LREC:                                  *
**              PASSENGER DESCRIPTION NUMBER STARTING FROM 1.       *
**                                                                  *
** PURPOSE:     PROVIDE PRIVATE FARE INFORMATION FOR INPUT/OUTPUT   *
**                                                                  *
** IF THIS SECTION EXISTS FOR $D PROCESSING, THEN THERE MAY BE UP   *
** TO 3 ACCOUNT/PSEUDO/CRS ITEMS, BUT ONLY 1 CONTRACT CODE.  IN     *
** THIS CASE, UP TO 3 PRIVATE FARE LRECS MAY BE BUILT, BUT ONLY     *
** THE FIRST WILL HAVE THE CONTRACT CODE FILLED IN.                 *
**                                                                  *
** METHOD TO CROSS REFERENCE THE RESPONSE 'PW' WITH A RESPONSE      *
** 'SR':  FIRST MATCH ON THE UNIQUE KEYS, THEN MATCH ON QUOTE       *
** NUMBERS, THEN MATCH ON FARE COMPONENT NUMBER (GRSFCN TO GQZFCN). *
**                                                                  *
** OKTAY ZAN              T  H  Y                  5MAR2007 CQ25432 *
*********************************************************************
          ORG  FW03USR&CG1                                          *
FW03QZPS1&CG1  DS   CL4            PSEUDO CTY                       *
FW03QZIT1&CG1  DS   CL9            IATA NUMBER                      *
FW03QZID1&CG1  DS   X              INDICATOR BYTE                   *
*                                                                   *
FW03QZCEQ&CG1  DS   X              PROVIDER CRS EQUATE              *
*                                   (FOR FUTURE INTERNAL USE ONLY,  *
*                                    FOR AGENCY PRIVATEFARES ONLY)  *
*                                   (SEE GQHCRS FOR EQUATE VALUES)  *
* NOTE: SEE GQHCRS FOR EQUATE VALUES                                *
FW03QZIN2&CG1  DS   XL1            PRIVATE FARES INDICATOR          *
*              B'0 1 2 3 4 5 6 7'                                   *
*                | | | | | | | |                                    *
*                | | | | | | | SPARE                                *
*                | | | | | | SPARE                                  *
*                | | | | | SPARE                                    *
*                | | | | SPARE                                      *
*                | | | SPARE                                        *
*                | | (INTERNAL)                                     *
*                | (INTERNAL)                                       *
*                REDISTRIBUTION APPLIES (INTERNAL)                  *
*                                                                   *
#FW03QZRDA&CG1 EQU  X'80'          REDISTRIBUTION APP (INTERNAL)    *
#FW03QZAAG&CG1 EQU  X'40'          (INTERNAL)                       *
#FW03QZAAR&CG1 EQU  X'20'          (INTERNAL)                       *
*                                                                   *
FW03QZACD&CG1  DS   CL20           ACCOUNT CODE                     *
FW03QZCCD&CG1  DS   CL8            CONTRACT CODE (AGENCY PRODUCT ONL*
FW03QZSP2&CG1  DS   XL4            SPARE                            *
**********************************************************************
** END OF QUERY ENHANCED PRIVATE FARES INFORMATION                   *
**********************************************************************
* *
FW03QZQNB&CG1  DS   XL1            QUOTE NUMBER                     *
FW03QZFCN&CG1  DS   XL1            FARE COMPONENT NUMBER            *
FW03QZCRD&CG1  DS   CL3            CARRIER CODE - ONLY POPULATED    *
*                                  WHEN DISCOUNT BASED ON YY        *
*                                  (AGENCY PRODUCT ONLY)            *
FW03QZIN3&CG1  DS   XL1            PRIVATE FARES INDICATOR          *
*              B'0 1 2 3 4 5 6 7'                                   *
*                | | | | | | | |                                    *
*                | | | | | | | SPARE                                *
*                | | | | | | SPARE                                  *
*                | | | | | SPARE                                    *
*                | | | | SPARE                                      *
*                | | | PUBLISHED AIRLINE PRIVATE FARE QUOTED        *
*                | | DISCOUNT AIRLINE PRIVATE FARE QUOTED           *
*                | FLAT FARE QUOTED            (AGENCY PRODUCT ONLY)*
*                PRIVATE FARES OVERRIDES APPLY (AGENCY PRODUCT ONLY)*
*                                                                   *
#FW03QZPOW&CG1 EQU  X'80'       PRIVATE FARE OVERRIDE/WAIVERS APPLY *
#FW03QZFLQ&CG1 EQU  X'40'       FLAT FARE QUOTED                    *
#FW03QZADP&CG1 EQU  X'20'       DISCOUNT AIRLINE PRIVATE FARE QUOTED*
#FW03QZAPP&CG1 EQU  X'10'       PUBLISHED AIRLINE PRIVATE FAREQUOTED*
* *
FW03QZPFB&CG1  DS   CL8         PUBLISHED FARE BASIS CODE           *
*                                THIS FIELD IS ONLY POPULATED WHEN  *
*                                A DISCOUNT PRIVATE FARE HAS BEEN   *
*                                QUOTED. NEEDED FOR RULES FOLLOWONS.*
*********************************************************************
** END OF RESPONSE ENHANCED PRIVATE FARES INFORMATION               *
*********************************************************************
FW03EPW&CG1 EQU  *    END OF ENHANCED PRIVATE FARES INFO            *
***********************************************************************
***********************************************************************
** SECTION INFORMATION:                                             *
**                                                                  *
** TYPE:        QUERY                                               *
** NAME:        PRICING ITA - CODESHARE SEGMENT INFO                *
** IDENTIFIER:  Z                                                   *
**                                                                  *
** PRIME KEY:   X'38'                                               *
** ITEM ID:     IC                                                  *
** UNIQUE KEY:  RELATIVE SEGMENT NUMBER                             *   FW025270
**                                                                  *   FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ITINERARY INFORMATION*   FW025290
**              FOR THE FOLLOWING ENTRIES:                          *   FW025300
**                                                                  *   FW025310
**              FQ..., $B..., AND $Q...                             *   FW025320
** OKTAY ZAN          T  H  Y                  TK-PRICING           *   FW025330
*********************************************************************   FW025340
          ORG  FW03USR&CG1                                          *
FW03QQCXR&CG1  DS   CL2            OPERATING CARRIER CODE               FW025620
               DS   C              RESERVED FOR CARRIER CODE EXPANSION  FW025630
FW03QQFLT&CG1  DS   CL4            OPERATING CARRIER FLIGHT NUMBER      FW025640
               DS   XL2            SPARE                                FW025650
FW03QQBRD&CG1  DS   CL3            BOARD POINT                          FW025660
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW025670
FW03QQOFF&CG1  DS   CL3            OFF POINT                            FW025680
               DS   C              RESERVED FOR CITY CODE EXPANSION     FW025690
FW03QQIC1&CG1  DS   X              INDICATOR 1                          FW025700
FW03QQIC2&CG1  DS   X              INDICATOR 2                          FW025700
FW03QQIC3&CG1  DS   X              INDICATOR 3                          FW025700
FW03QQIC4&CG1  DS   X              INDICATOR 4                          FW025700
FW03QQICX&CG1  DS   XL20           SPARE AREA                           FW025700
*********************************************************************
** END OF RESPONSE ENHANCED PRIVATE FARES INFORMATION               *
*********************************************************************
FW03EIC&CG1 EQU  *    END OF CODESHARE INOF                         *
***********************************************************************
***********************************************************************
** SECTION INFORMATION:                                             *
**                                                                  *
** TYPE:        QUERY                                               *
** NAME:        PRICING ITA - CODESHARE SEGMENT INFO                *
** IDENTIFIER:  Z                                                   *
**                                                                  *
** PRIME KEY:   X'38'                                               *
** ITEM ID:     CW                                                  *
** UNIQUE KEY:  CATEGORY NUMBER FOR WAVE WITH FQ/FQBB               *   FW025270
**                                                                  *   FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ITINERARY INFORMATION*   FW025290
**              FOR THE FOLLOWING ENTRIES:                          *   FW025300
**                                                                  *   FW025310
**              FQ..., $B..., AND $Q...                             *   FW025320
** OKTAY ZAN          T  H  Y                  TK-PRICING           *   FW025330
*********************************************************************   FW025340
          ORG  FW03USR&CG1                                          *
FW03CWCAT&CG1  DS   CL20           CATEGORY INFO STRING                 FW025620
               DS   CL40           SPARE                                FW025630
***********************************************************************
** END OF CATEGORY WAVE INFO                                          *
***********************************************************************
FW03ECW&CG1 EQU  *    END OF CATEGORY WAVE INFO                       *
***********************************************************************
***********************************************************************
** SECTION INFORMATION:                                             *
**                                                                  *
** TYPE:        QUERY                                               *
** NAME:        PRICING ITA - SEGMENT SCHEDULE  INFO                *
** IDENTIFIER:  Z                                                   *
**                                                                  *
** PRIME KEY:   X'38'                                               *
** ITEM ID:     CS                                                  *
** UNIQUE KEY:  RELATIVE SEGMENT NUMBER                             *   FW025270
**                                                                  *   FW025280
** PURPOSE:     THIS SECTION IS USED TO SUPPLY ITINERARY INFORMATION*   FW025290
**              FOR THE FOLLOWING ENTRIES:                          *   FW025300
**                                                                  *   FW025310
**              FQ..., $B..., AND $Q...                             *   FW025320
** OKTAY ZAN          T  H  Y                  TK-PRICING           *   FW025330
*********************************************************************   FW025340
          ORG  FW03USR&CG1                                          *
FW03QSCTT&CG1  DS   CL146         SCHEDULE ITEM                         FW025620
         ORG FW03QSCTT&CG1                                              FW007490
FW03QSCAB&CG1  DS   CL4           CABIN CLASS (MAX.4)                   FW025620
         ORG FW03QSCAB&CG1                                              FW007490
FW03QSCB1&CG1  DS   CL1            1.CABIN CLASS INFO                   FW025620
FW03QSCB2&CG1  DS   CL1            2.CABIN CLASS INFO                   FW025620
FW03QSCB3&CG1  DS   CL1            3.CABIN CLASS INFO                   FW025620
FW03QSCB4&CG1  DS   CL1            4.CABIN CLASS INFO                   FW025620
FW03QSCIT&CG1  DS   CL38          AIRPORT CODE (MAX.4)                  FW025640
         ORG FW03QSCIT&CG1                                              FW007490
FW03QSCFD&CG1  DS   CL2            FILING DATE                          FW025640
FW03QSCI1&CG1  DS   CL3            1.AIRPORT CODE                       FW025640
FW03QSDD1&CG1  DS   CL2            1.AIRPORT DATE DISCREPANCY           FW025640
FW03QSAR1&CG1  DS   CL2            1.AIRPORT ARR TIME                   FW025640
FW03QSDP1&CG1  DS   CL2            1.AIRPORT DEP TIME                   FW025640
FW03QSCI2&CG1  DS   CL3            2.AIRPORT CODE                       FW025640
FW03QSDD2&CG1  DS   CL2            2.AIRPORT DATE DISCREPANCY           FW025640
FW03QSAR2&CG1  DS   CL2            2.AIRPORT ARR TIME                   FW025640
FW03QSDP2&CG1  DS   CL2            2.AIRPORT DEP TIME                   FW025640
FW03QSCI3&CG1  DS   CL3            3.AIRPORT CODE                       FW025640
FW03QSDD3&CG1  DS   CL2            3.AIRPORT DATE DISCREPANCY           FW025640
FW03QSAR3&CG1  DS   CL2            3.AIRPORT ARR TIME                   FW025640
FW03QSDP3&CG1  DS   CL2            3.AIRPORT DEP TIME                   FW025640
FW03QSCI4&CG1  DS   CL3            4.AIRPORT CODE                       FW025640
FW03QSDD4&CG1  DS   CL2            4.AIRPORT DATE DISCREPANCY           FW025640
FW03QSAR4&CG1  DS   CL2            4.AIRPORT ARR TIME                   FW025640
FW03QSDP4&CG1  DS   CL2            4.AIRPORT DEP TIME                   FW025640
FW03QSCSC&CG1  DS   CL104         CABIN AND SELLING CLASS (MAX.26)      FW025660
         ORG FW03QSCSC&CG1                                              FW007490
FW03QSCC1&CG1  DS   CL1            1.CABIN CLASS NUMBER                 FW025660
FW03QSCS1&CG1  DS   CL1            1.SELLING CLASS                      FW025660
FW03QSCA1&CG1  DS   CL2            1.SELLING CLASS/AVL.SEAT COUNT       FW025660
FW03QSCC2&CG1  DS   CL1            2.CABIN CLASS NUMBER                 FW025660
FW03QSCS2&CG1  DS   CL1            2.SELLING CLASS                      FW025660
FW03QSCA2&CG1  DS   CL2            2.SELLING CLASS/AVL.SEAT COUNT       FW025660
*    '                               LAST SLOT 26
               DS   CL96                                                FW025660
FW03QINDS&CG1  DS  0XL5            INDICATORS                           FW025660
FW03QIND1&CG1  DS  XL1          BIT0-RTDP SET.                          FW025660
FW03QIND2&CG1  DS  XL1            INDICATORS                            FW025660
FW03QIND3&CG1  DS  XL1            INDICATORS                            FW025660
FW03QIND4&CG1  DS  XL1            INDICATORS                            FW025660
FW03QIND5&CG1  DS  XL1            INDICATORS                            FW025660
*********************************************************************
** END OF RESPONSE ENHANCED PRIVATE FARES INFORMATION               *
*********************************************************************
FW03ECS&CG1 EQU  *    END OF CODESHARE INOF                         *
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        RESPONSE                                             **
** NAME:        ENHANCED GENERAL QUOTE INFORMATION                   **
** IDENTIFIER:  G                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     EQ                                                   **
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        **
**                                                                   **
** PURPOSE:     THERE WILL BE ONE OR MORE OF THESE SECTIONS FOR      **
**              EACH PIC TYPE  QUOTED.  CHARACTER AMOUNT FIELDS WILL **
**              HAVE DECIMALS IN PLACE.  THE FIELDS WILL BE          **
**              READY FOR OUTPUT DISPLAY.  THIS SECTION SUPPLIES     **
**              INFORMATION FOR THE FOLLOWING ENTRIES:               **
**                                                                   **
**              FQ..., $B...                                         **
**                                                         TK4589    **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
FW03EQQNB&CG1  DS   X                QUOTE NUMBER
FW03EQIN1&CG1  DS   X                AUTO RULE INDICATORS - BYTE 1
*              B'0 1 2 3 4 5 6 7'
*                | | | | | | | |
*                | | | | | | | SPARE
*                | | | | | | SPARE
*                | | | | | LLPF QUOTED
*                | | | | TICKETING FARE RETURNED
*                | | | NET FARE RETURNED
*                | | PLATING CARRIER RESTRICTION EXISTS
*                | PAPER TICKET RESTRICTION EXISTS
*                ELECTRONIC TICKET RESTRICTION EXISTS
*
#FW03EQETR&CG1 EQU  X'80'          ELECTRONIC TKT RESTRICTION EXISTS
#FW03EQPTR&CG1 EQU  X'40'          PAPER TICKET RESTRICTION EXISTS
#FW03EQPCR&CG1 EQU  X'20'          PLATING CARRIER RESTRICTION EXIST
#FW03EQNFR&CG1 EQU  X'10'          NET FARE RETURNED
#FW03EQTFR&CG1 EQU  X'08'          TICKETING FARE RETURNED
#FW03EQPF3&CG1 EQU  X'04'          LLPF QUOTED
*
FW03EQIN2&CG1  DS   X                  AUTO RULE INDICATORS - BYTE 2
*              B'0 1 2 3 4 5 6 7'
*                | | | | | | | |
*                | | | | | | | SPARE
*                | | | | | | SPARE
*                | | | | | SPARE
*                | | | | SPARE
*                | | | SPARE
*                | | SPARE
*                | SPARE
*                SPARE
*
FW03EQSPR&CG1  DS   XL20               SPARES
**********
* ADDITIONAL QUOTE INFORMATION FOR NEGOTIATED FARES
**********
FW03EQNCC&CG1  DS   CL3             NET FARE CURRENCY CODE
FW03EQNFA&CG1  DS   PL6             NET FARE AMOUNT
FW03EQNDC&CG1  DS   X               NET FARE NUMBER OF DECIMAL PLACES
*
FW03EQNEC&CG1  DS   CL3             EQUIVALENT NET FARE CURRENCY CODE
FW03EQNEA&CG1  DS   PL6             EQUIVALENT NET FARE AMOUNT
FW03EQNED&CG1  DS   X               EQUIVALENT NET FARE NBR OF DECIMAL
*
FW03EQNTC&CG1  DS   CL3             TOTAL NET FARE CURRENCY CODE
FW03EQNTA&CG1  DS   PL6             TOTAL NET FARE AMOUNT
FW03EQNTD&CG1  DS   X               TOTAL NET FARE NBR OF DECIMALS
*
FW03EQTCC&CG1  DS   CL3             TICKETING FARE CURRENCY CODE
FW03EQTFA&CG1  DS   PL6             TICKETING FARE AMOUNT
FW03EQTDC&CG1  DS   X               TKTG FARE NUMBER OF DECIMAL PLACES
*
FW03EQTEC&CG1  DS   CL3             EQUIVALENT TKTG FARE CURRENCY CODE
FW03EQTEA&CG1  DS   PL6             EQUIVALENT TKTG FARE AMOUNT
FW03EQTED&CG1  DS   X               EQUIV TKTG FARE NBR OF DECIMALS
*
FW03EQTTC&CG1  DS   CL3             TOTAL TKTG FARE CURRENCY CODE
FW03EQTTA&CG1  DS   PL6             TOTAL TICKETING FARE AMOUNT
FW03EQTTD&CG1  DS   X               TOTAL TKTG FARE NBR OF DECIMALS
*
***********************************************************************
** END OF ENHANCED GENERAL QUOTE INFORMATION                         **
***********************************************************************
FW03EEQ&CG1  EQU  *               END OF ENHANCED GENERAL QUOTE INFO
          EJECT
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        RESPONSE                                             **
** NAME:        NET FARE TAX SECTION                                 **
** IDENTIFIER:  G                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     TN                                                   **
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        **
**                                                                   **
** PURPOSE:   THERE MAY BE ONE OR MORE OF THESE SECTIONS FOR         **
**            EACH PASSENGER DESCRIPTION QUOTED.                     **
**            THIS AREA PROVIDES A BREAKDOWN OF ALL TAXES            **
**            QUOTED ON A E*FARE GENERATED NET FARE (FOR             **
**            ATPCO CATEGORY 35 NEGOTIATED FARES)                    **
**                                                                   **
**            THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING    **
**            ENTRIES:                                               **
**                                                                   **
**            FQ..., $B...                                           **
**                                                                   **
**                                                          TK4589   **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
*
FW03TNQNB&CG1  DS   X                  QUOTE NUMBER
FW03TNTXN&CG1  DS   X                  NUMBER OF TAX FIELDS
FW03TNTXL&CG1  DS   0XL10              TAX ITEM SECTION FIXED LENGTH
FW03TNTXC&CG1  DS   CL2                TAX - COUNTRY CODE
FW03TNTXA&CG1  DS   CL8                TAX - AMOUNT
***********************************************************************
** END NET FARE TAX SECTION                                          **
***********************************************************************
FW03ETN&CG1  EQU  *               END OF ENHANCED GENERAL QUOTE INFO
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        RESPONSE                                             **
** NAME:        TICKETING FARE TAX SECTION                           **
** IDENTIFIER:  G                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     TT                                                   **
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        **
**                                                                   **
** PURPOSE:   THERE MAY BE ONE OR MORE OF THESE SECTIONS FOR         **
**            EACH PASSENGER DESCRIPTION QUOTED.                     **
**            THIS AREA PROVIDES A BREAKDOWN OF ALL TAXES            **
**            QUOTED ON A E*FARE GENERATED TICKETING FARE (FOR       **
**            ATPCO CATEGORY 35 NEGOTIATED FARES)                    **
**                                                                   **
**            THIS SECTION SUPPLIES INFORMATION FOR THE FOLLOWING    **
**            ENTRIES:                                               **
**                                                                   **
**            FQ..., $B...                                           **
**                                                                   **
**                                                                   **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
*
FW03TTQNB&CG1  DS   X                  QUOTE NUMBER
FW03TTTXN&CG1  DS   X                  NUMBER OF TAX FIELDS
FW03TTTXL&CG1  DS   0XL10              TAX ITEM SECTION FIXED LENGTH
FW03TTTXC&CG1  DS   CL2                TAX - COUNTRY CODE
FW03TTTXA&CG1  DS   CL8                TAX - AMOUNT
***********************************************************************
** END TICKETING FARE TAX SECTION
***********************************************************************
FW03ETT&CG1  EQU  *                    END OF NET TAX INFO
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        ETICKETING INFO                                      **
** IDENTIFIER:  G                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     TK                                                   **
** UNIQUE KEY:                                                       **
**                                                                   **
** PURPOSE:   THIS RECORD CONTAINS  QUOTE NUMBER ,TKT NUMBER,AND,    **
**            SALES DATE INFORMATION FROM ETKT DATABASE FOR DOMESTIC **
**            REISSUE FARE QUOTE                                     **
**                                                                   **
**                                                                   **
**                                                                   **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
*
FW03TKQNB&CG1  DS   X                  QUOTE NUMBER
FW03TKTKT&CG1  DS   CL13               TKT NUMBER
FW03TKSDT&CG1  DS   XL2                SALES DATE
FW03TKTRC&CG1  DS   CL15               TOUR CODE
FW03TKOCC&CG1  DS   CL3                ORIGINAL TICKET ISSUE CITY
FW03TKNSH&CG1  DS   CL4                NO-SHOW CPN NUMBERS   TK-PRICING
FW03TKTIM&CG1  DS   CL4                ISSUE TIME            TK-PRICING
FW03TKPOS&CG1  DS   CL6                POS/PSEUDO CITY KODE  TK-P011861
*                                      EX. QTKIST            TK-P011861
*TK-P...OZ     DS   CL10               SPARE                 TK-PRICING
FW03TKAGT&CG1  DS   CL1                AGENT TYPE            TK-P..OZ
FW03TKAAT&CG1  DS   CL2                AGENT/AIRLINE ID      TK-P..OZ
FW03TKNUS&CG1  DS   XL1                GENERAL IND. AREA     TKT-180
*                                      BIT-0 NON-USED TKT    TKT-180
*                                      BIT-1 USED TKT        TKT-180
FW03TKPTP&CG1  DS   CL3                PASSENGER TYPE        TKT-83
FW03TKSCH&CG1  DS   CL1                SALES CHANNEL         TK-P020685
               DS   CL2                SPARE                 TK-PRICING
***********************************************************************
** END TICKETING DATA
***********************************************************************
FW03ETK&CG1  EQU  *                    END OF ETKT DATA
***********************************************************************
***********************************************************************
**                                                                   **
** SECTION INFORMATION:                                              **
**                                                                   **
** TYPE:        QUERY                                                **
** NAME:        ETICKETING INFO                                      **
** IDENTIFIER:  G                                                    **
**                                                                   **
** PRIME KEY:   X'38'                                                **
** ITEM ID:     CL                                                   **
** UNIQUE KEY:                                                       **
**                                                                   **
** PURPOSE:   THIS RECORD CONTAINS  CPN AND TVL DATAS TOGETHER FROM  **
**            ETKT DATABASE...WE TAKE ONLY NECESSARY PARTS FROM      **
**            THESE RECORDS                                          **
**                                                                   **
**                                                                   **
**                                                                   **
***********************************************************************
***********************************************************************
          ORG  FW03USR&CG1                                              FW039150
*
FW03CLQNB&CG1  DS   XL1                QUOTE  NUMBER
FW03CLSN3&CG1  DS   CL2                COUPON NUMBER (1-4)
FW03CLSC4&CG1  DS   CL3                COUPON STATUS
*                                      'F' -FLOWN
*                                      'I',OR X'0000' -OPEN
*                                      'A' -AIRPORT CONTROL
*                                      'E' EXCHANGED
*                                      'R' REFUND
*                                      'V' VOID
FW03CLCPI&CG1  DS   CL1     BIT7-ON    XS FOUND              FILIZ
FW03CLTIM&CG1  DS   CL4                CANCELLATION TIME-GMT FILIZ
FW03CLDAT&CG1  DS   CL2                CANCELLATION DATE     FILIZ
*
FW03CLSI1&CG1  DS   CL1                INVOLUNTARY INDICATOR
FW03CLFDA&CG1  DS   XL2                DEPARTURE DATE
FW03CLFTM&CG1  DS   XL4                DEPARTURE TIME
FW03CLPLD&CG1  DS   CL3                ORIGIN CITY
FW03CLPD2&CG1  DS   CL3                DESTINATION CITY
FW03CLCO2&CG1  DS   CL3                OPERATING CARRIER
FW03CLPRD&CG1  DS   CL4                FLIGHT NUMBER OR OPEN
FW03CLCHI&CG1  DS   CL1                BOOKING DESIGNATOR-CLASS
FW03CLIDI&CG1  DS   CL1                BOOKING DESIGNATOR MODIFIER
*TK-I034938 FW03CLSN1&CG1  DS   CL3                STOPOVER CODE
FW03CLSN1&CG1  DS   0CL3               STOPOVER CODE
FW03CLSNI&CG1  DS   CL2                STOPOVER CODE        TK-I034938
FW03CLBC1&CG1  DS   CL1                CABIN CODE           TK-I034938
FW03CLLI1&CG1  DS   CL2                SEGMENT NUMBER
FW03CLSTA&CG1  DS   CL2                STATUS CODE
FW03CLRT1&CG1  DS   CL15               FARE BASIS
FW03CLPCL&CG1  DS   CL1                PREVIOUS CLASS
***********************************************************************
** END TICKETING DATA
***********************************************************************
FW03ECL&CG1  EQU  *                    END OF ETKT DATA
***********************************************************************
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        RESPONSE                                             ** FW033310
** NAME:        ADDITIONAL QUOTE INFORMATION                         ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     AD                                                   ** FW033360
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW033370
**                                                                   ** FW033380
** PURPOSE:     ADDITIONAL QUOTE AND TAX INFORMATION                 ** FW033390
**                                                                   ** FW033460
*********************************************************************** FW033470
**********************************************************************  FW033480
          ORG  FW03USR&CG1                                              FW033490
FW03RADNB&CG1  DS   X             QUOTE NUMBER                          FW033500
FW03RADIN&CG1  DS   X             BIT0- FARE ADC                        FW033500
*                                 BIT1- TAX ADC                         FW033560
*                                 BIT2-FARE+TAX ADC                     FW033620
FW03RABCC&CG1  DS   CL3           BASE FARE CURRENCY CODE               FW033680
FW03RABDA&CG1  DS   PL6           BASE FARE AMOUNT                      FW033690
FW03RABDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033700
FW03RAECC&CG1  DS   CL3           EQUIVALENT  FARE CURR.     REPRICE
FW03RAEDA&CG1  DS   PL6           EQUIVALENT  FARE AMOUNT    REPRICE
FW03RAQDC&CG1  DS   X             NUMBER OF DECIMAL PLACES   REPRICE
FW03RAADC&CG1  DS   CL3           ADDITIONAL CURRENCY CODE              FW033680
FW03RAADA&CG1  DS   PL6           ADDITIONAL AMOUNT                     FW033690
FW03RAEDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033700
FW03RATTC&CG1  DS   CL3           TOTAL - CURRENCY CODE                 FW033710
FW03RATTA&CG1  DS   PL6           TOTAL - AMOUNT (BASE FARE PLUS TAXES) FW033720
FW03RATDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033730
FW03RATXT&CG1  DS   PL6           NOT PAID TAX TOTAL AMOUNT XT          FW033690
FW03RAXDC&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033700
FW03RATXP&CG1  DS   PL6           ADDITIONAL AMOUNT                     FW033690
FW03RAPDC&CG1  DS   X             PAID TAX TOTAL AMOUNT    XT           FW033700
FW03RASPR&CG1  DS   XL20          SPARE
FW03RATXN&CG1  DS   X             NUMBER OF TAX FIELDS                  FW034220
*TKFMFW03RATXL&CG1  DS   0XL11   TAX ITEM SECTION FIXED LENGTH
*TKT-686 FW03RATXL&CG1  DS   0XL14  TAX ITEM SECTION FIXED LENGTH TKFM
FW03RATXL&CG1  DS   0XL18        TAX ITEM SECTION FIXED LENGTH TKT-686
FW03RATXI&CG1  DS   CL1           TAX  INDICATOR/P-PAID/N-NOT PAID      FW034240
FW03RATXC&CG1  DS   CL2           TAX - COUNTRY CODE                    FW034240
*TKT-686 FW03RATXA&CG1  DS   CL8           TAX - AMOUNT                 FW034250
FW03RATXA&CG1  DS   CL12          TAX - AMOUNT                 TKT-686  FW034250
FW03RATCR&CG1  DS   CL3           TAX - CURRENCY               TKFM
FW03EAD&CG1  EQU  *                    END OF ETKT DATA
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        REQUEST                                              ** FW033310
** NAME:        PASSENGER NAME INFO                                  ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     PN                                                   ** FW033360
** UNIQUE KEY:  PASSENGER DESCRIPTION NUMBER STARTING FROM 1.        ** FW033370
**                                                                   ** FW033380
** PURPOSE:     PASSENGER NAME FOR AILE DISCOUNT                     ** FW033390
**       TK006455                                                    ** FW033460
*********************************************************************** FW033470
          ORG  FW03USR&CG1                                  TK006455    FW033490
FW03PNR&CG1  DS   CL2             PASSENGER NUMBER          TK006455    FW033500
FW03PNM&CG1  DS   CL70            PASSENGER NAME            TK006455    FW033500
FW03EPN&CG1  EQU  *               END OF PASSENGER NAME DATATK006455
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        REQUEST                                              ** FW033310
** NAME:        SEGMENT PREVIOUS CLASS INFO                          ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     UC                                                   ** FW033360
** UNIQUE KEY:  SEGMENT NUMBER STARTING FROM 1.                      ** FW033370
**                                                                   ** FW033380
** PURPOSE:     BUSINESS UPGRADE PROJECT FOR DOMESTIC FQ.            ** FW033390
**       TK004477                                                    ** FW033460
*********************************************************************** FW033470
          ORG  FW03USR&CG1                                              FW033490
FW03SNR&CG1  DS   XL1             SEGMENT NUMBER                        FW033500
FW03PCL&CG1  DS   CL1             CLASS INFO                            FW033500
FW03EUC&CG1  EQU  *               END OF UPGRADE CLASS INFO
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        REQUEST                                              ** FW033310
** NAME:        USER AUTHENTICATION CODES AND SALES CHANNELS INFO    ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     UA                                                   ** FW033360
** UNIQUE KEY:  NO NEED UNIQUE KEY                                   ** FW033370
**                                                                   ** FW033380
** PURPOSE:     ALL DOMESTIC PROJECT                                 ** FW033390
**       TKFM                                                           FW033460
*********************************************************************** FW033470
          ORG  FW03USR&CG1                                              FW033490
FW03UCIT&CG1  DS   CL3             CITY CODE      WA0CIT                FW033500
FW03UCOU&CG1  DS   CL2             COUNTRY CODE                         FW033500
FW03ULNB&CG1  DS   XL3             LNIATA         WA0LNB                FW033500
FW03UTCI&CG1  DS   CL1             SALES CHANNEL  WA0TCI                FW033500
FW03UIN3&CG1  DS   XL1             T81IN3 INDICATORS                    FW033500
*                                  BIT 2 ON = CA AGENT                  T8000840
*                                  BIT 3 ON = GSA(GS)                   T8000840
*                                  BIT 4 ON = RESTRICTED GSA            T8000840
*                                  BIT 5 ON = CALL CENTER OFFICE
*                                  BIT 6 ON = CALL CENTER WEB
*                                  BIT 7 ON = AGT WTH DU TAX TK-T179768
FW03UIN5&CG1  DS   XL1             T81IN5 INDICATORS                    FW033500
*                                  BIT 2 ON =AGENT AWARD TKT ALLOWED    T8000830
*                                  BIT 3 ON =OFIS/AGENT DU APLICABLE    T8001080
FW03UIN6&CG1  DS   XL1             INDICATOR FIELD                      FW033500
*                                  BIT 0 ON = DOM (DFQ) MSG             T8000840
*                                        OFF= INT (PMW) MSG             T8000830
*                                  BIT 1 ON = FQ/UATP                   T8000840
*                                                                       T8001080
FW03UIN7&CG1  DS   XL1             SPARE INDICATOR AREA                 FW033500
*                                                                       T8000830
*                                                                       T8001080
FW03UTON&CG1  DS   XL2             OFFICE SOR NUMBER                    FW033500
*                                                                       T8000830
*                                                                       T8001080
FW03UASP&CG1  DS   XL20            SPARE                                FW033500
FW03EUA&CG1  EQU  *               END OF USER AUTHENTICATION INFO
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        RESPONSE                                             ** FW033310
** NAME:        CEZA FARE                                            ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     CZ                                                   ** FW033360
**                                                                   ** FW033380
** PURPOSE:     CEZA                             TK-P011747          ** FW033390
**                                                                   ** FW033460
*********************************************************************** FW033470
**********************************************************************  FW033480
          ORG  FW03USR&CG1                                              FW033490
FW03RACZC&CG1  DS   CL3           BASE FARE CURRENCY CODE               FW033680
FW03RACZA&CG1  DS   PL6           BASE FARE AMOUNT                      FW033690
FW03RACZD&CG1  DS   X             NUMBER OF DECIMAL PLACES              FW033700
FW03ECZ&CG1  EQU  *                    END OF ETKT DATA
*
*---------------------------------------------------------------------* FW005340
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        REQUEST&RESPONSE                                     ** FW033310
** NAME:        FARE FAMILY / BRANDED FARE                           ** FW033320
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     FF                                                   ** FW033360
**                                                                   ** FW033380
** PURPOSE:     FARE FAMILY /BRANDED FARE                            ** FW033390
**                                                                   ** FW033460
*********************************************************************** FW033470
          ORG  FW03USR&CG1                                              FW005400
*                                                                       FW005410
FW03FFSN&CG1 DS X                  NUMBER OF  SEGMENT                   FW005420
FW03FFFC&CG1 DS CL3                BRAND CODE                           FW005510
FW03FFFD&CG1 DS CL35               BRAND DESCRIPTION                    FW005520
             DS CL10               SPARE
FW03EFF&CG1 EQU *                  END OF DATA ID 'FF'                  FW005620
*********************************************************************** FW033270
**                                                                   ** FW033280
** SECTION INFORMATION:                                              ** FW033290
**                                                                   ** FW033300
** TYPE:        REQUEST                                              ** FW033310
** IDENTIFIER:  G                                                    ** FW033330
**                                                                   ** FW033340
** PRIME KEY:   X'38'                                                ** FW033350
** ITEM ID:     OR                                                   ** FW033360
**                                                                   ** FW033380
** PURPOSE:   K80 ORG LREC - ORIGINATOR OF REQUEST DETAILS              FW033390
**                                                                   ** FW033460
*********************************************************************** FW033470
          ORG  FW03USR&CG1                                              FW005400
*                                                                       FW005410
FW03CID&CG1 DS  CL3          9906 AIRLINE/CRS CODE OF SENDING SYSTEM    RR001240
FW03PLI&CG1 DS  CL3          3225 CITY CODE OF THE SYSTEM               RR001240
FW03TAI&CG1 DS  F            9900 IATA NUMBER OF THE AGENT ISSUING TKT  RR001240
FW03IH1&CG1 DS  CL9          9902 AGENCY PSEUDO CITY ETC.               RR001240
*                            RW50IH1(4)       IN USE
*                            RW50IH1+6(1)     AGENT IDENTIFIER (G,R,T)
*                            RW50IH1+7(1)     WA0TCI
*                            RW50IH1+8(1)     I-INTERNET/C-CALLCENTER
*                                             F-IFG
*
FW03PL1&CG1 DS  CL5          3225 CITY CODE OF THE AGENCY LOCATION      RR001240
FW03CI2&CG1 DS  CL3          9906 AIRLINE CODE OF ORIGINATING SYSTEM    RR001240
FW03PL3&CG1 DS  CL3          3225 CITY CODE OF ORIGINATING SYSTEM       RR001240
*                            3225  ADDING CRI IN KC0 FOR...      ADDCRI
*                            3225 ...TROYA TRANSACTIONS          ADDCRI
FW03OTC&CG1 DS  CL1          9972 TRAVEL AGENT T, AIRLINE A, ERSP E     RR001240
FW03CCD&CG1 DS  CL3          3207 ISO COUNTRY CODE OF ISSUING AGENT     RR001240
FW03OAR&CG1 DS  CL9          9904 ID OF AGENT INITIATING THE REQUEST    RR001240
*                            9904  SONIC CODE IN (RRT0OAR+2)...  ADDCRI
*                            9904  ...IF EXIST                   ADDCRI
FW03EOR&CG1 EQU *           END OF FIXED PART K80 ORG LREC              RR001280
          EJECT
         AIF   (&BG1).MACEXIT          GO IF INTERNAL USAGE             FW039840
&SYSECT CSECT                                                           FW039850
         AIF   ('&REG' EQ '').MACEXIT  GO IF REG= NOT SPECIFIED         FW039860
.GEUSING ANOP                          GENERATE USING                   FW039870
         USING &DSN,&REG                                                FW039880
.MACEXIT ANOP                                                           FW039890
         SPACE 1                                                        FW039900
         MEND                                                           FW039910
